[Survived] StringLiteral
loadtest/config.ts:18:51
 import { normalizeUrl, parseBool, ltLog, redactUrl } from './util';
 
 /** loadtest/ dir (ESM-safe). */
-export const LOADTEST_DIR = fileURLToPath(new URL('.', import.meta.url));
+export const LOADTEST_DIR = fileURLToPath(new URL("", import.meta.url));
 
 /** Placeholder DB URL (C-2) — thay credential mặc định đã bị xoá; validateEnv fail-fast khi gặp. */

[Killed] BlockStatement
loadtest/config.ts:30:55
  * KHÔNG dùng substring match `appuser`/`:secret@` — sẽ false-positive lên URL
  * dev hợp lệ có username `appuser` + password thật (loadtest/.env).
  */
-export function isKnownBadDbUrl(url: string): boolean {
-  return url === PLACEHOLDER_DB_URL || url === DEFAULT_DEV_DB_URL;
-}
+export function isKnownBadDbUrl(url: string): boolean {}
 
 export interface LoadTestEnv {
killedBy: config — validateEnv (T-03 fail-fast) production + thiếu key → errors (DB required, OTP, AUTH)
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
loadtest/config.ts:31:40
  * dev hợp lệ có username `appuser` + password thật (loadtest/.env).
  */
 export function isKnownBadDbUrl(url: string): boolean {
-  return url === PLACEHOLDER_DB_URL || url === DEFAULT_DEV_DB_URL;
+  return url === PLACEHOLDER_DB_URL || false;
 }
 
killedBy: config — validateEnv (T-03 fail-fast) default credential cũ (appuser:secret) → error (T-03)
statusReason: expected false to be true // Object.is equality

[Killed] LogicalOperator
loadtest/config.ts:31:10
  * dev hợp lệ có username `appuser` + password thật (loadtest/.env).
  */
 export function isKnownBadDbUrl(url: string): boolean {
-  return url === PLACEHOLDER_DB_URL || url === DEFAULT_DEV_DB_URL;
+  return url === PLACEHOLDER_DB_URL && url === DEFAULT_DEV_DB_URL;
 }
 
killedBy: config — validateEnv (T-03 fail-fast) production + thiếu key → errors (DB required, OTP, AUTH)
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
loadtest/config.ts:81:65
   shutdownTimeoutMs: number;
 }
 
-export function loadDotEnv(dir: string): Record<string, string> {
-  const out: Record<string, string> = {};
-  const file = path.join(dir, '.env');
-  if (!fs.existsSync(file)) return out;
-  try {
-    for (const raw of fs.readFileSync(file, 'utf8').split(/\r?\n/)) {
-      const line = raw.trim();
-      if (!line || line.startsWith('#')) continue;
-      const eq = line.indexOf('=');
-      if (eq <= 0) continue;
-      const key = line.slice(0, eq).trim();
-      let value = line.slice(eq + 1).trim();
-      if ((value.startsWith('"') && value.endsWith('"')) || (value.startsWith("'") && value.endsWith("'"))) {
-        value = value.slice(1, -1);
-      }
-      out[key] = value;
-    }
-  } catch (e) {
-    ltLog.warn(`Không đọc được loadtest/.env: ${String(e)}`);
-  }
-  return out;
-}
+export function loadDotEnv(dir: string): Record<string, string> {}
 
 let cachedEnv: LoadTestEnv | null = null;
killedBy: config — loadDotEnv (T-11) parse .env đúng: comment, quotes, khoảng trắng, line invalid
statusReason: Cannot read properties of undefined (reading 'KEY_A')

[Killed] ConditionalExpression
loadtest/config.ts:84:7
 export function loadDotEnv(dir: string): Record<string, string> {
   const out: Record<string, string> = {};
   const file = path.join(dir, '.env');
-  if (!fs.existsSync(file)) return out;
+  if (true) return out;
   try {
     for (const raw of fs.readFileSync(file, 'utf8').split(/\r?\n/)) {
killedBy: config — loadDotEnv (T-11) parse .env đúng: comment, quotes, khoảng trắng, line invalid
statusReason: expected undefined to be 'value-a' // Object.is equality

[Killed] BooleanLiteral
loadtest/config.ts:84:7
 export function loadDotEnv(dir: string): Record<string, string> {
   const out: Record<string, string> = {};
   const file = path.join(dir, '.env');
-  if (!fs.existsSync(file)) return out;
+  if (fs.existsSync(file)) return out;
   try {
     for (const raw of fs.readFileSync(file, 'utf8').split(/\r?\n/)) {
killedBy: config — loadDotEnv (T-11) parse .env đúng: comment, quotes, khoảng trắng, line invalid
statusReason: expected undefined to be 'value-a' // Object.is equality

[Killed] BlockStatement
loadtest/config.ts:85:7
   const out: Record<string, string> = {};
   const file = path.join(dir, '.env');
   if (!fs.existsSync(file)) return out;
-  try {
-    for (const raw of fs.readFileSync(file, 'utf8').split(/\r?\n/)) {
-      const line = raw.trim();
-      if (!line || line.startsWith('#')) continue;
-      const eq = line.indexOf('=');
-      if (eq <= 0) continue;
-      const key = line.slice(0, eq).trim();
-      let value = line.slice(eq + 1).trim();
-      if ((value.startsWith('"') && value.endsWith('"')) || (value.startsWith("'") && value.endsWith("'"))) {
-        value = value.slice(1, -1);
-      }
-      out[key] = value;
-    }
-  } catch (e) {
+  try {} catch (e) {
     ltLog.warn(`Không đọc được loadtest/.env: ${String(e)}`);
   }
killedBy: config — loadDotEnv (T-11) parse .env đúng: comment, quotes, khoảng trắng, line invalid
statusReason: expected undefined to be 'value-a' // Object.is equality

[Killed] BlockStatement
loadtest/config.ts:86:69
   const file = path.join(dir, '.env');
   if (!fs.existsSync(file)) return out;
   try {
-    for (const raw of fs.readFileSync(file, 'utf8').split(/\r?\n/)) {
-      const line = raw.trim();
-      if (!line || line.startsWith('#')) continue;
-      const eq = line.indexOf('=');
-      if (eq <= 0) continue;
-      const key = line.slice(0, eq).trim();
-      let value = line.slice(eq + 1).trim();
-      if ((value.startsWith('"') && value.endsWith('"')) || (value.startsWith("'") && value.endsWith("'"))) {
-        value = value.slice(1, -1);
-      }
-      out[key] = value;
-    }
+    for (const raw of fs.readFileSync(file, 'utf8').split(/\r?\n/)) {}
   } catch (e) {
     ltLog.warn(`Không đọc được loadtest/.env: ${String(e)}`);
killedBy: config — loadDotEnv (T-11) parse .env đúng: comment, quotes, khoảng trắng, line invalid
statusReason: expected undefined to be 'value-a' // Object.is equality

[Survived] MethodExpression
loadtest/config.ts:87:20
   if (!fs.existsSync(file)) return out;
   try {
     for (const raw of fs.readFileSync(file, 'utf8').split(/\r?\n/)) {
-      const line = raw.trim();
+      const line = raw;
       if (!line || line.startsWith('#')) continue;
       const eq = line.indexOf('=');

[Killed] BooleanLiteral
loadtest/config.ts:88:11
   try {
     for (const raw of fs.readFileSync(file, 'utf8').split(/\r?\n/)) {
       const line = raw.trim();
-      if (!line || line.startsWith('#')) continue;
+      if (line || line.startsWith('#')) continue;
       const eq = line.indexOf('=');
       if (eq <= 0) continue;
killedBy: config — loadDotEnv (T-11) parse .env đúng: comment, quotes, khoảng trắng, line invalid
statusReason: expected undefined to be 'value-a' // Object.is equality

[Killed] ConditionalExpression
loadtest/config.ts:88:11
   try {
     for (const raw of fs.readFileSync(file, 'utf8').split(/\r?\n/)) {
       const line = raw.trim();
-      if (!line || line.startsWith('#')) continue;
+      if (true) continue;
       const eq = line.indexOf('=');
       if (eq <= 0) continue;
killedBy: config — loadDotEnv (T-11) parse .env đúng: comment, quotes, khoảng trắng, line invalid
statusReason: expected undefined to be 'value-a' // Object.is equality

[Killed] ConditionalExpression
loadtest/config.ts:90:11
       const line = raw.trim();
       if (!line || line.startsWith('#')) continue;
       const eq = line.indexOf('=');
-      if (eq <= 0) continue;
+      if (true) continue;
       const key = line.slice(0, eq).trim();
       let value = line.slice(eq + 1).trim();
killedBy: config — loadDotEnv (T-11) parse .env đúng: comment, quotes, khoảng trắng, line invalid
statusReason: expected undefined to be 'value-a' // Object.is equality

[Killed] EqualityOperator
loadtest/config.ts:90:11
       const line = raw.trim();
       if (!line || line.startsWith('#')) continue;
       const eq = line.indexOf('=');
-      if (eq <= 0) continue;
+      if (eq > 0) continue;
       const key = line.slice(0, eq).trim();
       let value = line.slice(eq + 1).trim();
killedBy: config — loadDotEnv (T-11) parse .env đúng: comment, quotes, khoảng trắng, line invalid
statusReason: expected undefined to be 'value-a' // Object.is equality

[Killed] MethodExpression
loadtest/config.ts:91:19
       if (!line || line.startsWith('#')) continue;
       const eq = line.indexOf('=');
       if (eq <= 0) continue;
-      const key = line.slice(0, eq).trim();
+      const key = line.trim();
       let value = line.slice(eq + 1).trim();
       if ((value.startsWith('"') && value.endsWith('"')) || (value.startsWith("'") && value.endsWith("'"))) {
killedBy: config — loadDotEnv (T-11) parse .env đúng: comment, quotes, khoảng trắng, line invalid
statusReason: expected undefined to be 'value-a' // Object.is equality

[Survived] MethodExpression
loadtest/config.ts:91:19
       if (!line || line.startsWith('#')) continue;
       const eq = line.indexOf('=');
       if (eq <= 0) continue;
-      const key = line.slice(0, eq).trim();
+      const key = line.slice(0, eq);
       let value = line.slice(eq + 1).trim();
       if ((value.startsWith('"') && value.endsWith('"')) || (value.startsWith("'") && value.endsWith("'"))) {

[Killed] MethodExpression
loadtest/config.ts:92:19
       const eq = line.indexOf('=');
       if (eq <= 0) continue;
       const key = line.slice(0, eq).trim();
-      let value = line.slice(eq + 1).trim();
+      let value = line.slice(eq + 1);
       if ((value.startsWith('"') && value.endsWith('"')) || (value.startsWith("'") && value.endsWith("'"))) {
         value = value.slice(1, -1);
killedBy: config — loadDotEnv (T-11) parse .env đúng: comment, quotes, khoảng trắng, line invalid
statusReason: expected '  padded' to be 'padded' // Object.is equality

[Killed] ArithmeticOperator
loadtest/config.ts:92:30
       const eq = line.indexOf('=');
       if (eq <= 0) continue;
       const key = line.slice(0, eq).trim();
-      let value = line.slice(eq + 1).trim();
+      let value = line.slice(eq - 1).trim();
       if ((value.startsWith('"') && value.endsWith('"')) || (value.startsWith("'") && value.endsWith("'"))) {
         value = value.slice(1, -1);
killedBy: config — validateEnv (T-03 fail-fast) dev + dbRequired=false + thiếu key → không error (chỉ warning)
statusReason: expected [ { key: 'LOADTEST_REDIS_URL', …(2) } ] to have a length of +0 but got 1

[Killed] MethodExpression
loadtest/config.ts:93:62
       if (eq <= 0) continue;
       const key = line.slice(0, eq).trim();
       let value = line.slice(eq + 1).trim();
-      if ((value.startsWith('"') && value.endsWith('"')) || (value.startsWith("'") && value.endsWith("'"))) {
+      if ((value.startsWith('"') && value.endsWith('"')) || (value.endsWith("'") && value.endsWith("'"))) {
         value = value.slice(1, -1);
       }
killedBy: config — loadDotEnv (T-11) quote LỆCH (chỉ mở không đóng / ngược) → KHÔNG strip
statusReason: expected 'double-single' to be '"double-single\'' // Object.is equality

[Killed] MethodExpression
loadtest/config.ts:93:87
       if (eq <= 0) continue;
       const key = line.slice(0, eq).trim();
       let value = line.slice(eq + 1).trim();
-      if ((value.startsWith('"') && value.endsWith('"')) || (value.startsWith("'") && value.endsWith("'"))) {
+      if ((value.startsWith('"') && value.endsWith('"')) || (value.startsWith("'") && value.startsWith("'"))) {
         value = value.slice(1, -1);
       }
killedBy: config — loadDotEnv (T-11) quote LỆCH (chỉ mở không đóng / ngược) → KHÔNG strip
statusReason: expected 'mixed' to be '\'mixed"' // Object.is equality

[Killed] UnaryOperator
loadtest/config.ts:94:32
       const key = line.slice(0, eq).trim();
       let value = line.slice(eq + 1).trim();
       if ((value.startsWith('"') && value.endsWith('"')) || (value.startsWith("'") && value.endsWith("'"))) {
-        value = value.slice(1, -1);
+        value = value.slice(1, +1);
       }
       out[key] = value;
killedBy: config — loadDotEnv (T-11) parse .env đúng: comment, quotes, khoảng trắng, line invalid
statusReason: expected '' to be 'quoted value' // Object.is equality

[Killed] MethodExpression
loadtest/config.ts:94:17
       const key = line.slice(0, eq).trim();
       let value = line.slice(eq + 1).trim();
       if ((value.startsWith('"') && value.endsWith('"')) || (value.startsWith("'") && value.endsWith("'"))) {
-        value = value.slice(1, -1);
+        value = value;
       }
       out[key] = value;
killedBy: config — loadDotEnv (T-11) parse .env đúng: comment, quotes, khoảng trắng, line invalid
statusReason: expected '"quoted value"' to be 'quoted value' // Object.is equality

[NoCoverage] BlockStatement
loadtest/config.ts:98:15
       }
       out[key] = value;
     }
-  } catch (e) {
-    ltLog.warn(`Không đọc được loadtest/.env: ${String(e)}`);
-  }
+  } catch (e) {}
   return out;
 }

[Survived] BlockStatement
loadtest/config.ts:111:9
   processEnv: Record<string, string | undefined>,
   fromFile: Record<string, string>,
   overrides: Record<string, string>,
-): void {
-  const keys = new Set<string>();
-  for (const k of Object.keys(processEnv)) if (k.startsWith('LOADTEST_')) keys.add(k);
-  for (const k of Object.keys(fromFile)) keys.add(k);
-  for (const k of Object.keys(overrides)) keys.add(k);
-  const sorted = [...keys].sort();
-  for (const key of sorted) {
-    let source: string;
-    if (key in overrides) source = 'override';
-    else if (key in processEnv) source = 'process.env';
-    else if (key in fromFile) source = '.env file';
-    else source = 'default';
-    ltLog.info(`[env] ${key} ← ${source}`);
-  }
-}
+): void {}
 
 /**

[Survived] MethodExpression
loadtest/config.ts:113:48
   overrides: Record<string, string>,
 ): void {
   const keys = new Set<string>();
-  for (const k of Object.keys(processEnv)) if (k.startsWith('LOADTEST_')) keys.add(k);
+  for (const k of Object.keys(processEnv)) if (k.endsWith('LOADTEST_')) keys.add(k);
   for (const k of Object.keys(fromFile)) keys.add(k);
   for (const k of Object.keys(overrides)) keys.add(k);

[Survived] ConditionalExpression
loadtest/config.ts:113:48
   overrides: Record<string, string>,
 ): void {
   const keys = new Set<string>();
-  for (const k of Object.keys(processEnv)) if (k.startsWith('LOADTEST_')) keys.add(k);
+  for (const k of Object.keys(processEnv)) if (false) keys.add(k);
   for (const k of Object.keys(fromFile)) keys.add(k);
   for (const k of Object.keys(overrides)) keys.add(k);

[Survived] MethodExpression
loadtest/config.ts:116:18
   for (const k of Object.keys(processEnv)) if (k.startsWith('LOADTEST_')) keys.add(k);
   for (const k of Object.keys(fromFile)) keys.add(k);
   for (const k of Object.keys(overrides)) keys.add(k);
-  const sorted = [...keys].sort();
+  const sorted = [...keys];
   for (const key of sorted) {
     let source: string;

[Survived] BlockStatement
loadtest/config.ts:117:29
   for (const k of Object.keys(fromFile)) keys.add(k);
   for (const k of Object.keys(overrides)) keys.add(k);
   const sorted = [...keys].sort();
-  for (const key of sorted) {
-    let source: string;
-    if (key in overrides) source = 'override';
-    else if (key in processEnv) source = 'process.env';
-    else if (key in fromFile) source = '.env file';
-    else source = 'default';
-    ltLog.info(`[env] ${key} ← ${source}`);
-  }
+  for (const key of sorted) {}
 }
 

[Survived] ConditionalExpression
loadtest/config.ts:119:9
   const sorted = [...keys].sort();
   for (const key of sorted) {
     let source: string;
-    if (key in overrides) source = 'override';
+    if (true) source = 'override';
     else if (key in processEnv) source = 'process.env';
     else if (key in fromFile) source = '.env file';

[Survived] ConditionalExpression
loadtest/config.ts:119:9
   const sorted = [...keys].sort();
   for (const key of sorted) {
     let source: string;
-    if (key in overrides) source = 'override';
+    if (false) source = 'override';
     else if (key in processEnv) source = 'process.env';
     else if (key in fromFile) source = '.env file';

[Survived] ConditionalExpression
loadtest/config.ts:120:14
   for (const key of sorted) {
     let source: string;
     if (key in overrides) source = 'override';
-    else if (key in processEnv) source = 'process.env';
+    else if (true) source = 'process.env';
     else if (key in fromFile) source = '.env file';
     else source = 'default';

[Survived] ConditionalExpression
loadtest/config.ts:120:14
   for (const key of sorted) {
     let source: string;
     if (key in overrides) source = 'override';
-    else if (key in processEnv) source = 'process.env';
+    else if (false) source = 'process.env';
     else if (key in fromFile) source = '.env file';
     else source = 'default';

[Survived] ConditionalExpression
loadtest/config.ts:121:14
     let source: string;
     if (key in overrides) source = 'override';
     else if (key in processEnv) source = 'process.env';
-    else if (key in fromFile) source = '.env file';
+    else if (false) source = '.env file';
     else source = 'default';
     ltLog.info(`[env] ${key} ← ${source}`);

[Survived] ConditionalExpression
loadtest/config.ts:121:14
     let source: string;
     if (key in overrides) source = 'override';
     else if (key in processEnv) source = 'process.env';
-    else if (key in fromFile) source = '.env file';
+    else if (true) source = '.env file';
     else source = 'default';
     ltLog.info(`[env] ${key} ← ${source}`);

[NoCoverage] StringLiteral
loadtest/config.ts:122:19
     if (key in overrides) source = 'override';
     else if (key in processEnv) source = 'process.env';
     else if (key in fromFile) source = '.env file';
-    else source = 'default';
+    else source = "";
     ltLog.info(`[env] ${key} ← ${source}`);
   }

[Survived] StringLiteral
loadtest/config.ts:123:16
     else if (key in processEnv) source = 'process.env';
     else if (key in fromFile) source = '.env file';
     else source = 'default';
-    ltLog.info(`[env] ${key} ← ${source}`);
+    ltLog.info(``);
   }
 }

[Survived] BlockStatement
loadtest/config.ts:135:39
   processEnv: Record<string, string | undefined>,
   fromFile: Record<string, string>,
   overrides: Record<string, string>,
-): Record<string, string | undefined> {
-  return { ...fromFile, ...processEnv, ...overrides };
-}
+): Record<string, string | undefined> {}
 
 export function getEnv(overrides: Record<string, string> = {}): LoadTestEnv {

[Killed] ConditionalExpression
loadtest/config.ts:140:20
 }
 
 export function getEnv(overrides: Record<string, string> = {}): LoadTestEnv {
-  if (cachedEnv && Object.keys(overrides).length === 0) return cachedEnv;
+  if (cachedEnv && true) return cachedEnv;
   const fromFile = loadDotEnv(LOADTEST_DIR);
   const env = mergeEnvSources(process.env, fromFile, overrides);
killedBy: config — env đọc env override + allowlist mặc định localhost
statusReason: expected 3401 to be 3456 // Object.is equality

[Killed] ConditionalExpression
loadtest/config.ts:140:7
 }
 
 export function getEnv(overrides: Record<string, string> = {}): LoadTestEnv {
-  if (cachedEnv && Object.keys(overrides).length === 0) return cachedEnv;
+  if (true) return cachedEnv;
   const fromFile = loadDotEnv(LOADTEST_DIR);
   const env = mergeEnvSources(process.env, fromFile, overrides);
killedBy: config — env đọc env override + allowlist mặc định localhost
statusReason: Cannot read properties of null (reading 'port')

[Killed] BlockStatement
loadtest/config.ts:144:53
   const fromFile = loadDotEnv(LOADTEST_DIR);
   const env = mergeEnvSources(process.env, fromFile, overrides);
 
-  const num = (key: string, def: number): number => {
-    const v = env[key];
-    if (v === undefined || v === '') return def;
-    const n = Number(v);
-    return Number.isFinite(n) ? n : def;
-  };
+  const num = (key: string, def: number): number => {};
 
   const allowlistRaw = (env.LOADTEST_ALLOWLIST ?? '').trim();
killedBy: config — env đọc env override + allowlist mặc định localhost
statusReason: expected undefined to be 3456 // Object.is equality

[Killed] ConditionalExpression
loadtest/config.ts:146:28
 
   const num = (key: string, def: number): number => {
     const v = env[key];
-    if (v === undefined || v === '') return def;
+    if (v === undefined || false) return def;
     const n = Number(v);
     return Number.isFinite(n) ? n : def;
killedBy: config — getEnv defaults đầy đủ (T-11) giá trị number rỗng "" → fallback default; "0" → 0 (không fallback)
statusReason: expected +0 to be 3401 // Object.is equality

[Killed] ConditionalExpression
loadtest/config.ts:146:9
 
   const num = (key: string, def: number): number => {
     const v = env[key];
-    if (v === undefined || v === '') return def;
+    if (false) return def;
     const n = Number(v);
     return Number.isFinite(n) ? n : def;
killedBy: config — getEnv defaults đầy đủ (T-11) giá trị number rỗng "" → fallback default; "0" → 0 (không fallback)
statusReason: expected +0 to be 3401 // Object.is equality

[Killed] LogicalOperator
loadtest/config.ts:151:25
     return Number.isFinite(n) ? n : def;
   };
 
-  const allowlistRaw = (env.LOADTEST_ALLOWLIST ?? '').trim();
+  const allowlistRaw = (env.LOADTEST_ALLOWLIST && '').trim();
   const allowlist = allowlistRaw
     ? allowlistRaw.split(',').map((s) => normalizeUrl(s)).filter(Boolean)
killedBy: config — env allowlist từ env phân tách phẩy, normalize ws→http
statusReason: expected [ 'http://localhost:3000' ] to deeply equal [ 'http://test-01.mayogu.test', …(1) ]

[Survived] MethodExpression
loadtest/config.ts:151:24
     return Number.isFinite(n) ? n : def;
   };
 
-  const allowlistRaw = (env.LOADTEST_ALLOWLIST ?? '').trim();
+  const allowlistRaw = env.LOADTEST_ALLOWLIST ?? '';
   const allowlist = allowlistRaw
     ? allowlistRaw.split(',').map((s) => normalizeUrl(s)).filter(Boolean)

[Killed] ArrowFunction
loadtest/config.ts:153:35
 
   const allowlistRaw = (env.LOADTEST_ALLOWLIST ?? '').trim();
   const allowlist = allowlistRaw
-    ? allowlistRaw.split(',').map((s) => normalizeUrl(s)).filter(Boolean)
+    ? allowlistRaw.split(',').map(() => undefined).filter(Boolean)
     : [normalizeUrl('http://localhost:3000')]; // dev-only mặc định (SEC-7): production phải set LOADTEST_ALLOWLIST tường minh
 
killedBy: config — env allowlist từ env phân tách phẩy, normalize ws→http
statusReason: expected [] to deeply equal [ 'http://test-01.mayogu.test', …(1) ]

[Survived] MethodExpression
loadtest/config.ts:153:7
 
   const allowlistRaw = (env.LOADTEST_ALLOWLIST ?? '').trim();
   const allowlist = allowlistRaw
-    ? allowlistRaw.split(',').map((s) => normalizeUrl(s)).filter(Boolean)
+    ? allowlistRaw.split(',').map(s => normalizeUrl(s))
     : [normalizeUrl('http://localhost:3000')]; // dev-only mặc định (SEC-7): production phải set LOADTEST_ALLOWLIST tường minh
 

[Killed] StringLiteral
loadtest/config.ts:154:21
   const allowlistRaw = (env.LOADTEST_ALLOWLIST ?? '').trim();
   const allowlist = allowlistRaw
     ? allowlistRaw.split(',').map((s) => normalizeUrl(s)).filter(Boolean)
-    : [normalizeUrl('http://localhost:3000')]; // dev-only mặc định (SEC-7): production phải set LOADTEST_ALLOWLIST tường minh
+    : [normalizeUrl("")]; // dev-only mặc định (SEC-7): production phải set LOADTEST_ALLOWLIST tường minh
 
   const corsOriginsRaw = (env.LOADTEST_CORS_ORIGIN ?? '').trim();
killedBy: config — env đọc env override + allowlist mặc định localhost
statusReason: expected [ '' ] to include 'http://localhost:3000'

[Survived] MethodExpression
loadtest/config.ts:156:26
     ? allowlistRaw.split(',').map((s) => normalizeUrl(s)).filter(Boolean)
     : [normalizeUrl('http://localhost:3000')]; // dev-only mặc định (SEC-7): production phải set LOADTEST_ALLOWLIST tường minh
 
-  const corsOriginsRaw = (env.LOADTEST_CORS_ORIGIN ?? '').trim();
+  const corsOriginsRaw = env.LOADTEST_CORS_ORIGIN ?? '';
   const corsOrigins = corsOriginsRaw
     ? corsOriginsRaw.split(',').map((s) => s.trim()).filter(Boolean)

[Survived] LogicalOperator
loadtest/config.ts:156:27
     ? allowlistRaw.split(',').map((s) => normalizeUrl(s)).filter(Boolean)
     : [normalizeUrl('http://localhost:3000')]; // dev-only mặc định (SEC-7): production phải set LOADTEST_ALLOWLIST tường minh
 
-  const corsOriginsRaw = (env.LOADTEST_CORS_ORIGIN ?? '').trim();
+  const corsOriginsRaw = (env.LOADTEST_CORS_ORIGIN && '').trim();
   const corsOrigins = corsOriginsRaw
     ? corsOriginsRaw.split(',').map((s) => s.trim()).filter(Boolean)

[Killed] ArrowFunction
loadtest/config.ts:158:37
 
   const corsOriginsRaw = (env.LOADTEST_CORS_ORIGIN ?? '').trim();
   const corsOrigins = corsOriginsRaw
-    ? corsOriginsRaw.split(',').map((s) => s.trim()).filter(Boolean)
+    ? corsOriginsRaw.split(',').map(() => undefined).filter(Boolean)
     : ['http://localhost:5173']; // R-7: Vite proxy gửi origin Vite
 
killedBy: config — getEnv defaults đầy đủ (T-11) parse từng key override: fixture post ids, booleans, rate-limit, workers
statusReason: expected [] to deeply equal [ 'http://a.example', …(1) ]

[Killed] MethodExpression
loadtest/config.ts:158:44
 
   const corsOriginsRaw = (env.LOADTEST_CORS_ORIGIN ?? '').trim();
   const corsOrigins = corsOriginsRaw
-    ? corsOriginsRaw.split(',').map((s) => s.trim()).filter(Boolean)
+    ? corsOriginsRaw.split(',').map((s) => s).filter(Boolean)
     : ['http://localhost:5173']; // R-7: Vite proxy gửi origin Vite
 
killedBy: config — getEnv defaults đầy đủ (T-11) parse từng key override: fixture post ids, booleans, rate-limit, workers
statusReason: expected [ 'http://a.example', …(1) ] to deeply equal [ 'http://a.example', …(1) ]

[Killed] ArrayDeclaration
loadtest/config.ts:159:7
   const corsOriginsRaw = (env.LOADTEST_CORS_ORIGIN ?? '').trim();
   const corsOrigins = corsOriginsRaw
     ? corsOriginsRaw.split(',').map((s) => s.trim()).filter(Boolean)
-    : ['http://localhost:5173']; // R-7: Vite proxy gửi origin Vite
+    : []; // R-7: Vite proxy gửi origin Vite
 
   const configuredWorkers = num('LOADTEST_WORKERS', 0);
killedBy: config — getEnv defaults đầy đủ (T-11) mọi key mặc định đúng (không override)
statusReason: expected [] to deeply equal [ 'http://localhost:5173' ]

[Killed] BooleanLiteral
loadtest/config.ts:163:58
 
   const configuredWorkers = num('LOADTEST_WORKERS', 0);
   const debug = parseBool(env.LOADTEST_DEBUG);
-  const dbRequired = parseBool(env.LOADTEST_DB_REQUIRED, true); // Q-2: DB luôn bắt buộc
+  const dbRequired = parseBool(env.LOADTEST_DB_REQUIRED, false); // Q-2: DB luôn bắt buộc
 
   if (debug) logEnvSources(process.env, fromFile, overrides);
killedBy: config — validateEnv (T-03 fail-fast) dbRequired=true (mặc định) + placeholder DB URL → error
statusReason: expected false to be true // Object.is equality

[Survived] ConditionalExpression
loadtest/config.ts:165:7
   const debug = parseBool(env.LOADTEST_DEBUG);
   const dbRequired = parseBool(env.LOADTEST_DB_REQUIRED, true); // Q-2: DB luôn bắt buộc
 
-  if (debug) logEnvSources(process.env, fromFile, overrides);
+  if (false) logEnvSources(process.env, fromFile, overrides);
 
   const cfg: LoadTestEnv = {

[Survived] ConditionalExpression
loadtest/config.ts:165:7
   const debug = parseBool(env.LOADTEST_DEBUG);
   const dbRequired = parseBool(env.LOADTEST_DB_REQUIRED, true); // Q-2: DB luôn bắt buộc
 
-  if (debug) logEnvSources(process.env, fromFile, overrides);
+  if (true) logEnvSources(process.env, fromFile, overrides);
 
   const cfg: LoadTestEnv = {

[Killed] ConditionalExpression
loadtest/config.ts:169:11
 
   const cfg: LoadTestEnv = {
     port: num('LOADTEST_PORT', 3401),
-    host: env.LOADTEST_HOST || '127.0.0.1',
+    host: true,
     allowlist,
     gatewayUrl: normalizeUrl(env.LOADTEST_GATEWAY_URL || 'http://localhost:3000'),
killedBy: config — getEnv defaults đầy đủ (T-11) mọi key mặc định đúng (không override)
statusReason: expected true to be '127.0.0.1' // Object.is equality

[Killed] ConditionalExpression
loadtest/config.ts:169:11
 
   const cfg: LoadTestEnv = {
     port: num('LOADTEST_PORT', 3401),
-    host: env.LOADTEST_HOST || '127.0.0.1',
+    host: false,
     allowlist,
     gatewayUrl: normalizeUrl(env.LOADTEST_GATEWAY_URL || 'http://localhost:3000'),
killedBy: config — getEnv defaults đầy đủ (T-11) mọi key mặc định đúng (không override)
statusReason: expected false to be '127.0.0.1' // Object.is equality

[Killed] LogicalOperator
loadtest/config.ts:171:30
     port: num('LOADTEST_PORT', 3401),
     host: env.LOADTEST_HOST || '127.0.0.1',
     allowlist,
-    gatewayUrl: normalizeUrl(env.LOADTEST_GATEWAY_URL || 'http://localhost:3000'),
+    gatewayUrl: normalizeUrl(env.LOADTEST_GATEWAY_URL && 'http://localhost:3000'),
     otpSecret: env.LOADTEST_OTP_SECRET || '',
     authSecret: env.LOADTEST_AUTH_SECRET || '',
killedBy: config — getEnv defaults đầy đủ (T-11) parse từng key override: fixture post ids, booleans, rate-limit, workers
statusReason: expected 'http://localhost:3000' to be 'http://gateway.mayogu.test' // Object.is equality

[Survived] ConditionalExpression
loadtest/config.ts:171:30
     port: num('LOADTEST_PORT', 3401),
     host: env.LOADTEST_HOST || '127.0.0.1',
     allowlist,
-    gatewayUrl: normalizeUrl(env.LOADTEST_GATEWAY_URL || 'http://localhost:3000'),
+    gatewayUrl: normalizeUrl(false),
     otpSecret: env.LOADTEST_OTP_SECRET || '',
     authSecret: env.LOADTEST_AUTH_SECRET || '',
