[Killed] ConditionalExpression
loadtest/config.ts:172:16
     host: env.LOADTEST_HOST || '127.0.0.1',
     allowlist,
     gatewayUrl: normalizeUrl(env.LOADTEST_GATEWAY_URL || 'http://localhost:3000'),
-    otpSecret: env.LOADTEST_OTP_SECRET || '',
+    otpSecret: false,
     authSecret: env.LOADTEST_AUTH_SECRET || '',
     redisUrl: env.LOADTEST_REDIS_URL || 'redis://localhost:6379',
killedBy: config — validateEnv (T-03 fail-fast) OTP/AUTH quá ngắn (< 32) → error
statusReason: expected false to be true // Object.is equality

[Killed] LogicalOperator
loadtest/config.ts:172:16
     host: env.LOADTEST_HOST || '127.0.0.1',
     allowlist,
     gatewayUrl: normalizeUrl(env.LOADTEST_GATEWAY_URL || 'http://localhost:3000'),
-    otpSecret: env.LOADTEST_OTP_SECRET || '',
+    otpSecret: env.LOADTEST_OTP_SECRET && '',
     authSecret: env.LOADTEST_AUTH_SECRET || '',
     redisUrl: env.LOADTEST_REDIS_URL || 'redis://localhost:6379',
killedBy: config — validateEnv (T-03 fail-fast) OTP/AUTH quá ngắn (< 32) → error
statusReason: expected false to be true // Object.is equality

[Killed] LogicalOperator
loadtest/config.ts:173:17
     allowlist,
     gatewayUrl: normalizeUrl(env.LOADTEST_GATEWAY_URL || 'http://localhost:3000'),
     otpSecret: env.LOADTEST_OTP_SECRET || '',
-    authSecret: env.LOADTEST_AUTH_SECRET || '',
+    authSecret: env.LOADTEST_AUTH_SECRET && '',
     redisUrl: env.LOADTEST_REDIS_URL || 'redis://localhost:6379',
     maxTarget: num('LOADTEST_MAX_TARGET', 200_000),
killedBy: config — validateEnv (T-03 fail-fast) OTP/AUTH quá ngắn (< 32) → error
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
loadtest/config.ts:173:17
     allowlist,
     gatewayUrl: normalizeUrl(env.LOADTEST_GATEWAY_URL || 'http://localhost:3000'),
     otpSecret: env.LOADTEST_OTP_SECRET || '',
-    authSecret: env.LOADTEST_AUTH_SECRET || '',
+    authSecret: true,
     redisUrl: env.LOADTEST_REDIS_URL || 'redis://localhost:6379',
     maxTarget: num('LOADTEST_MAX_TARGET', 200_000),
killedBy: config — validateEnv (T-03 fail-fast) production + thiếu key → errors (DB required, OTP, AUTH)
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
loadtest/config.ts:174:15
     gatewayUrl: normalizeUrl(env.LOADTEST_GATEWAY_URL || 'http://localhost:3000'),
     otpSecret: env.LOADTEST_OTP_SECRET || '',
     authSecret: env.LOADTEST_AUTH_SECRET || '',
-    redisUrl: env.LOADTEST_REDIS_URL || 'redis://localhost:6379',
+    redisUrl: false,
     maxTarget: num('LOADTEST_MAX_TARGET', 200_000),
     maxDurationMin: num('LOADTEST_MAX_DURATION_MIN', 60),
killedBy: config — validateEnv (T-03 fail-fast) REDIS_URL sai prefix → error
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
loadtest/config.ts:174:15
     gatewayUrl: normalizeUrl(env.LOADTEST_GATEWAY_URL || 'http://localhost:3000'),
     otpSecret: env.LOADTEST_OTP_SECRET || '',
     authSecret: env.LOADTEST_AUTH_SECRET || '',
-    redisUrl: env.LOADTEST_REDIS_URL || 'redis://localhost:6379',
+    redisUrl: true,
     maxTarget: num('LOADTEST_MAX_TARGET', 200_000),
     maxDurationMin: num('LOADTEST_MAX_DURATION_MIN', 60),
killedBy: config — validateEnv (T-03 fail-fast) production + thiếu key → errors (DB required, OTP, AUTH)
statusReason: url.replace is not a function

[Killed] StringLiteral
loadtest/config.ts:175:20
     otpSecret: env.LOADTEST_OTP_SECRET || '',
     authSecret: env.LOADTEST_AUTH_SECRET || '',
     redisUrl: env.LOADTEST_REDIS_URL || 'redis://localhost:6379',
-    maxTarget: num('LOADTEST_MAX_TARGET', 200_000),
+    maxTarget: num("", 200_000),
     maxDurationMin: num('LOADTEST_MAX_DURATION_MIN', 60),
     maxRegisterRamp: num('LOADTEST_MAX_REGISTER_RAMP', 100),
killedBy: config — env đọc env override + allowlist mặc định localhost
statusReason: expected 200000 to be 50000 // Object.is equality

[Survived] StringLiteral
loadtest/config.ts:180:27
     maxRegisterRamp: num('LOADTEST_MAX_REGISTER_RAMP', 100),
     workerCount: configuredWorkers,
     maxSocketsPerWorker: num('LOADTEST_MAX_SOCKETS_PER_WORKER', 10_000),
-    maxPendingOutbox: num('LOADTEST_MAX_PENDING_OUTBOX', 1000),
+    maxPendingOutbox: num("", 1000),
     dataDir: env.LOADTEST_DATA_DIR || './loadtest/data',
     reportsDir: env.LOADTEST_REPORTS_DIR || './docs/loadtest-reports',

[Killed] ConditionalExpression
loadtest/config.ts:181:14
     workerCount: configuredWorkers,
     maxSocketsPerWorker: num('LOADTEST_MAX_SOCKETS_PER_WORKER', 10_000),
     maxPendingOutbox: num('LOADTEST_MAX_PENDING_OUTBOX', 1000),
-    dataDir: env.LOADTEST_DATA_DIR || './loadtest/data',
+    dataDir: true,
     reportsDir: env.LOADTEST_REPORTS_DIR || './docs/loadtest-reports',
     databaseUrl: env.LOADTEST_DATABASE_URL || PLACEHOLDER_DB_URL,
killedBy: config — getEnv defaults đầy đủ (T-11) mọi key mặc định đúng (không override)
statusReason: expected true to be './loadtest/data' // Object.is equality

[Killed] LogicalOperator
loadtest/config.ts:181:14
     workerCount: configuredWorkers,
     maxSocketsPerWorker: num('LOADTEST_MAX_SOCKETS_PER_WORKER', 10_000),
     maxPendingOutbox: num('LOADTEST_MAX_PENDING_OUTBOX', 1000),
-    dataDir: env.LOADTEST_DATA_DIR || './loadtest/data',
+    dataDir: env.LOADTEST_DATA_DIR && './loadtest/data',
     reportsDir: env.LOADTEST_REPORTS_DIR || './docs/loadtest-reports',
     databaseUrl: env.LOADTEST_DATABASE_URL || PLACEHOLDER_DB_URL,
killedBy: config — settings file allowlist (SD-1, T-11) file hỏng (không phải JSON) → default { allowlist: [], updatedAt: 0 }
statusReason: expected { …(2) } to deeply equal { allowlist: [], updatedAt: +0 }

[Survived] ConditionalExpression
loadtest/config.ts:182:17
     maxSocketsPerWorker: num('LOADTEST_MAX_SOCKETS_PER_WORKER', 10_000),
     maxPendingOutbox: num('LOADTEST_MAX_PENDING_OUTBOX', 1000),
     dataDir: env.LOADTEST_DATA_DIR || './loadtest/data',
-    reportsDir: env.LOADTEST_REPORTS_DIR || './docs/loadtest-reports',
+    reportsDir: false,
     databaseUrl: env.LOADTEST_DATABASE_URL || PLACEHOLDER_DB_URL,
     scrapeIntervalMs: num('LOADTEST_SCRAPE_METRICS_INTERVAL_MS', 5000),

[Survived] ConditionalExpression
loadtest/config.ts:182:17
     maxSocketsPerWorker: num('LOADTEST_MAX_SOCKETS_PER_WORKER', 10_000),
     maxPendingOutbox: num('LOADTEST_MAX_PENDING_OUTBOX', 1000),
     dataDir: env.LOADTEST_DATA_DIR || './loadtest/data',
-    reportsDir: env.LOADTEST_REPORTS_DIR || './docs/loadtest-reports',
+    reportsDir: true,
     databaseUrl: env.LOADTEST_DATABASE_URL || PLACEHOLDER_DB_URL,
     scrapeIntervalMs: num('LOADTEST_SCRAPE_METRICS_INTERVAL_MS', 5000),

[Killed] ConditionalExpression
loadtest/config.ts:183:18
     maxPendingOutbox: num('LOADTEST_MAX_PENDING_OUTBOX', 1000),
     dataDir: env.LOADTEST_DATA_DIR || './loadtest/data',
     reportsDir: env.LOADTEST_REPORTS_DIR || './docs/loadtest-reports',
-    databaseUrl: env.LOADTEST_DATABASE_URL || PLACEHOLDER_DB_URL,
+    databaseUrl: true,
     scrapeIntervalMs: num('LOADTEST_SCRAPE_METRICS_INTERVAL_MS', 5000),
     registerRamp: num('LOADTEST_REGISTER_RAMP', 100),
killedBy: config — validateEnv (T-03 fail-fast) production + thiếu key → errors (DB required, OTP, AUTH)
statusReason: url.replace is not a function

[Killed] ConditionalExpression
loadtest/config.ts:183:18
     maxPendingOutbox: num('LOADTEST_MAX_PENDING_OUTBOX', 1000),
     dataDir: env.LOADTEST_DATA_DIR || './loadtest/data',
     reportsDir: env.LOADTEST_REPORTS_DIR || './docs/loadtest-reports',
-    databaseUrl: env.LOADTEST_DATABASE_URL || PLACEHOLDER_DB_URL,
+    databaseUrl: false,
     scrapeIntervalMs: num('LOADTEST_SCRAPE_METRICS_INTERVAL_MS', 5000),
     registerRamp: num('LOADTEST_REGISTER_RAMP', 100),
killedBy: config — validateEnv (T-03 fail-fast) dev DB URL với username appuser + password thật → PASS (không false-positive — T-03)
statusReason: expected true to be false // Object.is equality

[Killed] MethodExpression
loadtest/config.ts:186:21
     databaseUrl: env.LOADTEST_DATABASE_URL || PLACEHOLDER_DB_URL,
     scrapeIntervalMs: num('LOADTEST_SCRAPE_METRICS_INTERVAL_MS', 5000),
     registerRamp: num('LOADTEST_REGISTER_RAMP', 100),
-    fixturePostIds: (env.LOADTEST_FIXTURE_POST_IDS || '')
-      .split(',')
-      .map((s) => s.trim())
-      .filter(Boolean),
+    fixturePostIds: (env.LOADTEST_FIXTURE_POST_IDS || '').split(',').map(s => s.trim()),
     debug,
     dbRequired,
killedBy: config — getEnv defaults đầy đủ (T-11) mọi key mặc định đúng (không override)
statusReason: expected [ '' ] to deeply equal []

[Survived] LogicalOperator
loadtest/config.ts:186:22
     databaseUrl: env.LOADTEST_DATABASE_URL || PLACEHOLDER_DB_URL,
     scrapeIntervalMs: num('LOADTEST_SCRAPE_METRICS_INTERVAL_MS', 5000),
     registerRamp: num('LOADTEST_REGISTER_RAMP', 100),
-    fixturePostIds: (env.LOADTEST_FIXTURE_POST_IDS || '')
+    fixturePostIds: (env.LOADTEST_FIXTURE_POST_IDS && '')
       .split(',')
       .map((s) => s.trim())

[Killed] StringLiteral
loadtest/config.ts:187:14
     scrapeIntervalMs: num('LOADTEST_SCRAPE_METRICS_INTERVAL_MS', 5000),
     registerRamp: num('LOADTEST_REGISTER_RAMP', 100),
     fixturePostIds: (env.LOADTEST_FIXTURE_POST_IDS || '')
-      .split(',')
+      .split("")
       .map((s) => s.trim())
       .filter(Boolean),
killedBy: config — getEnv defaults đầy đủ (T-11) parse từng key override: fixture post ids, booleans, rate-limit, workers
statusReason: expected [ 'p', 'o', 's', 't', '-', '1', …(15) ] to deeply equal [ 'post-1', 'post-2', 'post-3' ]

[Killed] StringLiteral
loadtest/config.ts:195:30
     corsOrigins,
     allowRegister: parseBool(env.LOADTEST_ALLOW_REGISTER),
     rateLimitDisabled: parseBool(env.LOADTEST_RATE_LIMIT_DISABLED),
-    rateLimitLoginFails: num('LOADTEST_RATE_LIMIT_LOGIN_FAILS', 5),
+    rateLimitLoginFails: num("", 5),
     rateLimitWindowMs: num('LOADTEST_RATE_LIMIT_WINDOW_MS', 60_000),
     rateLimitStartMs: num('LOADTEST_RATE_LIMIT_START_MS', 10_000),
killedBy: config — getEnv defaults đầy đủ (T-11) parse từng key override: fixture post ids, booleans, rate-limit, workers
statusReason: expected 5 to be 3 // Object.is equality

[Killed] ConditionalExpression
loadtest/config.ts:221:41
  * Trả về danh sách vấn đề — caller (server.ts) log + exit khi có severity='error'.
  */
 export function validateEnv(env: LoadTestEnv, opts: { production?: boolean } = {}): EnvProblem[] {
-  const production = opts.production ?? process.env.NODE_ENV === 'production';
+  const production = opts.production ?? false;
   const problems: EnvProblem[] = [];
   const err = (key: string, message: string) => problems.push({ key, message, severity: 'error' });
killedBy: config — validateEnv (T-03 fail-fast) production flag: opts.production=false THẮNG NODE_ENV=production (?? không phải ||)
statusReason: expected 0 to be greater than 0

[Killed] LogicalOperator
loadtest/config.ts:221:22
  * Trả về danh sách vấn đề — caller (server.ts) log + exit khi có severity='error'.
  */
 export function validateEnv(env: LoadTestEnv, opts: { production?: boolean } = {}): EnvProblem[] {
-  const production = opts.production ?? process.env.NODE_ENV === 'production';
+  const production = opts.production && process.env.NODE_ENV === 'production';
   const problems: EnvProblem[] = [];
   const err = (key: string, message: string) => problems.push({ key, message, severity: 'error' });
killedBy: config — validateEnv (T-03 fail-fast) production + thiếu key → errors (DB required, OTP, AUTH)
statusReason: expected false to be true // Object.is equality

[Survived] ArrayDeclaration
loadtest/config.ts:222:34
  */
 export function validateEnv(env: LoadTestEnv, opts: { production?: boolean } = {}): EnvProblem[] {
   const production = opts.production ?? process.env.NODE_ENV === 'production';
-  const problems: EnvProblem[] = [];
+  const problems: EnvProblem[] = ["Stryker was here"];
   const err = (key: string, message: string) => problems.push({ key, message, severity: 'error' });
   const warn = (key: string, message: string) => problems.push({ key, message, severity: 'warning' });

[Killed] ArrowFunction
loadtest/config.ts:223:15
 export function validateEnv(env: LoadTestEnv, opts: { production?: boolean } = {}): EnvProblem[] {
   const production = opts.production ?? process.env.NODE_ENV === 'production';
   const problems: EnvProblem[] = [];
-  const err = (key: string, message: string) => problems.push({ key, message, severity: 'error' });
+  const err = () => undefined;
   const warn = (key: string, message: string) => problems.push({ key, message, severity: 'warning' });
 
killedBy: config — validateEnv (T-03 fail-fast) production + thiếu key → errors (DB required, OTP, AUTH)
statusReason: expected false to be true // Object.is equality

[Killed] StringLiteral
loadtest/config.ts:223:89
 export function validateEnv(env: LoadTestEnv, opts: { production?: boolean } = {}): EnvProblem[] {
   const production = opts.production ?? process.env.NODE_ENV === 'production';
   const problems: EnvProblem[] = [];
-  const err = (key: string, message: string) => problems.push({ key, message, severity: 'error' });
+  const err = (key: string, message: string) => problems.push({ key, message, severity: "" });
   const warn = (key: string, message: string) => problems.push({ key, message, severity: 'warning' });
 
killedBy: config — validateEnv (T-03 fail-fast) production + thiếu key → errors (DB required, OTP, AUTH)
statusReason: expected false to be true // Object.is equality

[Killed] ArrowFunction
loadtest/config.ts:224:16
   const production = opts.production ?? process.env.NODE_ENV === 'production';
   const problems: EnvProblem[] = [];
   const err = (key: string, message: string) => problems.push({ key, message, severity: 'error' });
-  const warn = (key: string, message: string) => problems.push({ key, message, severity: 'warning' });
+  const warn = () => undefined;
 
   // LOADTEST_DATABASE_URL — bắt buộc khi dbRequired hoặc production (Q-2)
killedBy: config — validateEnv (T-03 fail-fast) warning mặc định khi thiếu OTP/AUTH (dev) — message chính xác
statusReason: expected undefined to be 'thiếu — register sẽ fail (cần set tro…' // Object.is equality

[Killed] ObjectLiteral
loadtest/config.ts:224:64
   const production = opts.production ?? process.env.NODE_ENV === 'production';
   const problems: EnvProblem[] = [];
   const err = (key: string, message: string) => problems.push({ key, message, severity: 'error' });
-  const warn = (key: string, message: string) => problems.push({ key, message, severity: 'warning' });
+  const warn = (key: string, message: string) => problems.push({});
 
   // LOADTEST_DATABASE_URL — bắt buộc khi dbRequired hoặc production (Q-2)
killedBy: config — validateEnv (T-03 fail-fast) warning mặc định khi thiếu OTP/AUTH (dev) — message chính xác
statusReason: expected undefined to be 'thiếu — register sẽ fail (cần set tro…' // Object.is equality

[Killed] LogicalOperator
loadtest/config.ts:227:7
   const warn = (key: string, message: string) => problems.push({ key, message, severity: 'warning' });
 
   // LOADTEST_DATABASE_URL — bắt buộc khi dbRequired hoặc production (Q-2)
-  if (env.dbRequired || production) {
+  if (env.dbRequired && production) {
     if (!env.databaseUrl || isKnownBadDbUrl(env.databaseUrl)) {
       err(
killedBy: config — validateEnv (T-03 fail-fast) production + thiếu key → errors (DB required, OTP, AUTH)
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
loadtest/config.ts:227:7
   const warn = (key: string, message: string) => problems.push({ key, message, severity: 'warning' });
 
   // LOADTEST_DATABASE_URL — bắt buộc khi dbRequired hoặc production (Q-2)
-  if (env.dbRequired || production) {
+  if (true) {
     if (!env.databaseUrl || isKnownBadDbUrl(env.databaseUrl)) {
       err(
killedBy: config — validateEnv (T-03 fail-fast) dev + dbRequired=false + thiếu key → không error (chỉ warning)
statusReason: expected [ { …(3) } ] to have a length of +0 but got 1

[Killed] BooleanLiteral
loadtest/config.ts:228:9
 
   // LOADTEST_DATABASE_URL — bắt buộc khi dbRequired hoặc production (Q-2)
   if (env.dbRequired || production) {
-    if (!env.databaseUrl || isKnownBadDbUrl(env.databaseUrl)) {
+    if (env.databaseUrl || isKnownBadDbUrl(env.databaseUrl)) {
       err(
         'LOADTEST_DATABASE_URL',
killedBy: config — validateEnv (T-03 fail-fast) dev DB URL với username appuser + password thật → PASS (không false-positive — T-03)
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
loadtest/config.ts:228:9
 
   // LOADTEST_DATABASE_URL — bắt buộc khi dbRequired hoặc production (Q-2)
   if (env.dbRequired || production) {
-    if (!env.databaseUrl || isKnownBadDbUrl(env.databaseUrl)) {
+    if (true) {
       err(
         'LOADTEST_DATABASE_URL',
killedBy: config — validateEnv (T-03 fail-fast) dev DB URL với username appuser + password thật → PASS (không false-positive — T-03)
statusReason: expected true to be false // Object.is equality

[Killed] LogicalOperator
loadtest/config.ts:235:7
       );
     }
   }
-  if (env.databaseUrl && !/^postgres(ql)?:\/\//.test(env.databaseUrl)) {
+  if (env.databaseUrl || !/^postgres(ql)?:\/\//.test(env.databaseUrl)) {
     err('LOADTEST_DATABASE_URL', `phải bắt đầu bằng postgres:// hoặc postgresql:// (hiện: ${redactUrl(env.databaseUrl)}...)`);
   }
killedBy: config — validateEnv (T-03 fail-fast) dev + dbRequired=false + thiếu key → không error (chỉ warning)
statusReason: expected [ { …(3) } ] to have a length of +0 but got 1

[Killed] BlockStatement
loadtest/config.ts:235:72
       );
     }
   }
-  if (env.databaseUrl && !/^postgres(ql)?:\/\//.test(env.databaseUrl)) {
-    err('LOADTEST_DATABASE_URL', `phải bắt đầu bằng postgres:// hoặc postgresql:// (hiện: ${redactUrl(env.databaseUrl)}...)`);
-  }
+  if (env.databaseUrl && !/^postgres(ql)?:\/\//.test(env.databaseUrl)) {}
 
   // LOADTEST_OTP_SECRET — ≥ 32 ký tự (seed OTP register — E1)
killedBy: config — validateEnv (T-03 fail-fast) sai prefix DB URL → error
statusReason: expected false to be true // Object.is equality

[Killed] LogicalOperator
loadtest/config.ts:240:7
   }
 
   // LOADTEST_OTP_SECRET — ≥ 32 ký tự (seed OTP register — E1)
-  if (env.otpSecret && env.otpSecret.length < 32) {
+  if (env.otpSecret || env.otpSecret.length < 32) {
     err('LOADTEST_OTP_SECRET', `phải ≥ 32 ký tự (hiện ${env.otpSecret.length})`);
   } else if (!env.otpSecret) {
killedBy: config — validateEnv (T-03 fail-fast) dev + dbRequired=false + thiếu key → không error (chỉ warning)
statusReason: expected [ Array(1) ] to have a length of +0 but got 1

[Killed] ConditionalExpression
loadtest/config.ts:240:7
   }
 
   // LOADTEST_OTP_SECRET — ≥ 32 ký tự (seed OTP register — E1)
-  if (env.otpSecret && env.otpSecret.length < 32) {
+  if (true) {
     err('LOADTEST_OTP_SECRET', `phải ≥ 32 ký tự (hiện ${env.otpSecret.length})`);
   } else if (!env.otpSecret) {
killedBy: config — validateEnv (T-03 fail-fast) dev + dbRequired=false + thiếu key → không error (chỉ warning)
statusReason: expected [ Array(1) ] to have a length of +0 but got 1

[Killed] StringLiteral
loadtest/config.ts:241:9
 
   // LOADTEST_OTP_SECRET — ≥ 32 ký tự (seed OTP register — E1)
   if (env.otpSecret && env.otpSecret.length < 32) {
-    err('LOADTEST_OTP_SECRET', `phải ≥ 32 ký tự (hiện ${env.otpSecret.length})`);
+    err("", `phải ≥ 32 ký tự (hiện ${env.otpSecret.length})`);
   } else if (!env.otpSecret) {
     if (production) err('LOADTEST_OTP_SECRET', 'bắt buộc trong production (register sẽ fail — E1)');
killedBy: config — validateEnv (T-03 fail-fast) OTP/AUTH quá ngắn (< 32) → error
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
loadtest/config.ts:242:14
   // LOADTEST_OTP_SECRET — ≥ 32 ký tự (seed OTP register — E1)
   if (env.otpSecret && env.otpSecret.length < 32) {
     err('LOADTEST_OTP_SECRET', `phải ≥ 32 ký tự (hiện ${env.otpSecret.length})`);
-  } else if (!env.otpSecret) {
+  } else if (env.otpSecret) {
     if (production) err('LOADTEST_OTP_SECRET', 'bắt buộc trong production (register sẽ fail — E1)');
     else warn('LOADTEST_OTP_SECRET', 'thiếu — register sẽ fail (cần set trong loadtest/.env)');
killedBy: config — validateEnv (T-03 fail-fast) production + thiếu key → errors (DB required, OTP, AUTH)
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
loadtest/config.ts:242:14
   // LOADTEST_OTP_SECRET — ≥ 32 ký tự (seed OTP register — E1)
   if (env.otpSecret && env.otpSecret.length < 32) {
     err('LOADTEST_OTP_SECRET', `phải ≥ 32 ký tự (hiện ${env.otpSecret.length})`);
-  } else if (!env.otpSecret) {
+  } else if (false) {
     if (production) err('LOADTEST_OTP_SECRET', 'bắt buộc trong production (register sẽ fail — E1)');
     else warn('LOADTEST_OTP_SECRET', 'thiếu — register sẽ fail (cần set trong loadtest/.env)');
killedBy: config — validateEnv (T-03 fail-fast) production + thiếu key → errors (DB required, OTP, AUTH)
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
loadtest/config.ts:243:9
   if (env.otpSecret && env.otpSecret.length < 32) {
     err('LOADTEST_OTP_SECRET', `phải ≥ 32 ký tự (hiện ${env.otpSecret.length})`);
   } else if (!env.otpSecret) {
-    if (production) err('LOADTEST_OTP_SECRET', 'bắt buộc trong production (register sẽ fail — E1)');
+    if (false) err('LOADTEST_OTP_SECRET', 'bắt buộc trong production (register sẽ fail — E1)');
     else warn('LOADTEST_OTP_SECRET', 'thiếu — register sẽ fail (cần set trong loadtest/.env)');
   }
killedBy: config — validateEnv (T-03 fail-fast) production + thiếu key → errors (DB required, OTP, AUTH)
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
loadtest/config.ts:243:9
   if (env.otpSecret && env.otpSecret.length < 32) {
     err('LOADTEST_OTP_SECRET', `phải ≥ 32 ký tự (hiện ${env.otpSecret.length})`);
   } else if (!env.otpSecret) {
-    if (production) err('LOADTEST_OTP_SECRET', 'bắt buộc trong production (register sẽ fail — E1)');
+    if (true) err('LOADTEST_OTP_SECRET', 'bắt buộc trong production (register sẽ fail — E1)');
     else warn('LOADTEST_OTP_SECRET', 'thiếu — register sẽ fail (cần set trong loadtest/.env)');
   }
killedBy: config — validateEnv (T-03 fail-fast) dev + dbRequired=false + thiếu key → không error (chỉ warning)
statusReason: expected [ Array(1) ] to have a length of +0 but got 1

[Killed] StringLiteral
loadtest/config.ts:244:15
     err('LOADTEST_OTP_SECRET', `phải ≥ 32 ký tự (hiện ${env.otpSecret.length})`);
   } else if (!env.otpSecret) {
     if (production) err('LOADTEST_OTP_SECRET', 'bắt buộc trong production (register sẽ fail — E1)');
-    else warn('LOADTEST_OTP_SECRET', 'thiếu — register sẽ fail (cần set trong loadtest/.env)');
+    else warn("", 'thiếu — register sẽ fail (cần set trong loadtest/.env)');
   }
 
killedBy: config — validateEnv (T-03 fail-fast) warning mặc định khi thiếu OTP/AUTH (dev) — message chính xác
statusReason: expected undefined to be 'thiếu — register sẽ fail (cần set tro…' // Object.is equality

[Killed] StringLiteral
loadtest/config.ts:244:38
     err('LOADTEST_OTP_SECRET', `phải ≥ 32 ký tự (hiện ${env.otpSecret.length})`);
   } else if (!env.otpSecret) {
     if (production) err('LOADTEST_OTP_SECRET', 'bắt buộc trong production (register sẽ fail — E1)');
-    else warn('LOADTEST_OTP_SECRET', 'thiếu — register sẽ fail (cần set trong loadtest/.env)');
+    else warn('LOADTEST_OTP_SECRET', "");
   }
 
killedBy: config — validateEnv (T-03 fail-fast) warning mặc định khi thiếu OTP/AUTH (dev) — message chính xác
statusReason: expected '' to be 'thiếu — register sẽ fail (cần set tro…' // Object.is equality

[Killed] EqualityOperator
loadtest/config.ts:248:25
   }
 
   // LOADTEST_AUTH_SECRET — ≥ 32 ký tự; production bắt buộc (auth.ts fallback tự sinh chỉ dev)
-  if (env.authSecret && env.authSecret.length < 32) {
+  if (env.authSecret && env.authSecret.length >= 32) {
     err('LOADTEST_AUTH_SECRET', `phải ≥ 32 ký tự (hiện ${env.authSecret.length})`);
   } else if (!env.authSecret) {
killedBy: config — validateEnv (T-03 fail-fast) OTP/AUTH quá ngắn (< 32) → error
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
loadtest/config.ts:248:7
   }
 
   // LOADTEST_AUTH_SECRET — ≥ 32 ký tự; production bắt buộc (auth.ts fallback tự sinh chỉ dev)
-  if (env.authSecret && env.authSecret.length < 32) {
+  if (true) {
     err('LOADTEST_AUTH_SECRET', `phải ≥ 32 ký tự (hiện ${env.authSecret.length})`);
   } else if (!env.authSecret) {
killedBy: config — validateEnv (T-03 fail-fast) dev + dbRequired=false + thiếu key → không error (chỉ warning)
statusReason: expected [ { …(3) } ] to have a length of +0 but got 1

[Killed] StringLiteral
loadtest/config.ts:249:9
 
   // LOADTEST_AUTH_SECRET — ≥ 32 ký tự; production bắt buộc (auth.ts fallback tự sinh chỉ dev)
   if (env.authSecret && env.authSecret.length < 32) {
-    err('LOADTEST_AUTH_SECRET', `phải ≥ 32 ký tự (hiện ${env.authSecret.length})`);
+    err("", `phải ≥ 32 ký tự (hiện ${env.authSecret.length})`);
   } else if (!env.authSecret) {
     if (production) err('LOADTEST_AUTH_SECRET', 'bắt buộc trong production (auth.ts fallback tự sinh chỉ dành cho dev)');
killedBy: config — validateEnv (T-03 fail-fast) OTP/AUTH quá ngắn (< 32) → error
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
loadtest/config.ts:250:14
   // LOADTEST_AUTH_SECRET — ≥ 32 ký tự; production bắt buộc (auth.ts fallback tự sinh chỉ dev)
   if (env.authSecret && env.authSecret.length < 32) {
     err('LOADTEST_AUTH_SECRET', `phải ≥ 32 ký tự (hiện ${env.authSecret.length})`);
-  } else if (!env.authSecret) {
+  } else if (env.authSecret) {
     if (production) err('LOADTEST_AUTH_SECRET', 'bắt buộc trong production (auth.ts fallback tự sinh chỉ dành cho dev)');
     else warn('LOADTEST_AUTH_SECRET', 'thiếu — sẽ dùng fallback tự sinh (dev-only)');
killedBy: config — validateEnv (T-03 fail-fast) production + thiếu key → errors (DB required, OTP, AUTH)
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
loadtest/config.ts:250:14
   // LOADTEST_AUTH_SECRET — ≥ 32 ký tự; production bắt buộc (auth.ts fallback tự sinh chỉ dev)
   if (env.authSecret && env.authSecret.length < 32) {
     err('LOADTEST_AUTH_SECRET', `phải ≥ 32 ký tự (hiện ${env.authSecret.length})`);
-  } else if (!env.authSecret) {
+  } else if (false) {
     if (production) err('LOADTEST_AUTH_SECRET', 'bắt buộc trong production (auth.ts fallback tự sinh chỉ dành cho dev)');
     else warn('LOADTEST_AUTH_SECRET', 'thiếu — sẽ dùng fallback tự sinh (dev-only)');
killedBy: config — validateEnv (T-03 fail-fast) production + thiếu key → errors (DB required, OTP, AUTH)
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
loadtest/config.ts:251:9
   if (env.authSecret && env.authSecret.length < 32) {
     err('LOADTEST_AUTH_SECRET', `phải ≥ 32 ký tự (hiện ${env.authSecret.length})`);
   } else if (!env.authSecret) {
-    if (production) err('LOADTEST_AUTH_SECRET', 'bắt buộc trong production (auth.ts fallback tự sinh chỉ dành cho dev)');
+    if (true) err('LOADTEST_AUTH_SECRET', 'bắt buộc trong production (auth.ts fallback tự sinh chỉ dành cho dev)');
     else warn('LOADTEST_AUTH_SECRET', 'thiếu — sẽ dùng fallback tự sinh (dev-only)');
   }
killedBy: config — validateEnv (T-03 fail-fast) dev + dbRequired=false + thiếu key → không error (chỉ warning)
statusReason: expected [ { …(3) } ] to have a length of +0 but got 1

[Killed] ConditionalExpression
loadtest/config.ts:251:9
   if (env.authSecret && env.authSecret.length < 32) {
     err('LOADTEST_AUTH_SECRET', `phải ≥ 32 ký tự (hiện ${env.authSecret.length})`);
   } else if (!env.authSecret) {
-    if (production) err('LOADTEST_AUTH_SECRET', 'bắt buộc trong production (auth.ts fallback tự sinh chỉ dành cho dev)');
+    if (false) err('LOADTEST_AUTH_SECRET', 'bắt buộc trong production (auth.ts fallback tự sinh chỉ dành cho dev)');
     else warn('LOADTEST_AUTH_SECRET', 'thiếu — sẽ dùng fallback tự sinh (dev-only)');
   }
killedBy: config — validateEnv (T-03 fail-fast) production + thiếu key → errors (DB required, OTP, AUTH)
statusReason: expected false to be true // Object.is equality

[Killed] StringLiteral
loadtest/config.ts:252:39
     err('LOADTEST_AUTH_SECRET', `phải ≥ 32 ký tự (hiện ${env.authSecret.length})`);
   } else if (!env.authSecret) {
     if (production) err('LOADTEST_AUTH_SECRET', 'bắt buộc trong production (auth.ts fallback tự sinh chỉ dành cho dev)');
-    else warn('LOADTEST_AUTH_SECRET', 'thiếu — sẽ dùng fallback tự sinh (dev-only)');
+    else warn('LOADTEST_AUTH_SECRET', "");
   }
 
killedBy: config — validateEnv (T-03 fail-fast) warning mặc định khi thiếu OTP/AUTH (dev) — message chính xác
statusReason: expected '' to be 'thiếu — sẽ dùng fallback tự sinh (dev…' // Object.is equality

[Killed] StringLiteral
loadtest/config.ts:252:15
     err('LOADTEST_AUTH_SECRET', `phải ≥ 32 ký tự (hiện ${env.authSecret.length})`);
   } else if (!env.authSecret) {
     if (production) err('LOADTEST_AUTH_SECRET', 'bắt buộc trong production (auth.ts fallback tự sinh chỉ dành cho dev)');
-    else warn('LOADTEST_AUTH_SECRET', 'thiếu — sẽ dùng fallback tự sinh (dev-only)');
+    else warn("", 'thiếu — sẽ dùng fallback tự sinh (dev-only)');
   }
 
killedBy: config — validateEnv (T-03 fail-fast) warning mặc định khi thiếu OTP/AUTH (dev) — message chính xác
statusReason: expected undefined to be 'thiếu — sẽ dùng fallback tự sinh (dev…' // Object.is equality
