[Killed] BlockStatement
loadtest/config.ts:256:62
   }
 
   // LOADTEST_REDIS_URL — nếu set phải đúng prefix
-  if (env.redisUrl && !/^redis(s)?:\/\//.test(env.redisUrl)) {
-    err('LOADTEST_REDIS_URL', `phải bắt đầu bằng redis:// hoặc rediss:// (hiện: ${redactUrl(env.redisUrl)}...)`);
-  }
+  if (env.redisUrl && !/^redis(s)?:\/\//.test(env.redisUrl)) {}
 
   return problems;
killedBy: config — validateEnv (T-03 fail-fast) REDIS_URL sai prefix → error
statusReason: expected false to be true // Object.is equality

[Killed] LogicalOperator
loadtest/config.ts:256:7
   }
 
   // LOADTEST_REDIS_URL — nếu set phải đúng prefix
-  if (env.redisUrl && !/^redis(s)?:\/\//.test(env.redisUrl)) {
+  if (env.redisUrl || !/^redis(s)?:\/\//.test(env.redisUrl)) {
     err('LOADTEST_REDIS_URL', `phải bắt đầu bằng redis:// hoặc rediss:// (hiện: ${redactUrl(env.redisUrl)}...)`);
   }
killedBy: config — validateEnv (T-03 fail-fast) dev + dbRequired=false + thiếu key → không error (chỉ warning)
statusReason: expected [ { key: 'LOADTEST_REDIS_URL', …(2) } ] to have a length of +0 but got 1

[Killed] ConditionalExpression
loadtest/config.ts:277:7
   const warnings: string[] = [];
 
   const gateway = normalizeUrl(req.gatewayUrl);
-  if (!gateway) errors.push('gatewayUrl bắt buộc');
+  if (true) errors.push('gatewayUrl bắt buộc');
   else if (!env.allowlist.includes(gateway)) {
     errors.push(
killedBy: config — validateRunRequest (SD-1 + giới hạn an toàn) chặn cứng gateway ngoài allowlist
statusReason: expected 'gatewayUrl bắt buộc' to contain 'allowlist'

[Killed] ConditionalExpression
loadtest/config.ts:277:7
   const warnings: string[] = [];
 
   const gateway = normalizeUrl(req.gatewayUrl);
-  if (!gateway) errors.push('gatewayUrl bắt buộc');
+  if (false) errors.push('gatewayUrl bắt buộc');
   else if (!env.allowlist.includes(gateway)) {
     errors.push(
killedBy: config — validateRunRequest message CHÍNH XÁC (T-11 — diệt string mutant) thiếu gatewayUrl → "gatewayUrl bắt buộc"
statusReason: expected [ Array(1) ] to include 'gatewayUrl bắt buộc'

[Killed] BlockStatement
loadtest/config.ts:278:46
 
   const gateway = normalizeUrl(req.gatewayUrl);
   if (!gateway) errors.push('gatewayUrl bắt buộc');
-  else if (!env.allowlist.includes(gateway)) {
-    errors.push(
-      `Gateway ${gateway} KHÔNG nằm trong allowlist test. Chỉ được chạy: ${env.allowlist.join(', ')}`,
-    );
-  }
+  else if (!env.allowlist.includes(gateway)) {}
 
   if (!Number.isInteger(req.targetUsers) || req.targetUsers < 1000) {
killedBy: config — validateRunRequest (SD-1 + giới hạn an toàn) chặn cứng gateway ngoài allowlist
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
loadtest/config.ts:278:12
 
   const gateway = normalizeUrl(req.gatewayUrl);
   if (!gateway) errors.push('gatewayUrl bắt buộc');
-  else if (!env.allowlist.includes(gateway)) {
+  else if (env.allowlist.includes(gateway)) {
     errors.push(
       `Gateway ${gateway} KHÔNG nằm trong allowlist test. Chỉ được chạy: ${env.allowlist.join(', ')}`,
killedBy: config — validateRunRequest (SD-1 + giới hạn an toàn) chặn cứng gateway ngoài allowlist
statusReason: expected true to be false // Object.is equality

[Survived] StringLiteral
loadtest/config.ts:280:95
   if (!gateway) errors.push('gatewayUrl bắt buộc');
   else if (!env.allowlist.includes(gateway)) {
     errors.push(
-      `Gateway ${gateway} KHÔNG nằm trong allowlist test. Chỉ được chạy: ${env.allowlist.join(', ')}`,
+      `Gateway ${gateway} KHÔNG nằm trong allowlist test. Chỉ được chạy: ${env.allowlist.join("")}`,
     );
   }

[Killed] ConditionalExpression
loadtest/config.ts:284:45
     );
   }
 
-  if (!Number.isInteger(req.targetUsers) || req.targetUsers < 1000) {
+  if (!Number.isInteger(req.targetUsers) || false) {
     errors.push('targetUsers phải ≥ 1000');
   } else if (req.targetUsers > env.maxTarget) {
killedBy: config — validateRunRequest message CHÍNH XÁC (T-11 — diệt string mutant) targetUsers < 1000 → "targetUsers phải ≥ 1000"
statusReason: expected [] to deeply equal [ 'targetUsers phải ≥ 1000' ]

[Killed] ConditionalExpression
loadtest/config.ts:284:7
     );
   }
 
-  if (!Number.isInteger(req.targetUsers) || req.targetUsers < 1000) {
+  if (false) {
     errors.push('targetUsers phải ≥ 1000');
   } else if (req.targetUsers > env.maxTarget) {
killedBy: config — validateRunRequest message CHÍNH XÁC (T-11 — diệt string mutant) targetUsers < 1000 → "targetUsers phải ≥ 1000"
statusReason: expected [] to deeply equal [ 'targetUsers phải ≥ 1000' ]

[Killed] ConditionalExpression
loadtest/config.ts:286:14
 
   if (!Number.isInteger(req.targetUsers) || req.targetUsers < 1000) {
     errors.push('targetUsers phải ≥ 1000');
-  } else if (req.targetUsers > env.maxTarget) {
+  } else if (false) {
     errors.push(
       `targetUsers ${req.targetUsers} vượt giới hạn an toàn ${env.maxTarget} (preset 1M/10M cần cluster — v1.1). ` +
killedBy: config — validateRunRequest (SD-1 + giới hạn an toàn) chặn target > maxTarget (preset 1M/10M)
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
loadtest/config.ts:286:47
 
   if (!Number.isInteger(req.targetUsers) || req.targetUsers < 1000) {
     errors.push('targetUsers phải ≥ 1000');
-  } else if (req.targetUsers > env.maxTarget) {
-    errors.push(
-      `targetUsers ${req.targetUsers} vượt giới hạn an toàn ${env.maxTarget} (preset 1M/10M cần cluster — v1.1). ` +
-        `Override bằng LOADTEST_MAX_TARGET nếu thực sự có hạ tầng.`,
-    );
-  }
+  } else if (req.targetUsers > env.maxTarget) {}
 
   if (!Number.isFinite(req.durationMin) || req.durationMin <= 0) {
killedBy: config — validateRunRequest (SD-1 + giới hạn an toàn) chặn target > maxTarget (preset 1M/10M)
statusReason: expected true to be false // Object.is equality

[Killed] StringLiteral
loadtest/config.ts:288:7
     errors.push('targetUsers phải ≥ 1000');
   } else if (req.targetUsers > env.maxTarget) {
     errors.push(
-      `targetUsers ${req.targetUsers} vượt giới hạn an toàn ${env.maxTarget} (preset 1M/10M cần cluster — v1.1). ` +
+      `` +
         `Override bằng LOADTEST_MAX_TARGET nếu thực sự có hạ tầng.`,
     );
killedBy: config — validateRunRequest (SD-1 + giới hạn an toàn) chặn target > maxTarget (preset 1M/10M)
statusReason: expected 'Override bằng LOADTEST_MAX_TARGET nếu…' to contain 'vượt giới hạn an toàn'

[Killed] EqualityOperator
loadtest/config.ts:293:44
     );
   }
 
-  if (!Number.isFinite(req.durationMin) || req.durationMin <= 0) {
+  if (!Number.isFinite(req.durationMin) || req.durationMin > 0) {
     errors.push('durationMin phải > 0');
   } else if (req.durationMin > env.maxDurationMin) {
killedBy: config — validateRunRequest (SD-1 + giới hạn an toàn) chấp nhận gateway trong allowlist
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
loadtest/config.ts:293:7
     );
   }
 
-  if (!Number.isFinite(req.durationMin) || req.durationMin <= 0) {
+  if (Number.isFinite(req.durationMin) || req.durationMin <= 0) {
     errors.push('durationMin phải > 0');
   } else if (req.durationMin > env.maxDurationMin) {
killedBy: config — validateRunRequest (SD-1 + giới hạn an toàn) chấp nhận gateway trong allowlist
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
loadtest/config.ts:295:52
 
   if (!Number.isFinite(req.durationMin) || req.durationMin <= 0) {
     errors.push('durationMin phải > 0');
-  } else if (req.durationMin > env.maxDurationMin) {
-    errors.push(
-      `durationMin ${req.durationMin} phút vượt tối đa ${env.maxDurationMin} phút (access token TTL 1h — PRD §5.3).`,
-    );
-  }
+  } else if (req.durationMin > env.maxDurationMin) {}
 
   if (!Number.isFinite(req.rampRate) || req.rampRate <= 0) {
killedBy: config — validateRunRequest (SD-1 + giới hạn an toàn) chặn duration > 60 phút (access token 1h)
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
loadtest/config.ts:295:14
 
   if (!Number.isFinite(req.durationMin) || req.durationMin <= 0) {
     errors.push('durationMin phải > 0');
-  } else if (req.durationMin > env.maxDurationMin) {
+  } else if (false) {
     errors.push(
       `durationMin ${req.durationMin} phút vượt tối đa ${env.maxDurationMin} phút (access token TTL 1h — PRD §5.3).`,
killedBy: config — validateRunRequest (SD-1 + giới hạn an toàn) chặn duration > 60 phút (access token 1h)
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
loadtest/config.ts:301:7
     );
   }
 
-  if (!Number.isFinite(req.rampRate) || req.rampRate <= 0) {
+  if (Number.isFinite(req.rampRate) || req.rampRate <= 0) {
     errors.push('rampRate phải > 0');
   } else if (req.rampRate > 2000) {
killedBy: config — validateRunRequest (SD-1 + giới hạn an toàn) chấp nhận gateway trong allowlist
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
loadtest/config.ts:301:41
     );
   }
 
-  if (!Number.isFinite(req.rampRate) || req.rampRate <= 0) {
+  if (!Number.isFinite(req.rampRate) || false) {
     errors.push('rampRate phải > 0');
   } else if (req.rampRate > 2000) {
killedBy: config — validateRunRequest message CHÍNH XÁC (T-11 — diệt string mutant) rampRate 0/âm → "rampRate phải > 0"; > 2000 → warning chính xác
statusReason: expected [] to include 'rampRate phải > 0'

[Killed] BlockStatement
loadtest/config.ts:303:35
 
   if (!Number.isFinite(req.rampRate) || req.rampRate <= 0) {
     errors.push('rampRate phải > 0');
-  } else if (req.rampRate > 2000) {
-    warnings.push('rampRate > 2000/s có thể bão hòa event loop tool và matching engine (~100 user/s chat).');
-  }
+  } else if (req.rampRate > 2000) {}
 
   const profile = req.profile;
killedBy: config — validateRunRequest message CHÍNH XÁC (T-11 — diệt string mutant) rampRate 0/âm → "rampRate phải > 0"; > 2000 → warning chính xác
statusReason: expected undefined to be 'rampRate > 2000/s có thể bão hòa even…' // Object.is equality

[Killed] ConditionalExpression
loadtest/config.ts:303:14
 
   if (!Number.isFinite(req.rampRate) || req.rampRate <= 0) {
     errors.push('rampRate phải > 0');
-  } else if (req.rampRate > 2000) {
+  } else if (false) {
     warnings.push('rampRate > 2000/s có thể bão hòa event loop tool và matching engine (~100 user/s chat).');
   }
killedBy: config — validateRunRequest message CHÍNH XÁC (T-11 — diệt string mutant) rampRate 0/âm → "rampRate phải > 0"; > 2000 → warning chính xác
statusReason: expected undefined to be 'rampRate > 2000/s có thể bão hòa even…' // Object.is equality

[Killed] StringLiteral
loadtest/config.ts:304:19
   if (!Number.isFinite(req.rampRate) || req.rampRate <= 0) {
     errors.push('rampRate phải > 0');
   } else if (req.rampRate > 2000) {
-    warnings.push('rampRate > 2000/s có thể bão hòa event loop tool và matching engine (~100 user/s chat).');
+    warnings.push("");
   }
 
killedBy: config — validateRunRequest message CHÍNH XÁC (T-11 — diệt string mutant) rampRate 0/âm → "rampRate phải > 0"; > 2000 → warning chính xác
statusReason: expected '' to be 'rampRate > 2000/s có thể bão hòa even…' // Object.is equality

[Killed] ConditionalExpression
loadtest/config.ts:308:7
   }
 
   const profile = req.profile;
-  if (!profile) errors.push('profile bắt buộc');
+  if (true) errors.push('profile bắt buộc');
   else {
     const sum = profile.chat + profile.read + profile.comment + profile.like + profile.view;
killedBy: config — validateRunRequest (SD-1 + giới hạn an toàn) chấp nhận gateway trong allowlist
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
loadtest/config.ts:308:7
   }
 
   const profile = req.profile;
-  if (!profile) errors.push('profile bắt buộc');
+  if (false) errors.push('profile bắt buộc');
   else {
     const sum = profile.chat + profile.read + profile.comment + profile.like + profile.view;
killedBy: config — validateRunRequest message CHÍNH XÁC (T-11 — diệt string mutant) thiếu profile → "profile bắt buộc"; tổng ≠ 100 → message chính xác
statusReason: Cannot read properties of undefined (reading 'chat')

[Killed] BlockStatement
loadtest/config.ts:309:8
 
   const profile = req.profile;
   if (!profile) errors.push('profile bắt buộc');
-  else {
-    const sum = profile.chat + profile.read + profile.comment + profile.like + profile.view;
-    if (Math.abs(sum - 100) > 0.001) {
-      errors.push(`Tổng profile = ${sum}% — phải đúng 100%`);
-    }
-    if (profile.chat > 0 && req.targetUsers > 10_000) {
-      // 10k chat user @ 100/s matching → ~100s seat; với target lớn cần thời gian
-      const seatSec = req.targetUsers / 100;
-      if (seatSec > req.durationMin * 60) {
-        warnings.push(
-          `Matching engine trần ~100 user/s: seat ${req.targetUsers} chat user mất ~${Math.ceil(seatSec / 60)} phút > duration.`,
-        );
-      }
-    }
-    for (const k of ['chat', 'read', 'comment', 'like', 'view'] as const) {
-      if (!Number.isFinite(profile[k]) || profile[k] < 0) errors.push(`profile.${k} không hợp lệ`);
-    }
-  }
+  else {}
 
   return { ok: errors.length === 0, errors, warnings };
killedBy: config — validateRunRequest (SD-1 + giới hạn an toàn) chặn profile tổng ≠ 100%
statusReason: expected true to be false // Object.is equality

[Killed] ArithmeticOperator
loadtest/config.ts:310:17
   const profile = req.profile;
   if (!profile) errors.push('profile bắt buộc');
   else {
-    const sum = profile.chat + profile.read + profile.comment + profile.like + profile.view;
+    const sum = profile.chat + profile.read - profile.comment + profile.like + profile.view;
     if (Math.abs(sum - 100) > 0.001) {
       errors.push(`Tổng profile = ${sum}% — phải đúng 100%`);
killedBy: config — validateRunRequest (SD-1 + giới hạn an toàn) chấp nhận gateway trong allowlist
statusReason: expected false to be true // Object.is equality

[Killed] ArithmeticOperator
loadtest/config.ts:310:17
   const profile = req.profile;
   if (!profile) errors.push('profile bắt buộc');
   else {
-    const sum = profile.chat + profile.read + profile.comment + profile.like + profile.view;
+    const sum = profile.chat - profile.read + profile.comment + profile.like + profile.view;
     if (Math.abs(sum - 100) > 0.001) {
       errors.push(`Tổng profile = ${sum}% — phải đúng 100%`);
killedBy: config — validateRunRequest (SD-1 + giới hạn an toàn) chấp nhận gateway trong allowlist
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
loadtest/config.ts:311:9
   if (!profile) errors.push('profile bắt buộc');
   else {
     const sum = profile.chat + profile.read + profile.comment + profile.like + profile.view;
-    if (Math.abs(sum - 100) > 0.001) {
+    if (Math.abs(sum - 100) <= 0.001) {
       errors.push(`Tổng profile = ${sum}% — phải đúng 100%`);
     }
killedBy: config — validateRunRequest (SD-1 + giới hạn an toàn) chấp nhận gateway trong allowlist
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
loadtest/config.ts:311:9
   if (!profile) errors.push('profile bắt buộc');
   else {
     const sum = profile.chat + profile.read + profile.comment + profile.like + profile.view;
-    if (Math.abs(sum - 100) > 0.001) {
+    if (false) {
       errors.push(`Tổng profile = ${sum}% — phải đúng 100%`);
     }
killedBy: config — validateRunRequest (SD-1 + giới hạn an toàn) chặn profile tổng ≠ 100%
statusReason: expected true to be false // Object.is equality

[Killed] StringLiteral
loadtest/config.ts:312:19
   else {
     const sum = profile.chat + profile.read + profile.comment + profile.like + profile.view;
     if (Math.abs(sum - 100) > 0.001) {
-      errors.push(`Tổng profile = ${sum}% — phải đúng 100%`);
+      errors.push(``);
     }
     if (profile.chat > 0 && req.targetUsers > 10_000) {
killedBy: config — validateRunRequest message CHÍNH XÁC (T-11 — diệt string mutant) thiếu profile → "profile bắt buộc"; tổng ≠ 100 → message chính xác
statusReason: expected '' to be 'Tổng profile = 95% — phải đúng 100%' // Object.is equality

[Killed] EqualityOperator
loadtest/config.ts:314:29
     if (Math.abs(sum - 100) > 0.001) {
       errors.push(`Tổng profile = ${sum}% — phải đúng 100%`);
     }
-    if (profile.chat > 0 && req.targetUsers > 10_000) {
+    if (profile.chat > 0 && req.targetUsers <= 10_000) {
       // 10k chat user @ 100/s matching → ~100s seat; với target lớn cần thời gian
       const seatSec = req.targetUsers / 100;
killedBy: config — validateRunRequest (SD-1 + giới hạn an toàn) cảnh báo khi ramp chat vượt trần matching
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
loadtest/config.ts:314:9
     if (Math.abs(sum - 100) > 0.001) {
       errors.push(`Tổng profile = ${sum}% — phải đúng 100%`);
     }
-    if (profile.chat > 0 && req.targetUsers > 10_000) {
+    if (profile.chat <= 0 && req.targetUsers > 10_000) {
       // 10k chat user @ 100/s matching → ~100s seat; với target lớn cần thời gian
       const seatSec = req.targetUsers / 100;
killedBy: config — validateRunRequest (SD-1 + giới hạn an toàn) cảnh báo khi ramp chat vượt trần matching
statusReason: expected false to be true // Object.is equality

[Killed] ArithmeticOperator
loadtest/config.ts:316:23
     }
     if (profile.chat > 0 && req.targetUsers > 10_000) {
       // 10k chat user @ 100/s matching → ~100s seat; với target lớn cần thời gian
-      const seatSec = req.targetUsers / 100;
+      const seatSec = req.targetUsers * 100;
       if (seatSec > req.durationMin * 60) {
         warnings.push(
killedBy: config — validateRunRequest message CHÍNH XÁC (T-11 — diệt string mutant) cảnh báo matching seat: chat=0 → KHÔNG warning; target đúng biên 10_000 → KHÔNG warning; seat == duration → KHÔNG warning
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
loadtest/config.ts:317:11
     if (profile.chat > 0 && req.targetUsers > 10_000) {
       // 10k chat user @ 100/s matching → ~100s seat; với target lớn cần thời gian
       const seatSec = req.targetUsers / 100;
-      if (seatSec > req.durationMin * 60) {
+      if (true) {
         warnings.push(
           `Matching engine trần ~100 user/s: seat ${req.targetUsers} chat user mất ~${Math.ceil(seatSec / 60)} phút > duration.`,
killedBy: config — validateRunRequest message CHÍNH XÁC (T-11 — diệt string mutant) cảnh báo matching seat: chat=0 → KHÔNG warning; target đúng biên 10_000 → KHÔNG warning; seat == duration → KHÔNG warning
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
loadtest/config.ts:317:11
     if (profile.chat > 0 && req.targetUsers > 10_000) {
       // 10k chat user @ 100/s matching → ~100s seat; với target lớn cần thời gian
       const seatSec = req.targetUsers / 100;
-      if (seatSec > req.durationMin * 60) {
+      if (seatSec <= req.durationMin * 60) {
         warnings.push(
           `Matching engine trần ~100 user/s: seat ${req.targetUsers} chat user mất ~${Math.ceil(seatSec / 60)} phút > duration.`,
killedBy: config — validateRunRequest (SD-1 + giới hạn an toàn) cảnh báo khi ramp chat vượt trần matching
statusReason: expected false to be true // Object.is equality

[Survived] ArithmeticOperator
loadtest/config.ts:319:97
       const seatSec = req.targetUsers / 100;
       if (seatSec > req.durationMin * 60) {
         warnings.push(
-          `Matching engine trần ~100 user/s: seat ${req.targetUsers} chat user mất ~${Math.ceil(seatSec / 60)} phút > duration.`,
+          `Matching engine trần ~100 user/s: seat ${req.targetUsers} chat user mất ~${Math.ceil(seatSec * 60)} phút > duration.`,
         );
       }

[Killed] StringLiteral
loadtest/config.ts:319:11
       const seatSec = req.targetUsers / 100;
       if (seatSec > req.durationMin * 60) {
         warnings.push(
-          `Matching engine trần ~100 user/s: seat ${req.targetUsers} chat user mất ~${Math.ceil(seatSec / 60)} phút > duration.`,
+          ``,
         );
       }
killedBy: config — validateRunRequest (SD-1 + giới hạn an toàn) cảnh báo khi ramp chat vượt trần matching
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
loadtest/config.ts:323:75
         );
       }
     }
-    for (const k of ['chat', 'read', 'comment', 'like', 'view'] as const) {
-      if (!Number.isFinite(profile[k]) || profile[k] < 0) errors.push(`profile.${k} không hợp lệ`);
-    }
+    for (const k of ['chat', 'read', 'comment', 'like', 'view'] as const) {}
   }
 
killedBy: config — validateRunRequest message CHÍNH XÁC (T-11 — diệt string mutant) profile field NaN/âm → "profile.{k} không hợp lệ"
statusReason: expected [] to include 'profile.chat không hợp lệ'

[Killed] ConditionalExpression
loadtest/config.ts:324:11
       }
     }
     for (const k of ['chat', 'read', 'comment', 'like', 'view'] as const) {
-      if (!Number.isFinite(profile[k]) || profile[k] < 0) errors.push(`profile.${k} không hợp lệ`);
+      if (true) errors.push(`profile.${k} không hợp lệ`);
     }
   }
killedBy: config — validateRunRequest (SD-1 + giới hạn an toàn) chấp nhận gateway trong allowlist
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
loadtest/config.ts:324:43
       }
     }
     for (const k of ['chat', 'read', 'comment', 'like', 'view'] as const) {
-      if (!Number.isFinite(profile[k]) || profile[k] < 0) errors.push(`profile.${k} không hợp lệ`);
+      if (!Number.isFinite(profile[k]) || profile[k] >= 0) errors.push(`profile.${k} không hợp lệ`);
     }
   }
killedBy: config — validateRunRequest (SD-1 + giới hạn an toàn) chấp nhận gateway trong allowlist
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
loadtest/config.ts:328:16
     }
   }
 
-  return { ok: errors.length === 0, errors, warnings };
+  return { ok: true, errors, warnings };
 }
 
killedBy: config — validateRunRequest (SD-1 + giới hạn an toàn) chặn cứng gateway ngoài allowlist
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
loadtest/config.ts:328:16
     }
   }
 
-  return { ok: errors.length === 0, errors, warnings };
+  return { ok: false, errors, warnings };
 }
 
killedBy: config — validateRunRequest (SD-1 + giới hạn an toàn) chấp nhận gateway trong allowlist
statusReason: expected false to be true // Object.is equality

[Survived] BooleanLiteral
loadtest/config.ts:340:68
 }
 
 export const PRESETS: Preset[] = [
-  { id: '10k', label: '10k', targetUsers: 10_000, requiresCluster: false },
+  { id: '10k', label: '10k', targetUsers: 10_000, requiresCluster: true },
   { id: '50k', label: '50k', targetUsers: 50_000, requiresCluster: false },
   { id: '100k', label: '100k', targetUsers: 100_000, requiresCluster: false },

[Survived] StringLiteral
loadtest/config.ts:340:23
 }
 
 export const PRESETS: Preset[] = [
-  { id: '10k', label: '10k', targetUsers: 10_000, requiresCluster: false },
+  { id: '10k', label: "", targetUsers: 10_000, requiresCluster: false },
   { id: '50k', label: '50k', targetUsers: 50_000, requiresCluster: false },
   { id: '100k', label: '100k', targetUsers: 100_000, requiresCluster: false },

[Survived] BooleanLiteral
loadtest/config.ts:341:68
 
 export const PRESETS: Preset[] = [
   { id: '10k', label: '10k', targetUsers: 10_000, requiresCluster: false },
-  { id: '50k', label: '50k', targetUsers: 50_000, requiresCluster: false },
+  { id: '50k', label: '50k', targetUsers: 50_000, requiresCluster: true },
   { id: '100k', label: '100k', targetUsers: 100_000, requiresCluster: false },
   { id: '1M', label: '1M', targetUsers: 1_000_000, requiresCluster: true },

[Survived] StringLiteral
loadtest/config.ts:341:23
 
 export const PRESETS: Preset[] = [
   { id: '10k', label: '10k', targetUsers: 10_000, requiresCluster: false },
-  { id: '50k', label: '50k', targetUsers: 50_000, requiresCluster: false },
+  { id: '50k', label: "", targetUsers: 50_000, requiresCluster: false },
   { id: '100k', label: '100k', targetUsers: 100_000, requiresCluster: false },
   { id: '1M', label: '1M', targetUsers: 1_000_000, requiresCluster: true },

[Survived] BooleanLiteral
loadtest/config.ts:342:71
 export const PRESETS: Preset[] = [
   { id: '10k', label: '10k', targetUsers: 10_000, requiresCluster: false },
   { id: '50k', label: '50k', targetUsers: 50_000, requiresCluster: false },
-  { id: '100k', label: '100k', targetUsers: 100_000, requiresCluster: false },
+  { id: '100k', label: '100k', targetUsers: 100_000, requiresCluster: true },
   { id: '1M', label: '1M', targetUsers: 1_000_000, requiresCluster: true },
   { id: '10M', label: '10M', targetUsers: 10_000_000, requiresCluster: true },

[Killed] BooleanLiteral
loadtest/config.ts:343:69
   { id: '10k', label: '10k', targetUsers: 10_000, requiresCluster: false },
   { id: '50k', label: '50k', targetUsers: 50_000, requiresCluster: false },
   { id: '100k', label: '100k', targetUsers: 100_000, requiresCluster: false },
-  { id: '1M', label: '1M', targetUsers: 1_000_000, requiresCluster: true },
+  { id: '1M', label: '1M', targetUsers: 1_000_000, requiresCluster: false },
   { id: '10M', label: '10M', targetUsers: 10_000_000, requiresCluster: true },
 ];
killedBy: config — misc (T-11) PRESETS: 1M/10M requiresCluster, label đúng
statusReason: expected false to be true // Object.is equality

[Killed] ObjectLiteral
loadtest/config.ts:343:3
   { id: '10k', label: '10k', targetUsers: 10_000, requiresCluster: false },
   { id: '50k', label: '50k', targetUsers: 50_000, requiresCluster: false },
   { id: '100k', label: '100k', targetUsers: 100_000, requiresCluster: false },
-  { id: '1M', label: '1M', targetUsers: 1_000_000, requiresCluster: true },
+  {},
   { id: '10M', label: '10M', targetUsers: 10_000_000, requiresCluster: true },
 ];
killedBy: config — misc (T-11) PRESETS: 1M/10M requiresCluster, label đúng
statusReason: expected [ '10k', '50k', '100k', …(2) ] to deeply equal [ '10k', '50k', '100k', '1M', '10M' ]

[Killed] BooleanLiteral
loadtest/config.ts:344:72
   { id: '50k', label: '50k', targetUsers: 50_000, requiresCluster: false },
   { id: '100k', label: '100k', targetUsers: 100_000, requiresCluster: false },
   { id: '1M', label: '1M', targetUsers: 1_000_000, requiresCluster: true },
-  { id: '10M', label: '10M', targetUsers: 10_000_000, requiresCluster: true },
+  { id: '10M', label: '10M', targetUsers: 10_000_000, requiresCluster: false },
 ];
 
killedBy: config — misc (T-11) PRESETS: 1M/10M requiresCluster, label đúng
statusReason: expected false to be true // Object.is equality

[Survived] StringLiteral
loadtest/config.ts:344:23
   { id: '50k', label: '50k', targetUsers: 50_000, requiresCluster: false },
   { id: '100k', label: '100k', targetUsers: 100_000, requiresCluster: false },
   { id: '1M', label: '1M', targetUsers: 1_000_000, requiresCluster: true },
-  { id: '10M', label: '10M', targetUsers: 10_000_000, requiresCluster: true },
+  { id: '10M', label: "", targetUsers: 10_000_000, requiresCluster: true },
 ];
 

[Killed] BlockStatement
loadtest/config.ts:350:71
 export const DEFAULT_PROFILE: ActionProfile = { chat: 40, read: 30, comment: 20, like: 10, view: 0 };
 
 /** Ước lượng hạ tầng cho UI (Màn 1 "ƯỚC LƯỢNG"). */
-export function estimateInfra(targetUsers: number, _env: LoadTestEnv) {
-  const workers = Math.min(Math.max(1, Math.ceil(targetUsers / 10_000)), 32);
-  const ramGB = Math.ceil((targetUsers * 60 * 1024) / (1024 ** 3)); // ~60KB/socket (PRD §5.1)
-  const seatMin = Math.ceil(targetUsers / 100 / 60); // matching ~100 user/s
-  return { workers, ramGB, seatMin };
-}
+export function estimateInfra(targetUsers: number, _env: LoadTestEnv) {}
 
 /** Resolve workerCount từ target nếu chưa cấu hình (auto). */
killedBy: config — resolveWorkerCount / estimateInfra (T-11) estimateInfra: workers/ramGB/seatMin
statusReason: Cannot read properties of undefined (reading 'workers')

[Killed] ArithmeticOperator
loadtest/config.ts:351:50
 
 /** Ước lượng hạ tầng cho UI (Màn 1 "ƯỚC LƯỢNG"). */
 export function estimateInfra(targetUsers: number, _env: LoadTestEnv) {
-  const workers = Math.min(Math.max(1, Math.ceil(targetUsers / 10_000)), 32);
+  const workers = Math.min(Math.max(1, Math.ceil(targetUsers * 10_000)), 32);
   const ramGB = Math.ceil((targetUsers * 60 * 1024) / (1024 ** 3)); // ~60KB/socket (PRD §5.1)
   const seatMin = Math.ceil(targetUsers / 100 / 60); // matching ~100 user/s
killedBy: config — resolveWorkerCount / estimateInfra (T-11) estimateInfra: workers/ramGB/seatMin
statusReason: expected 32 to be 5 // Object.is equality

[Killed] MethodExpression
loadtest/config.ts:351:28
 
 /** Ước lượng hạ tầng cho UI (Màn 1 "ƯỚC LƯỢNG"). */
 export function estimateInfra(targetUsers: number, _env: LoadTestEnv) {
-  const workers = Math.min(Math.max(1, Math.ceil(targetUsers / 10_000)), 32);
+  const workers = Math.min(Math.min(1, Math.ceil(targetUsers / 10_000)), 32);
   const ramGB = Math.ceil((targetUsers * 60 * 1024) / (1024 ** 3)); // ~60KB/socket (PRD §5.1)
   const seatMin = Math.ceil(targetUsers / 100 / 60); // matching ~100 user/s
killedBy: config — resolveWorkerCount / estimateInfra (T-11) estimateInfra: workers/ramGB/seatMin
statusReason: expected 1 to be 5 // Object.is equality
