[Killed] ArithmeticOperator
loadtest/config.ts:352:28
 /** Ước lượng hạ tầng cho UI (Màn 1 "ƯỚC LƯỢNG"). */
 export function estimateInfra(targetUsers: number, _env: LoadTestEnv) {
   const workers = Math.min(Math.max(1, Math.ceil(targetUsers / 10_000)), 32);
-  const ramGB = Math.ceil((targetUsers * 60 * 1024) / (1024 ** 3)); // ~60KB/socket (PRD §5.1)
+  const ramGB = Math.ceil((targetUsers * 60 / 1024) / (1024 ** 3)); // ~60KB/socket (PRD §5.1)
   const seatMin = Math.ceil(targetUsers / 100 / 60); // matching ~100 user/s
   return { workers, ramGB, seatMin };
killedBy: config — resolveWorkerCount / estimateInfra (T-11) estimateInfra: workers/ramGB/seatMin
statusReason: expected 1 to be greater than 2

[Killed] ArithmeticOperator
loadtest/config.ts:352:28
 /** Ước lượng hạ tầng cho UI (Màn 1 "ƯỚC LƯỢNG"). */
 export function estimateInfra(targetUsers: number, _env: LoadTestEnv) {
   const workers = Math.min(Math.max(1, Math.ceil(targetUsers / 10_000)), 32);
-  const ramGB = Math.ceil((targetUsers * 60 * 1024) / (1024 ** 3)); // ~60KB/socket (PRD §5.1)
+  const ramGB = Math.ceil((targetUsers / 60 * 1024) / (1024 ** 3)); // ~60KB/socket (PRD §5.1)
   const seatMin = Math.ceil(targetUsers / 100 / 60); // matching ~100 user/s
   return { workers, ramGB, seatMin };
killedBy: config — resolveWorkerCount / estimateInfra (T-11) estimateInfra: workers/ramGB/seatMin
statusReason: expected 1 to be greater than 2

[Killed] ArithmeticOperator
loadtest/config.ts:353:29
 export function estimateInfra(targetUsers: number, _env: LoadTestEnv) {
   const workers = Math.min(Math.max(1, Math.ceil(targetUsers / 10_000)), 32);
   const ramGB = Math.ceil((targetUsers * 60 * 1024) / (1024 ** 3)); // ~60KB/socket (PRD §5.1)
-  const seatMin = Math.ceil(targetUsers / 100 / 60); // matching ~100 user/s
+  const seatMin = Math.ceil(targetUsers * 100 / 60); // matching ~100 user/s
   return { workers, ramGB, seatMin };
 }
killedBy: config — resolveWorkerCount / estimateInfra (T-11) estimateInfra: workers/ramGB/seatMin
statusReason: expected 83334 to be 9 // Object.is equality

[Killed] ArithmeticOperator
loadtest/config.ts:353:29
 export function estimateInfra(targetUsers: number, _env: LoadTestEnv) {
   const workers = Math.min(Math.max(1, Math.ceil(targetUsers / 10_000)), 32);
   const ramGB = Math.ceil((targetUsers * 60 * 1024) / (1024 ** 3)); // ~60KB/socket (PRD §5.1)
-  const seatMin = Math.ceil(targetUsers / 100 / 60); // matching ~100 user/s
+  const seatMin = Math.ceil(targetUsers / 100 * 60); // matching ~100 user/s
   return { workers, ramGB, seatMin };
 }
killedBy: config — resolveWorkerCount / estimateInfra (T-11) estimateInfra: workers/ramGB/seatMin
statusReason: expected 30000 to be 9 // Object.is equality

[Killed] BlockStatement
loadtest/config.ts:358:83
 }
 
 /** Resolve workerCount từ target nếu chưa cấu hình (auto). */
-export function resolveWorkerCount(targetUsers: number, env: LoadTestEnv): number {
-  if (env.workerCount > 0) return env.workerCount;
-  const cpus = os.availableParallelism?.() ?? 4;
-  const byTarget = Math.ceil(targetUsers / env.maxSocketsPerWorker);
-  return Math.min(Math.max(1, Math.min(cpus - 1 || 1, byTarget)), 32);
-}
+export function resolveWorkerCount(targetUsers: number, env: LoadTestEnv): number {}
 
 // S-9/B-4: seed pid + counter để 2 run sau restart không trùng id (runSeq reset 0 mỗi restart).
killedBy: config — buildRunConfig resolve workerCount + durationSec + seed
statusReason: expected undefined to be 4 // Object.is equality

[Killed] EqualityOperator
loadtest/config.ts:359:7
 
 /** Resolve workerCount từ target nếu chưa cấu hình (auto). */
 export function resolveWorkerCount(targetUsers: number, env: LoadTestEnv): number {
-  if (env.workerCount > 0) return env.workerCount;
+  if (env.workerCount >= 0) return env.workerCount;
   const cpus = os.availableParallelism?.() ?? 4;
   const byTarget = Math.ceil(targetUsers / env.maxSocketsPerWorker);
killedBy: config — buildRunConfig auto workerCount theo target
statusReason: expected 0 to be greater than or equal to 1

[Killed] EqualityOperator
loadtest/config.ts:359:7
 
 /** Resolve workerCount từ target nếu chưa cấu hình (auto). */
 export function resolveWorkerCount(targetUsers: number, env: LoadTestEnv): number {
-  if (env.workerCount > 0) return env.workerCount;
+  if (env.workerCount <= 0) return env.workerCount;
   const cpus = os.availableParallelism?.() ?? 4;
   const byTarget = Math.ceil(targetUsers / env.maxSocketsPerWorker);
killedBy: config — buildRunConfig resolve workerCount + durationSec + seed
statusReason: expected 1 to be 4 // Object.is equality

[Killed] LogicalOperator
loadtest/config.ts:360:16
 /** Resolve workerCount từ target nếu chưa cấu hình (auto). */
 export function resolveWorkerCount(targetUsers: number, env: LoadTestEnv): number {
   if (env.workerCount > 0) return env.workerCount;
-  const cpus = os.availableParallelism?.() ?? 4;
+  const cpus = os.availableParallelism?.() && 4;
   const byTarget = Math.ceil(targetUsers / env.maxSocketsPerWorker);
   return Math.min(Math.max(1, Math.min(cpus - 1 || 1, byTarget)), 32);
killedBy: config — resolveWorkerCount / estimateInfra (T-11) auto: giá trị CHÍNH XÁC với availableParallelism mock (diệt mutant min/max/||)
statusReason: expected 3 to be 32 // Object.is equality

[Survived] OptionalChaining
loadtest/config.ts:360:16
 /** Resolve workerCount từ target nếu chưa cấu hình (auto). */
 export function resolveWorkerCount(targetUsers: number, env: LoadTestEnv): number {
   if (env.workerCount > 0) return env.workerCount;
-  const cpus = os.availableParallelism?.() ?? 4;
+  const cpus = os.availableParallelism() ?? 4;
   const byTarget = Math.ceil(targetUsers / env.maxSocketsPerWorker);
   return Math.min(Math.max(1, Math.min(cpus - 1 || 1, byTarget)), 32);

[Survived] ArithmeticOperator
loadtest/config.ts:361:30
 export function resolveWorkerCount(targetUsers: number, env: LoadTestEnv): number {
   if (env.workerCount > 0) return env.workerCount;
   const cpus = os.availableParallelism?.() ?? 4;
-  const byTarget = Math.ceil(targetUsers / env.maxSocketsPerWorker);
+  const byTarget = Math.ceil(targetUsers * env.maxSocketsPerWorker);
   return Math.min(Math.max(1, Math.min(cpus - 1 || 1, byTarget)), 32);
 }

[Killed] LogicalOperator
loadtest/config.ts:362:40
   if (env.workerCount > 0) return env.workerCount;
   const cpus = os.availableParallelism?.() ?? 4;
   const byTarget = Math.ceil(targetUsers / env.maxSocketsPerWorker);
-  return Math.min(Math.max(1, Math.min(cpus - 1 || 1, byTarget)), 32);
+  return Math.min(Math.max(1, Math.min(cpus - 1 && 1, byTarget)), 32);
 }
 
killedBy: config — resolveWorkerCount / estimateInfra (T-11) auto: giá trị CHÍNH XÁC với availableParallelism mock (diệt mutant min/max/||)
statusReason: expected 1 to be 32 // Object.is equality

[Killed] MethodExpression
loadtest/config.ts:362:10
   if (env.workerCount > 0) return env.workerCount;
   const cpus = os.availableParallelism?.() ?? 4;
   const byTarget = Math.ceil(targetUsers / env.maxSocketsPerWorker);
-  return Math.min(Math.max(1, Math.min(cpus - 1 || 1, byTarget)), 32);
+  return Math.max(Math.max(1, Math.min(cpus - 1 || 1, byTarget)), 32);
 }
 
killedBy: config — resolveWorkerCount / estimateInfra (T-11) auto: clamp theo target/socketsPerWorker và 32
statusReason: expected 99 to be less than or equal to 32

[Survived] ArithmeticOperator
loadtest/config.ts:366:18
 }
 
 // S-9/B-4: seed pid + counter để 2 run sau restart không trùng id (runSeq reset 0 mỗi restart).
-const pidPart = (process.pid % 46656).toString(36).padStart(3, '0');
+const pidPart = (process.pid * 46656).toString(36).padStart(3, '0');
 let runSeq = 0;
 

[Killed] BlockStatement
loadtest/config.ts:369:36
 const pidPart = (process.pid % 46656).toString(36).padStart(3, '0');
 let runSeq = 0;
 
-export function newRunId(): string {
-  runSeq = (runSeq + 1) % 1296;
-  const ts = Date.now().toString(36); // toàn bộ timestamp — không slice (B-4: slice(-6) wrap 25.2 ngày)
-  return `lt${ts}${pidPart}${runSeq.toString(36).padStart(2, '0')}`;
-}
+export function newRunId(): string {}
 
 /** Resolve RunConfig từ StartRunRequest (đã validate). */
killedBy: config — buildRunConfig resolve workerCount + durationSec + seed
statusReason: .toMatch() expects to receive a string, but got undefined

[Killed] ArithmeticOperator
loadtest/config.ts:370:13
 let runSeq = 0;
 
 export function newRunId(): string {
-  runSeq = (runSeq + 1) % 1296;
+  runSeq = (runSeq - 1) % 1296;
   const ts = Date.now().toString(36); // toàn bộ timestamp — không slice (B-4: slice(-6) wrap 25.2 ngày)
   return `lt${ts}${pidPart}${runSeq.toString(36).padStart(2, '0')}`;
killedBy: config — newRunId (S-9/B-4 collision fix) sau "restart" (module reload, runSeq reset) → id khác id cũ
statusReason: expected 'ltmsfh6ype1jw-1' to match /^lt[a-z0-9]{2,24}$/i

[Survived] ArithmeticOperator
loadtest/config.ts:370:12
 let runSeq = 0;
 
 export function newRunId(): string {
-  runSeq = (runSeq + 1) % 1296;
+  runSeq = (runSeq + 1) * 1296;
   const ts = Date.now().toString(36); // toàn bộ timestamp — không slice (B-4: slice(-6) wrap 25.2 ngày)
   return `lt${ts}${pidPart}${runSeq.toString(36).padStart(2, '0')}`;

[Killed] BlockStatement
loadtest/config.ts:376:83
 }
 
 /** Resolve RunConfig từ StartRunRequest (đã validate). */
-export function buildRunConfig(req: StartRunRequest, env: LoadTestEnv): RunConfig {
-  const workers = resolveWorkerCount(req.targetUsers, env);
-  const socketsPerWorker = Math.ceil(req.targetUsers / workers);
-  return {
-    runId: newRunId(),
-    targetUsers: req.targetUsers,
-    rampRate: req.rampRate,
-    rampMode: req.rampMode,
-    durationMin: req.durationMin,
-    durationSec: req.durationMin * 60,
-    profile: { ...DEFAULT_PROFILE, ...req.profile },
-    gatewayUrl: normalizeUrl(req.gatewayUrl),
-    workerCount: workers,
-    socketsPerWorker,
-    registerRamp: Math.min(env.registerRamp, env.maxRegisterRamp),
-    useExistingAccounts: !req.freshAccounts,
-    freshAccounts: !!req.freshAccounts,
-    seed: Date.now() % 1_000_000,
-    createdAt: Date.now(),
-  };
-}
+export function buildRunConfig(req: StartRunRequest, env: LoadTestEnv): RunConfig {}
 
 // ─── Settings file (allowlist bổ sung qua API Settings — SD-1) ─────────────
killedBy: config — buildRunConfig resolve workerCount + durationSec + seed
statusReason: Cannot read properties of undefined (reading 'workerCount')

[Killed] ArithmeticOperator
loadtest/config.ts:378:38
 /** Resolve RunConfig từ StartRunRequest (đã validate). */
 export function buildRunConfig(req: StartRunRequest, env: LoadTestEnv): RunConfig {
   const workers = resolveWorkerCount(req.targetUsers, env);
-  const socketsPerWorker = Math.ceil(req.targetUsers / workers);
+  const socketsPerWorker = Math.ceil(req.targetUsers * workers);
   return {
     runId: newRunId(),
killedBy: config — buildRunConfig resolve workerCount + durationSec + seed
statusReason: expected 40000 to be 2500 // Object.is equality

[Killed] ObjectLiteral
loadtest/config.ts:379:10
 export function buildRunConfig(req: StartRunRequest, env: LoadTestEnv): RunConfig {
   const workers = resolveWorkerCount(req.targetUsers, env);
   const socketsPerWorker = Math.ceil(req.targetUsers / workers);
-  return {
-    runId: newRunId(),
-    targetUsers: req.targetUsers,
-    rampRate: req.rampRate,
-    rampMode: req.rampMode,
-    durationMin: req.durationMin,
-    durationSec: req.durationMin * 60,
-    profile: { ...DEFAULT_PROFILE, ...req.profile },
-    gatewayUrl: normalizeUrl(req.gatewayUrl),
-    workerCount: workers,
-    socketsPerWorker,
-    registerRamp: Math.min(env.registerRamp, env.maxRegisterRamp),
-    useExistingAccounts: !req.freshAccounts,
-    freshAccounts: !!req.freshAccounts,
-    seed: Date.now() % 1_000_000,
-    createdAt: Date.now(),
-  };
+  return {};
 }
 
killedBy: config — buildRunConfig resolve workerCount + durationSec + seed
statusReason: expected undefined to be 4 // Object.is equality

[Killed] ArithmeticOperator
loadtest/config.ts:385:18
     rampRate: req.rampRate,
     rampMode: req.rampMode,
     durationMin: req.durationMin,
-    durationSec: req.durationMin * 60,
+    durationSec: req.durationMin / 60,
     profile: { ...DEFAULT_PROFILE, ...req.profile },
     gatewayUrl: normalizeUrl(req.gatewayUrl),
killedBy: config — buildRunConfig resolve workerCount + durationSec + seed
statusReason: expected 0.5 to be 1800 // Object.is equality

[Killed] MethodExpression
loadtest/config.ts:390:19
     gatewayUrl: normalizeUrl(req.gatewayUrl),
     workerCount: workers,
     socketsPerWorker,
-    registerRamp: Math.min(env.registerRamp, env.maxRegisterRamp),
+    registerRamp: Math.max(env.registerRamp, env.maxRegisterRamp),
     useExistingAccounts: !req.freshAccounts,
     freshAccounts: !!req.freshAccounts,
killedBy: config — buildRunConfig nhánh (T-11) registerRamp bị clamp theo maxRegisterRamp
statusReason: expected 9999 to be 100 // Object.is equality

[Killed] BooleanLiteral
loadtest/config.ts:391:26
     workerCount: workers,
     socketsPerWorker,
     registerRamp: Math.min(env.registerRamp, env.maxRegisterRamp),
-    useExistingAccounts: !req.freshAccounts,
+    useExistingAccounts: req.freshAccounts,
     freshAccounts: !!req.freshAccounts,
     seed: Date.now() % 1_000_000,
killedBy: config — buildRunConfig resolve workerCount + durationSec + seed
statusReason: expected undefined to be true // Object.is equality

[Killed] BooleanLiteral
loadtest/config.ts:392:21
     socketsPerWorker,
     registerRamp: Math.min(env.registerRamp, env.maxRegisterRamp),
     useExistingAccounts: !req.freshAccounts,
-    freshAccounts: !!req.freshAccounts,
+    freshAccounts: !req.freshAccounts,
     seed: Date.now() % 1_000_000,
     createdAt: Date.now(),
killedBy: config — buildRunConfig nhánh (T-11) freshAccounts=true → useExistingAccounts=false; ngược lại true
statusReason: expected false to be true // Object.is equality

[Survived] ArithmeticOperator
loadtest/config.ts:393:11
     registerRamp: Math.min(env.registerRamp, env.maxRegisterRamp),
     useExistingAccounts: !req.freshAccounts,
     freshAccounts: !!req.freshAccounts,
-    seed: Date.now() % 1_000_000,
+    seed: Date.now() * 1_000_000,
     createdAt: Date.now(),
   };

[Killed] BlockStatement
loadtest/config.ts:405:62
   updatedAt: number;
 }
 
-export function loadSettings(env: LoadTestEnv): SettingsFile {
-  try {
-    const p = path.join(env.dataDir, 'settings.json');
-    if (fs.existsSync(p)) {
-      return JSON.parse(fs.readFileSync(p, 'utf8')) as SettingsFile;
-    }
-  } catch {
-    // ignore
-  }
-  return { allowlist: [], updatedAt: 0 };
-}
+export function loadSettings(env: LoadTestEnv): SettingsFile {}
 
 export function saveSettings(env: LoadTestEnv, s: SettingsFile) {
killedBy: config — settings file allowlist (SD-1, T-11) saveSettings → loadSettings roundtrip
statusReason: Cannot read properties of undefined (reading 'allowlist')

[Killed] BlockStatement
loadtest/config.ts:406:7
 }
 
 export function loadSettings(env: LoadTestEnv): SettingsFile {
-  try {
-    const p = path.join(env.dataDir, 'settings.json');
-    if (fs.existsSync(p)) {
-      return JSON.parse(fs.readFileSync(p, 'utf8')) as SettingsFile;
-    }
-  } catch {
+  try {} catch {
     // ignore
   }
killedBy: config — settings file allowlist (SD-1, T-11) saveSettings → loadSettings roundtrip
statusReason: expected [] to deeply equal [ 'http://extra.example' ]

[Killed] StringLiteral
loadtest/config.ts:407:38
 
 export function loadSettings(env: LoadTestEnv): SettingsFile {
   try {
-    const p = path.join(env.dataDir, 'settings.json');
+    const p = path.join(env.dataDir, "");
     if (fs.existsSync(p)) {
       return JSON.parse(fs.readFileSync(p, 'utf8')) as SettingsFile;
killedBy: config — settings file allowlist (SD-1, T-11) saveSettings → loadSettings roundtrip
statusReason: expected [] to deeply equal [ 'http://extra.example' ]

[Killed] BlockStatement
loadtest/config.ts:408:27
 export function loadSettings(env: LoadTestEnv): SettingsFile {
   try {
     const p = path.join(env.dataDir, 'settings.json');
-    if (fs.existsSync(p)) {
-      return JSON.parse(fs.readFileSync(p, 'utf8')) as SettingsFile;
-    }
+    if (fs.existsSync(p)) {}
   } catch {
     // ignore
killedBy: config — settings file allowlist (SD-1, T-11) saveSettings → loadSettings roundtrip
statusReason: expected [] to deeply equal [ 'http://extra.example' ]

[Killed] ConditionalExpression
loadtest/config.ts:408:9
 export function loadSettings(env: LoadTestEnv): SettingsFile {
   try {
     const p = path.join(env.dataDir, 'settings.json');
-    if (fs.existsSync(p)) {
+    if (false) {
       return JSON.parse(fs.readFileSync(p, 'utf8')) as SettingsFile;
     }
killedBy: config — settings file allowlist (SD-1, T-11) saveSettings → loadSettings roundtrip
statusReason: expected [] to deeply equal [ 'http://extra.example' ]

[Killed] ObjectLiteral
loadtest/config.ts:414:10
   } catch {
     // ignore
   }
-  return { allowlist: [], updatedAt: 0 };
+  return {};
 }
 
killedBy: config — settings file allowlist (SD-1, T-11) file hỏng (không phải JSON) → default { allowlist: [], updatedAt: 0 }
statusReason: expected {} to deeply equal { allowlist: [], updatedAt: +0 }

[Killed] ArrayDeclaration
loadtest/config.ts:414:23
   } catch {
     // ignore
   }
-  return { allowlist: [], updatedAt: 0 };
+  return { allowlist: ["Stryker was here"], updatedAt: 0 };
 }
 
killedBy: config — settings file allowlist (SD-1, T-11) file hỏng (không phải JSON) → default { allowlist: [], updatedAt: 0 }
statusReason: expected { …(2) } to deeply equal { allowlist: [], updatedAt: +0 }

[Killed] BlockStatement
loadtest/config.ts:417:65
   return { allowlist: [], updatedAt: 0 };
 }
 
-export function saveSettings(env: LoadTestEnv, s: SettingsFile) {
-  fs.mkdirSync(env.dataDir, { recursive: true });
-  fs.writeFileSync(path.join(env.dataDir, 'settings.json'), JSON.stringify(s, null, 2), 'utf8');
-}
+export function saveSettings(env: LoadTestEnv, s: SettingsFile) {}
 
 /** Allowlist thực tế = env allowlist + allowlist từ settings file (Màn 6). */
killedBy: config — settings file allowlist (SD-1, T-11) saveSettings → loadSettings roundtrip
statusReason: expected [] to deeply equal [ 'http://extra.example' ]

[Killed] BooleanLiteral
loadtest/config.ts:418:42
 }
 
 export function saveSettings(env: LoadTestEnv, s: SettingsFile) {
-  fs.mkdirSync(env.dataDir, { recursive: true });
+  fs.mkdirSync(env.dataDir, { recursive: false });
   fs.writeFileSync(path.join(env.dataDir, 'settings.json'), JSON.stringify(s, null, 2), 'utf8');
 }
killedBy: config — settings file allowlist (SD-1, T-11) saveSettings → loadSettings roundtrip
statusReason: EEXIST: file already exists, mkdir 'C:\Users\Admin\AppData\Local\Temp\lt-settings-g74gUf'

[Killed] BlockStatement
loadtest/config.ts:423:61
 }
 
 /** Allowlist thực tế = env allowlist + allowlist từ settings file (Màn 6). */
-export function mergedAllowlist(env: LoadTestEnv): string[] {
-  const settings = loadSettings(env);
-  return [...new Set([...env.allowlist, ...settings.allowlist.map(normalizeUrl)])];
-}
+export function mergedAllowlist(env: LoadTestEnv): string[] {}
 
killedBy: config — settings file allowlist (SD-1, T-11) mergedAllowlist: env + settings, dedupe, normalize ws→http
statusReason: expected undefined to deeply equal [ 'http://localhost:3000', …(2) ]
