[Survived] StringLiteral
loadtest/coordinator-state.ts:21:50
 /** Chuyển phase hợp lệ. */
 const TRANSITIONS: Record<RunPhase, RunPhase[]> = {
   idle: ['provisioning'],
-  provisioning: ['ramping', 'cooldown', 'error', 'stopped'],
+  provisioning: ['ramping', 'cooldown', 'error', ""],
   ramping: ['steady', 'cooldown', 'error', 'stopped'],
   steady: ['cooldown', 'error', 'stopped'],

[Killed] ArrayDeclaration
loadtest/coordinator-state.ts:22:12
 const TRANSITIONS: Record<RunPhase, RunPhase[]> = {
   idle: ['provisioning'],
   provisioning: ['ramping', 'cooldown', 'error', 'stopped'],
-  ramping: ['steady', 'cooldown', 'error', 'stopped'],
+  ramping: [],
   steady: ['cooldown', 'error', 'stopped'],
   cooldown: ['report', 'error', 'stopped'],
killedBy: coordinator-state — state machine cho phép transition hợp lệ
statusReason: expected false to be true // Object.is equality

[Killed] StringLiteral
loadtest/coordinator-state.ts:22:13
 const TRANSITIONS: Record<RunPhase, RunPhase[]> = {
   idle: ['provisioning'],
   provisioning: ['ramping', 'cooldown', 'error', 'stopped'],
-  ramping: ['steady', 'cooldown', 'error', 'stopped'],
+  ramping: ["", 'cooldown', 'error', 'stopped'],
   steady: ['cooldown', 'error', 'stopped'],
   cooldown: ['report', 'error', 'stopped'],
killedBy: coordinator-state — state machine cho phép transition hợp lệ
statusReason: expected false to be true // Object.is equality

[Killed] StringLiteral
loadtest/coordinator-state.ts:23:12
   idle: ['provisioning'],
   provisioning: ['ramping', 'cooldown', 'error', 'stopped'],
   ramping: ['steady', 'cooldown', 'error', 'stopped'],
-  steady: ['cooldown', 'error', 'stopped'],
+  steady: ["", 'error', 'stopped'],
   cooldown: ['report', 'error', 'stopped'],
   report: ['finished', 'stopped'],
killedBy: coordinator-state — state machine cho phép transition hợp lệ
statusReason: expected false to be true // Object.is equality

[Survived] StringLiteral
loadtest/coordinator-state.ts:23:24
   idle: ['provisioning'],
   provisioning: ['ramping', 'cooldown', 'error', 'stopped'],
   ramping: ['steady', 'cooldown', 'error', 'stopped'],
-  steady: ['cooldown', 'error', 'stopped'],
+  steady: ['cooldown', "", 'stopped'],
   cooldown: ['report', 'error', 'stopped'],
   report: ['finished', 'stopped'],

[Killed] StringLiteral
loadtest/coordinator-state.ts:24:14
   provisioning: ['ramping', 'cooldown', 'error', 'stopped'],
   ramping: ['steady', 'cooldown', 'error', 'stopped'],
   steady: ['cooldown', 'error', 'stopped'],
-  cooldown: ['report', 'error', 'stopped'],
+  cooldown: ["", 'error', 'stopped'],
   report: ['finished', 'stopped'],
   finished: [],
killedBy: coordinator-state — state machine cho phép transition hợp lệ
statusReason: expected false to be true // Object.is equality

[Survived] StringLiteral
loadtest/coordinator-state.ts:24:24
   provisioning: ['ramping', 'cooldown', 'error', 'stopped'],
   ramping: ['steady', 'cooldown', 'error', 'stopped'],
   steady: ['cooldown', 'error', 'stopped'],
-  cooldown: ['report', 'error', 'stopped'],
+  cooldown: ['report', "", 'stopped'],
   report: ['finished', 'stopped'],
   finished: [],

[Killed] StringLiteral
loadtest/coordinator-state.ts:25:12
   ramping: ['steady', 'cooldown', 'error', 'stopped'],
   steady: ['cooldown', 'error', 'stopped'],
   cooldown: ['report', 'error', 'stopped'],
-  report: ['finished', 'stopped'],
+  report: ["", 'stopped'],
   finished: [],
   stopped: [],
killedBy: coordinator-state — state machine cho phép transition hợp lệ
statusReason: expected false to be true // Object.is equality

[Survived] StringLiteral
loadtest/coordinator-state.ts:25:24
   ramping: ['steady', 'cooldown', 'error', 'stopped'],
   steady: ['cooldown', 'error', 'stopped'],
   cooldown: ['report', 'error', 'stopped'],
-  report: ['finished', 'stopped'],
+  report: ['finished', ""],
   finished: [],
   stopped: [],

[Killed] BlockStatement
loadtest/coordinator-state.ts:31:70
   error: [],
 };
 
-export function canTransition(from: RunPhase, to: RunPhase): boolean {
-  return TRANSITIONS[from]?.includes(to) ?? false;
-}
+export function canTransition(from: RunPhase, to: RunPhase): boolean {}
 
 export function transition(from: RunPhase, to: RunPhase): RunPhase {
killedBy: coordinator-state — state machine cho phép transition hợp lệ
statusReason: expected undefined to be true // Object.is equality

[Killed] LogicalOperator
loadtest/coordinator-state.ts:32:10
 };
 
 export function canTransition(from: RunPhase, to: RunPhase): boolean {
-  return TRANSITIONS[from]?.includes(to) ?? false;
+  return TRANSITIONS[from]?.includes(to) && false;
 }
 
killedBy: coordinator-state — state machine cho phép transition hợp lệ
statusReason: expected false to be true // Object.is equality

[NoCoverage] BooleanLiteral
loadtest/coordinator-state.ts:32:45
 };
 
 export function canTransition(from: RunPhase, to: RunPhase): boolean {
-  return TRANSITIONS[from]?.includes(to) ?? false;
+  return TRANSITIONS[from]?.includes(to) ?? true;
 }
 

[Killed] BlockStatement
loadtest/coordinator-state.ts:35:68
   return TRANSITIONS[from]?.includes(to) ?? false;
 }
 
-export function transition(from: RunPhase, to: RunPhase): RunPhase {
-  if (!canTransition(from, to)) {
-    throw new Error(`Bất hợp lệ: phase ${from} → ${to}`);
-  }
-  return to;
-}
+export function transition(from: RunPhase, to: RunPhase): RunPhase {}
 
 /**
killedBy: coordinator-state — state machine chặn transition bất hợp lệ
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
loadtest/coordinator-state.ts:36:7
 }
 
 export function transition(from: RunPhase, to: RunPhase): RunPhase {
-  if (!canTransition(from, to)) {
+  if (false) {
     throw new Error(`Bất hợp lệ: phase ${from} → ${to}`);
   }
killedBy: coordinator-state — state machine chặn transition bất hợp lệ
statusReason: expected [Function] to throw an error

[Killed] BooleanLiteral
loadtest/coordinator-state.ts:36:7
 }
 
 export function transition(from: RunPhase, to: RunPhase): RunPhase {
-  if (!canTransition(from, to)) {
+  if (canTransition(from, to)) {
     throw new Error(`Bất hợp lệ: phase ${from} → ${to}`);
   }
killedBy: coordinator-state — state machine chặn transition bất hợp lệ
statusReason: expected [Function] to throw an error

[Survived] StringLiteral
loadtest/coordinator-state.ts:37:21
 
 export function transition(from: RunPhase, to: RunPhase): RunPhase {
   if (!canTransition(from, to)) {
-    throw new Error(`Bất hợp lệ: phase ${from} → ${to}`);
+    throw new Error(``);
   }
   return to;

[Killed] BlockStatement
loadtest/coordinator-state.ts:56:68
   connectTotal: number; // tổng đã thử connect
 }
 
-export function decideAutoStop(input: AutoStopInput): StopDecision {
-  if (input.registerFailRate > 50 && input.registeredTotal >= 10) {
-    return { stop: true, reason: `auto-stop: register fail ${input.registerFailRate.toFixed(0)}% > 50% (E1)` };
-  }
-  if (input.connectFailRate > 30 && input.connectTotal >= 10) {
-    return { stop: true, reason: `auto-stop: connect fail ${input.connectFailRate.toFixed(0)}% > 30% (E2)` };
-  }
-  return { stop: false };
-}
+export function decideAutoStop(input: AutoStopInput): StopDecision {}
 
 /** Pha cuối dựa trên cách run kết thúc: natural → finished, auto lỗi → error, manual → stopped. */
killedBy: coordinator-state — auto-stop dừng khi register fail > 50% và đủ sample (E1)
statusReason: Cannot read properties of undefined (reading 'stop')

[Killed] BlockStatement
loadtest/coordinator-state.ts:57:67
 }
 
 export function decideAutoStop(input: AutoStopInput): StopDecision {
-  if (input.registerFailRate > 50 && input.registeredTotal >= 10) {
-    return { stop: true, reason: `auto-stop: register fail ${input.registerFailRate.toFixed(0)}% > 50% (E1)` };
-  }
+  if (input.registerFailRate > 50 && input.registeredTotal >= 10) {}
   if (input.connectFailRate > 30 && input.connectTotal >= 10) {
     return { stop: true, reason: `auto-stop: connect fail ${input.connectFailRate.toFixed(0)}% > 30% (E2)` };
killedBy: coordinator-state — auto-stop dừng khi register fail > 50% và đủ sample (E1)
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
loadtest/coordinator-state.ts:57:38
 }
 
 export function decideAutoStop(input: AutoStopInput): StopDecision {
-  if (input.registerFailRate > 50 && input.registeredTotal >= 10) {
+  if (input.registerFailRate > 50 && input.registeredTotal < 10) {
     return { stop: true, reason: `auto-stop: register fail ${input.registerFailRate.toFixed(0)}% > 50% (E1)` };
   }
killedBy: coordinator-state — auto-stop dừng khi register fail > 50% và đủ sample (E1)
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
loadtest/coordinator-state.ts:58:20
 
 export function decideAutoStop(input: AutoStopInput): StopDecision {
   if (input.registerFailRate > 50 && input.registeredTotal >= 10) {
-    return { stop: true, reason: `auto-stop: register fail ${input.registerFailRate.toFixed(0)}% > 50% (E1)` };
+    return { stop: false, reason: `auto-stop: register fail ${input.registerFailRate.toFixed(0)}% > 50% (E1)` };
   }
   if (input.connectFailRate > 30 && input.connectTotal >= 10) {
killedBy: coordinator-state — auto-stop dừng khi register fail > 50% và đủ sample (E1)
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
loadtest/coordinator-state.ts:60:37
   if (input.registerFailRate > 50 && input.registeredTotal >= 10) {
     return { stop: true, reason: `auto-stop: register fail ${input.registerFailRate.toFixed(0)}% > 50% (E1)` };
   }
-  if (input.connectFailRate > 30 && input.connectTotal >= 10) {
+  if (input.connectFailRate > 30 && input.connectTotal > 10) {
     return { stop: true, reason: `auto-stop: connect fail ${input.connectFailRate.toFixed(0)}% > 30% (E2)` };
   }
killedBy: coordinator-state — biên auto-stop (E1/E2) E2: 30.1% + 10 connect → dừng với reason chính xác; 30% + 9 connect → không dừng
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
loadtest/coordinator-state.ts:60:7
   if (input.registerFailRate > 50 && input.registeredTotal >= 10) {
     return { stop: true, reason: `auto-stop: register fail ${input.registerFailRate.toFixed(0)}% > 50% (E1)` };
   }
-  if (input.connectFailRate > 30 && input.connectTotal >= 10) {
+  if (false) {
     return { stop: true, reason: `auto-stop: connect fail ${input.connectFailRate.toFixed(0)}% > 30% (E2)` };
   }
killedBy: coordinator-state — auto-stop dừng khi connect fail > 30% (E2)
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
loadtest/coordinator-state.ts:61:20
     return { stop: true, reason: `auto-stop: register fail ${input.registerFailRate.toFixed(0)}% > 50% (E1)` };
   }
   if (input.connectFailRate > 30 && input.connectTotal >= 10) {
-    return { stop: true, reason: `auto-stop: connect fail ${input.connectFailRate.toFixed(0)}% > 30% (E2)` };
+    return { stop: false, reason: `auto-stop: connect fail ${input.connectFailRate.toFixed(0)}% > 30% (E2)` };
   }
   return { stop: false };
killedBy: coordinator-state — auto-stop dừng khi connect fail > 30% (E2)
statusReason: expected false to be true // Object.is equality

[Killed] StringLiteral
loadtest/coordinator-state.ts:61:34
     return { stop: true, reason: `auto-stop: register fail ${input.registerFailRate.toFixed(0)}% > 50% (E1)` };
   }
   if (input.connectFailRate > 30 && input.connectTotal >= 10) {
-    return { stop: true, reason: `auto-stop: connect fail ${input.connectFailRate.toFixed(0)}% > 30% (E2)` };
+    return { stop: true, reason: `` };
   }
   return { stop: false };
killedBy: coordinator-state — auto-stop dừng khi connect fail > 30% (E2)
statusReason: expected '' to contain 'E2'

[Killed] BooleanLiteral
loadtest/coordinator-state.ts:63:18
   if (input.connectFailRate > 30 && input.connectTotal >= 10) {
     return { stop: true, reason: `auto-stop: connect fail ${input.connectFailRate.toFixed(0)}% > 30% (E2)` };
   }
-  return { stop: false };
+  return { stop: true };
 }
 
killedBy: coordinator-state — auto-stop không dừng khi sample quá ít
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
loadtest/coordinator-state.ts:70:45
 export function endPhaseFromStop(
   kind: 'natural' | 'auto' | 'manual',
   reason?: string,
-): { phase: RunPhase; stopReason?: string } {
-  if (kind === 'natural') return { phase: 'finished', stopReason: reason };
-  if (kind === 'manual') return { phase: 'stopped', stopReason: reason ?? 'run bị dừng thủ công (kill-switch)' };
-  return { phase: 'error', stopReason: reason ?? 'run tự dừng do lỗi' };
-}
+): { phase: RunPhase; stopReason?: string } {}
 
 /** Gộp N worker tick → LoadTestTick 1s (DB-1 aggregation). */
killedBy: coordinator-state — state machine endPhaseFromStop: natural → finished, auto → error, manual → stopped
statusReason: Cannot read properties of undefined (reading 'phase')

[Killed] ConditionalExpression
loadtest/coordinator-state.ts:71:7
   kind: 'natural' | 'auto' | 'manual',
   reason?: string,
 ): { phase: RunPhase; stopReason?: string } {
-  if (kind === 'natural') return { phase: 'finished', stopReason: reason };
+  if (true) return { phase: 'finished', stopReason: reason };
   if (kind === 'manual') return { phase: 'stopped', stopReason: reason ?? 'run bị dừng thủ công (kill-switch)' };
   return { phase: 'error', stopReason: reason ?? 'run tự dừng do lỗi' };
killedBy: coordinator-state — state machine endPhaseFromStop: natural → finished, auto → error, manual → stopped
statusReason: expected 'finished' to be 'error' // Object.is equality

[Killed] ConditionalExpression
loadtest/coordinator-state.ts:71:7
   kind: 'natural' | 'auto' | 'manual',
   reason?: string,
 ): { phase: RunPhase; stopReason?: string } {
-  if (kind === 'natural') return { phase: 'finished', stopReason: reason };
+  if (false) return { phase: 'finished', stopReason: reason };
   if (kind === 'manual') return { phase: 'stopped', stopReason: reason ?? 'run bị dừng thủ công (kill-switch)' };
   return { phase: 'error', stopReason: reason ?? 'run tự dừng do lỗi' };
killedBy: coordinator-state — state machine endPhaseFromStop: natural → finished, auto → error, manual → stopped
statusReason: expected 'error' to be 'finished' // Object.is equality

[Killed] LogicalOperator
loadtest/coordinator-state.ts:72:65
   reason?: string,
 ): { phase: RunPhase; stopReason?: string } {
   if (kind === 'natural') return { phase: 'finished', stopReason: reason };
-  if (kind === 'manual') return { phase: 'stopped', stopReason: reason ?? 'run bị dừng thủ công (kill-switch)' };
+  if (kind === 'manual') return { phase: 'stopped', stopReason: reason && 'run bị dừng thủ công (kill-switch)' };
   return { phase: 'error', stopReason: reason ?? 'run tự dừng do lỗi' };
 }
killedBy: coordinator-state — endPhaseFromStop reason mặc định (template chính xác) manual không reason → default stopReason
statusReason: expected undefined to be 'run bị dừng thủ công (kill-switch)' // Object.is equality

[Killed] ConditionalExpression
loadtest/coordinator-state.ts:72:7
   reason?: string,
 ): { phase: RunPhase; stopReason?: string } {
   if (kind === 'natural') return { phase: 'finished', stopReason: reason };
-  if (kind === 'manual') return { phase: 'stopped', stopReason: reason ?? 'run bị dừng thủ công (kill-switch)' };
+  if (false) return { phase: 'stopped', stopReason: reason ?? 'run bị dừng thủ công (kill-switch)' };
   return { phase: 'error', stopReason: reason ?? 'run tự dừng do lỗi' };
 }
killedBy: coordinator-state — state machine endPhaseFromStop: natural → finished, auto → error, manual → stopped
statusReason: expected 'error' to be 'stopped' // Object.is equality

[Killed] LogicalOperator
loadtest/coordinator-state.ts:73:40
 ): { phase: RunPhase; stopReason?: string } {
   if (kind === 'natural') return { phase: 'finished', stopReason: reason };
   if (kind === 'manual') return { phase: 'stopped', stopReason: reason ?? 'run bị dừng thủ công (kill-switch)' };
-  return { phase: 'error', stopReason: reason ?? 'run tự dừng do lỗi' };
+  return { phase: 'error', stopReason: reason && 'run tự dừng do lỗi' };
 }
 
killedBy: coordinator-state — state machine endPhaseFromStop: natural → finished, auto → error, manual → stopped
statusReason: expected 'run tự dừng do lỗi' to be 'E1' // Object.is equality

[Killed] StringLiteral
loadtest/coordinator-state.ts:73:50
 ): { phase: RunPhase; stopReason?: string } {
   if (kind === 'natural') return { phase: 'finished', stopReason: reason };
   if (kind === 'manual') return { phase: 'stopped', stopReason: reason ?? 'run bị dừng thủ công (kill-switch)' };
-  return { phase: 'error', stopReason: reason ?? 'run tự dừng do lỗi' };
+  return { phase: 'error', stopReason: reason ?? "" };
 }
 
killedBy: coordinator-state — endPhaseFromStop reason mặc định (template chính xác) auto không reason → default error
statusReason: expected '' to be 'run tự dừng do lỗi' // Object.is equality

[Survived] AssignmentOperator
loadtest/coordinator-state.ts:105:5
   let errorSamples: ErrorSample[] = [];
 
   for (const t of ticks) {
-    C.usersCreated += t.counters.usersCreated;
+    C.usersCreated -= t.counters.usersCreated;
     C.usersConnected += t.counters.usersConnected;
     C.usersActive += t.counters.usersActive;

[Killed] AssignmentOperator
loadtest/coordinator-state.ts:106:5
 
   for (const t of ticks) {
     C.usersCreated += t.counters.usersCreated;
-    C.usersConnected += t.counters.usersConnected;
+    C.usersConnected -= t.counters.usersConnected;
     C.usersActive += t.counters.usersActive;
     C.usersQueued += t.counters.usersQueued;
killedBy: coordinator-state — aggregateTicks gộp counters + histogram từ nhiều worker
statusReason: expected -150 to be 150 // Object.is equality

[Survived] AssignmentOperator
loadtest/coordinator-state.ts:107:5
   for (const t of ticks) {
     C.usersCreated += t.counters.usersCreated;
     C.usersConnected += t.counters.usersConnected;
-    C.usersActive += t.counters.usersActive;
+    C.usersActive -= t.counters.usersActive;
     C.usersQueued += t.counters.usersQueued;
     C.usersInRoom += t.counters.usersInRoom;

[Survived] AssignmentOperator
loadtest/coordinator-state.ts:108:5
     C.usersCreated += t.counters.usersCreated;
     C.usersConnected += t.counters.usersConnected;
     C.usersActive += t.counters.usersActive;
-    C.usersQueued += t.counters.usersQueued;
+    C.usersQueued -= t.counters.usersQueued;
     C.usersInRoom += t.counters.usersInRoom;
     C.actionsTotal += t.counters.actionsTotal;

[Killed] AssignmentOperator
loadtest/coordinator-state.ts:109:5
     C.usersConnected += t.counters.usersConnected;
     C.usersActive += t.counters.usersActive;
     C.usersQueued += t.counters.usersQueued;
-    C.usersInRoom += t.counters.usersInRoom;
+    C.usersInRoom -= t.counters.usersInRoom;
     C.actionsTotal += t.counters.actionsTotal;
     C.successTotal += t.counters.successTotal;
killedBy: coordinator-state — aggregateTicks gộp counters + histogram từ nhiều worker
statusReason: expected -20 to be 20 // Object.is equality

[Killed] AssignmentOperator
loadtest/coordinator-state.ts:110:5
     C.usersActive += t.counters.usersActive;
     C.usersQueued += t.counters.usersQueued;
     C.usersInRoom += t.counters.usersInRoom;
-    C.actionsTotal += t.counters.actionsTotal;
+    C.actionsTotal -= t.counters.actionsTotal;
     C.successTotal += t.counters.successTotal;
     C.failTotal += t.counters.failTotal;
killedBy: coordinator-state — aggregateTicks gộp counters + histogram từ nhiều worker
statusReason: expected -3000 to be 3000 // Object.is equality

[Killed] AssignmentOperator
loadtest/coordinator-state.ts:111:5
     C.usersQueued += t.counters.usersQueued;
     C.usersInRoom += t.counters.usersInRoom;
     C.actionsTotal += t.counters.actionsTotal;
-    C.successTotal += t.counters.successTotal;
+    C.successTotal -= t.counters.successTotal;
     C.failTotal += t.counters.failTotal;
     C.echoOk += t.counters.echoOk;
killedBy: coordinator-state — aggregateTicks gộp counters + histogram từ nhiều worker
statusReason: expected 100 to be close to 96.7, received difference is 3.299999999999997, but expected 0.05

[Killed] AssignmentOperator
loadtest/coordinator-state.ts:112:5
     C.usersInRoom += t.counters.usersInRoom;
     C.actionsTotal += t.counters.actionsTotal;
     C.successTotal += t.counters.successTotal;
-    C.failTotal += t.counters.failTotal;
+    C.failTotal -= t.counters.failTotal;
     C.echoOk += t.counters.echoOk;
     C.echoSent += t.counters.echoSent;
killedBy: coordinator-state — aggregateTicks gộp counters + histogram từ nhiều worker
statusReason: expected 103.6 to be close to 96.7, received difference is 6.8999999999999915, but expected 0.05

[Survived] AssignmentOperator
loadtest/coordinator-state.ts:113:5
     C.actionsTotal += t.counters.actionsTotal;
     C.successTotal += t.counters.successTotal;
     C.failTotal += t.counters.failTotal;
-    C.echoOk += t.counters.echoOk;
+    C.echoOk -= t.counters.echoOk;
     C.echoSent += t.counters.echoSent;
     C.droppedOutbox += t.counters.droppedOutbox;

[Survived] AssignmentOperator
loadtest/coordinator-state.ts:114:5
     C.successTotal += t.counters.successTotal;
     C.failTotal += t.counters.failTotal;
     C.echoOk += t.counters.echoOk;
-    C.echoSent += t.counters.echoSent;
+    C.echoSent -= t.counters.echoSent;
     C.droppedOutbox += t.counters.droppedOutbox;
     C.reconnectCount += t.counters.reconnectCount;

[Survived] AssignmentOperator
loadtest/coordinator-state.ts:115:5
     C.failTotal += t.counters.failTotal;
     C.echoOk += t.counters.echoOk;
     C.echoSent += t.counters.echoSent;
-    C.droppedOutbox += t.counters.droppedOutbox;
+    C.droppedOutbox -= t.counters.droppedOutbox;
     C.reconnectCount += t.counters.reconnectCount;
     C.rateLimitedNoEcho += t.counters.rateLimitedNoEcho;

[Survived] AssignmentOperator
loadtest/coordinator-state.ts:116:5
     C.echoOk += t.counters.echoOk;
     C.echoSent += t.counters.echoSent;
     C.droppedOutbox += t.counters.droppedOutbox;
-    C.reconnectCount += t.counters.reconnectCount;
+    C.reconnectCount -= t.counters.reconnectCount;
     C.rateLimitedNoEcho += t.counters.rateLimitedNoEcho;
 

[Survived] AssignmentOperator
loadtest/coordinator-state.ts:117:5
     C.echoSent += t.counters.echoSent;
     C.droppedOutbox += t.counters.droppedOutbox;
     C.reconnectCount += t.counters.reconnectCount;
-    C.rateLimitedNoEcho += t.counters.rateLimitedNoEcho;
+    C.rateLimitedNoEcho -= t.counters.rateLimitedNoEcho;
 
     for (const action of ACTION_TYPES) {

[Killed] BlockStatement
loadtest/coordinator-state.ts:119:40
     C.reconnectCount += t.counters.reconnectCount;
     C.rateLimitedNoEcho += t.counters.rateLimitedNoEcho;
 
-    for (const action of ACTION_TYPES) {
-      const v = t.actionsPerSec[action];
-      if (v) actionsPerSec[action] = (actionsPerSec[action] ?? 0) + v;
-    }
+    for (const action of ACTION_TYPES) {}
     for (const action of ACTION_TYPES) {
       const ok = t.actionOk?.[action];
killedBy: coordinator-state — aggregateTicks gộp counters + histogram từ nhiều worker
statusReason: expected undefined to be 20 // Object.is equality

[Killed] ConditionalExpression
loadtest/coordinator-state.ts:121:11
 
     for (const action of ACTION_TYPES) {
       const v = t.actionsPerSec[action];
-      if (v) actionsPerSec[action] = (actionsPerSec[action] ?? 0) + v;
+      if (false) actionsPerSec[action] = (actionsPerSec[action] ?? 0) + v;
     }
     for (const action of ACTION_TYPES) {
killedBy: coordinator-state — aggregateTicks gộp counters + histogram từ nhiều worker
statusReason: expected undefined to be 20 // Object.is equality

[Killed] LogicalOperator
loadtest/coordinator-state.ts:121:39
 
     for (const action of ACTION_TYPES) {
       const v = t.actionsPerSec[action];
-      if (v) actionsPerSec[action] = (actionsPerSec[action] ?? 0) + v;
+      if (v) actionsPerSec[action] = (actionsPerSec[action] && 0) + v;
     }
     for (const action of ACTION_TYPES) {
killedBy: coordinator-state — aggregateTicks gộp counters + histogram từ nhiều worker
statusReason: expected NaN to be 20 // Object.is equality

[Killed] BlockStatement
loadtest/coordinator-state.ts:123:40
       const v = t.actionsPerSec[action];
       if (v) actionsPerSec[action] = (actionsPerSec[action] ?? 0) + v;
     }
-    for (const action of ACTION_TYPES) {
-      const ok = t.actionOk?.[action];
-      if (ok) actionOk[action] = (actionOk[action] ?? 0) + ok;
-      const fail = t.actionFail?.[action];
-      if (fail) actionFail[action] = (actionFail[action] ?? 0) + fail;
-    }
+    for (const action of ACTION_TYPES) {}
     for (const [code, count] of Object.entries(t.errors)) errors[code] = (errors[code] ?? 0) + count;
     if (t.histograms) {
killedBy: coordinator-state — aggregateTicks gộp counters + histogram từ nhiều worker
statusReason: expected undefined to be 18 // Object.is equality

[Killed] OptionalChaining
loadtest/coordinator-state.ts:124:18
       if (v) actionsPerSec[action] = (actionsPerSec[action] ?? 0) + v;
     }
     for (const action of ACTION_TYPES) {
-      const ok = t.actionOk?.[action];
+      const ok = t.actionOk[action];
       if (ok) actionOk[action] = (actionOk[action] ?? 0) + ok;
       const fail = t.actionFail?.[action];
killedBy: coordinator-state — aggregateTicks nhánh sâu (T-11) actionOk/actionFail khi worker KHÔNG có field (undefined) → không crash
statusReason: Cannot read properties of undefined (reading 'chat')

[Killed] ConditionalExpression
loadtest/coordinator-state.ts:125:11
     }
     for (const action of ACTION_TYPES) {
       const ok = t.actionOk?.[action];
-      if (ok) actionOk[action] = (actionOk[action] ?? 0) + ok;
+      if (true) actionOk[action] = (actionOk[action] ?? 0) + ok;
       const fail = t.actionFail?.[action];
       if (fail) actionFail[action] = (actionFail[action] ?? 0) + fail;
killedBy: coordinator-state — aggregateTicks nhánh sâu (T-11) actionOk/actionFail khi worker KHÔNG có field (undefined) → không crash
statusReason: expected NaN to be undefined

[Killed] LogicalOperator
loadtest/coordinator-state.ts:125:35
     }
     for (const action of ACTION_TYPES) {
       const ok = t.actionOk?.[action];
-      if (ok) actionOk[action] = (actionOk[action] ?? 0) + ok;
+      if (ok) actionOk[action] = (actionOk[action] && 0) + ok;
       const fail = t.actionFail?.[action];
       if (fail) actionFail[action] = (actionFail[action] ?? 0) + fail;
killedBy: coordinator-state — aggregateTicks gộp counters + histogram từ nhiều worker
statusReason: expected NaN to be 18 // Object.is equality

[Killed] OptionalChaining
loadtest/coordinator-state.ts:126:20
     for (const action of ACTION_TYPES) {
       const ok = t.actionOk?.[action];
       if (ok) actionOk[action] = (actionOk[action] ?? 0) + ok;
-      const fail = t.actionFail?.[action];
+      const fail = t.actionFail[action];
       if (fail) actionFail[action] = (actionFail[action] ?? 0) + fail;
     }
killedBy: coordinator-state — aggregateTicks nhánh sâu (T-11) actionOk/actionFail khi worker KHÔNG có field (undefined) → không crash
statusReason: Cannot read properties of undefined (reading 'chat')

[Killed] ConditionalExpression
loadtest/coordinator-state.ts:127:11
       const ok = t.actionOk?.[action];
       if (ok) actionOk[action] = (actionOk[action] ?? 0) + ok;
       const fail = t.actionFail?.[action];
-      if (fail) actionFail[action] = (actionFail[action] ?? 0) + fail;
+      if (false) actionFail[action] = (actionFail[action] ?? 0) + fail;
     }
     for (const [code, count] of Object.entries(t.errors)) errors[code] = (errors[code] ?? 0) + count;
killedBy: coordinator-state — aggregateTicks gộp counters + histogram từ nhiều worker
statusReason: expected undefined to be 2 // Object.is equality

[Killed] ArithmeticOperator
loadtest/coordinator-state.ts:127:38
       const ok = t.actionOk?.[action];
       if (ok) actionOk[action] = (actionOk[action] ?? 0) + ok;
       const fail = t.actionFail?.[action];
-      if (fail) actionFail[action] = (actionFail[action] ?? 0) + fail;
+      if (fail) actionFail[action] = (actionFail[action] ?? 0) - fail;
     }
     for (const [code, count] of Object.entries(t.errors)) errors[code] = (errors[code] ?? 0) + count;
killedBy: coordinator-state — aggregateTicks gộp counters + histogram từ nhiều worker
statusReason: expected -2 to be 2 // Object.is equality

[Killed] LogicalOperator
loadtest/coordinator-state.ts:129:75
       const fail = t.actionFail?.[action];
       if (fail) actionFail[action] = (actionFail[action] ?? 0) + fail;
     }
-    for (const [code, count] of Object.entries(t.errors)) errors[code] = (errors[code] ?? 0) + count;
+    for (const [code, count] of Object.entries(t.errors)) errors[code] = (errors[code] && 0) + count;
     if (t.histograms) {
       for (const [action, buckets] of Object.entries(t.histograms)) {
killedBy: coordinator-state — aggregateTicks gộp counters + histogram từ nhiều worker
statusReason: expected NaN to be 6 // Object.is equality

[Killed] ArithmeticOperator
loadtest/coordinator-state.ts:129:74
       const fail = t.actionFail?.[action];
       if (fail) actionFail[action] = (actionFail[action] ?? 0) + fail;
     }
-    for (const [code, count] of Object.entries(t.errors)) errors[code] = (errors[code] ?? 0) + count;
+    for (const [code, count] of Object.entries(t.errors)) errors[code] = (errors[code] ?? 0) - count;
     if (t.histograms) {
       for (const [action, buckets] of Object.entries(t.histograms)) {
killedBy: coordinator-state — aggregateTicks gộp counters + histogram từ nhiều worker
statusReason: expected -6 to be 6 // Object.is equality
