[Killed] ConditionalExpression
loadtest/coordinator-state.ts:130:9
       if (fail) actionFail[action] = (actionFail[action] ?? 0) + fail;
     }
     for (const [code, count] of Object.entries(t.errors)) errors[code] = (errors[code] ?? 0) + count;
-    if (t.histograms) {
+    if (false) {
       for (const [action, buckets] of Object.entries(t.histograms)) {
         const target = (histograms[action] ??= new Array(t.histogramBucketCount || 0).fill(0));
killedBy: coordinator-state — aggregateTicks gộp counters + histogram từ nhiều worker
statusReason: expected undefined to deeply equal [ 10, 20, +0 ]

[Killed] BlockStatement
loadtest/coordinator-state.ts:130:23
       if (fail) actionFail[action] = (actionFail[action] ?? 0) + fail;
     }
     for (const [code, count] of Object.entries(t.errors)) errors[code] = (errors[code] ?? 0) + count;
-    if (t.histograms) {
-      for (const [action, buckets] of Object.entries(t.histograms)) {
-        const target = (histograms[action] ??= new Array(t.histogramBucketCount || 0).fill(0));
-        for (let i = 0; i < Math.min(buckets.length, target.length); i++) target[i] += buckets[i];
-      }
-      histBucketCount = Math.max(histBucketCount, t.histogramBucketCount);
-    }
+    if (t.histograms) {}
     if (t.cpuPct > 0) {
       cpuSum += t.cpuPct;
killedBy: coordinator-state — aggregateTicks gộp counters + histogram từ nhiều worker
statusReason: expected undefined to deeply equal [ 10, 20, +0 ]

[Killed] BlockStatement
loadtest/coordinator-state.ts:131:69
     }
     for (const [code, count] of Object.entries(t.errors)) errors[code] = (errors[code] ?? 0) + count;
     if (t.histograms) {
-      for (const [action, buckets] of Object.entries(t.histograms)) {
-        const target = (histograms[action] ??= new Array(t.histogramBucketCount || 0).fill(0));
-        for (let i = 0; i < Math.min(buckets.length, target.length); i++) target[i] += buckets[i];
-      }
+      for (const [action, buckets] of Object.entries(t.histograms)) {}
       histBucketCount = Math.max(histBucketCount, t.histogramBucketCount);
     }
killedBy: coordinator-state — aggregateTicks gộp counters + histogram từ nhiều worker
statusReason: expected undefined to deeply equal [ 10, 20, +0 ]

[Killed] LogicalOperator
loadtest/coordinator-state.ts:132:58
     for (const [code, count] of Object.entries(t.errors)) errors[code] = (errors[code] ?? 0) + count;
     if (t.histograms) {
       for (const [action, buckets] of Object.entries(t.histograms)) {
-        const target = (histograms[action] ??= new Array(t.histogramBucketCount || 0).fill(0));
+        const target = (histograms[action] ??= new Array(t.histogramBucketCount && 0).fill(0));
         for (let i = 0; i < Math.min(buckets.length, target.length); i++) target[i] += buckets[i];
       }
killedBy: coordinator-state — aggregateTicks gộp counters + histogram từ nhiều worker
statusReason: expected [] to deeply equal [ 10, 20, +0 ]

[Killed] AssignmentOperator
loadtest/coordinator-state.ts:132:25
     for (const [code, count] of Object.entries(t.errors)) errors[code] = (errors[code] ?? 0) + count;
     if (t.histograms) {
       for (const [action, buckets] of Object.entries(t.histograms)) {
-        const target = (histograms[action] ??= new Array(t.histogramBucketCount || 0).fill(0));
+        const target = (histograms[action] &&= new Array(t.histogramBucketCount || 0).fill(0));
         for (let i = 0; i < Math.min(buckets.length, target.length); i++) target[i] += buckets[i];
       }
killedBy: coordinator-state — aggregateTicks gộp counters + histogram từ nhiều worker
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] ConditionalExpression
loadtest/coordinator-state.ts:133:25
     if (t.histograms) {
       for (const [action, buckets] of Object.entries(t.histograms)) {
         const target = (histograms[action] ??= new Array(t.histogramBucketCount || 0).fill(0));
-        for (let i = 0; i < Math.min(buckets.length, target.length); i++) target[i] += buckets[i];
+        for (let i = 0; false; i++) target[i] += buckets[i];
       }
       histBucketCount = Math.max(histBucketCount, t.histogramBucketCount);
killedBy: coordinator-state — aggregateTicks gộp counters + histogram từ nhiều worker
statusReason: expected [ +0, +0, +0 ] to deeply equal [ 10, 20, +0 ]

[Killed] EqualityOperator
loadtest/coordinator-state.ts:133:25
     if (t.histograms) {
       for (const [action, buckets] of Object.entries(t.histograms)) {
         const target = (histograms[action] ??= new Array(t.histogramBucketCount || 0).fill(0));
-        for (let i = 0; i < Math.min(buckets.length, target.length); i++) target[i] += buckets[i];
+        for (let i = 0; i <= Math.min(buckets.length, target.length); i++) target[i] += buckets[i];
       }
       histBucketCount = Math.max(histBucketCount, t.histogramBucketCount);
killedBy: coordinator-state — aggregateTicks gộp counters + histogram từ nhiều worker
statusReason: expected [ 10, 20, +0, NaN ] to deeply equal [ 10, 20, +0 ]

[Survived] MethodExpression
loadtest/coordinator-state.ts:135:25
         const target = (histograms[action] ??= new Array(t.histogramBucketCount || 0).fill(0));
         for (let i = 0; i < Math.min(buckets.length, target.length); i++) target[i] += buckets[i];
       }
-      histBucketCount = Math.max(histBucketCount, t.histogramBucketCount);
+      histBucketCount = Math.min(histBucketCount, t.histogramBucketCount);
     }
     if (t.cpuPct > 0) {

[Killed] EqualityOperator
loadtest/coordinator-state.ts:137:9
       }
       histBucketCount = Math.max(histBucketCount, t.histogramBucketCount);
     }
-    if (t.cpuPct > 0) {
+    if (t.cpuPct >= 0) {
       cpuSum += t.cpuPct;
       cpuN++;
killedBy: coordinator-state — aggregateTicks nhánh sâu (T-11) cpuPct == 0 bị bỏ qua (không làm giảm cpuAvg)
statusReason: expected 20 to be 40 // Object.is equality

[Killed] ConditionalExpression
loadtest/coordinator-state.ts:137:9
       }
       histBucketCount = Math.max(histBucketCount, t.histogramBucketCount);
     }
-    if (t.cpuPct > 0) {
+    if (true) {
       cpuSum += t.cpuPct;
       cpuN++;
killedBy: coordinator-state — aggregateTicks nhánh sâu (T-11) cpuPct == 0 bị bỏ qua (không làm giảm cpuAvg)
statusReason: expected 20 to be 40 // Object.is equality

[Killed] AssignmentOperator
loadtest/coordinator-state.ts:138:7
       histBucketCount = Math.max(histBucketCount, t.histogramBucketCount);
     }
     if (t.cpuPct > 0) {
-      cpuSum += t.cpuPct;
+      cpuSum -= t.cpuPct;
       cpuN++;
     }
killedBy: coordinator-state — aggregateTicks nhánh sâu (T-11) cpuPct == 0 bị bỏ qua (không làm giảm cpuAvg)
statusReason: expected -40 to be 40 // Object.is equality

[Killed] UpdateOperator
loadtest/coordinator-state.ts:139:7
     }
     if (t.cpuPct > 0) {
       cpuSum += t.cpuPct;
-      cpuN++;
+      cpuN--;
     }
     if (t.errorSamples?.length) {
killedBy: coordinator-state — aggregateTicks nhánh sâu (T-11) cpuPct == 0 bị bỏ qua (không làm giảm cpuAvg)
statusReason: expected +0 to be 40 // Object.is equality

[Killed] OptionalChaining
loadtest/coordinator-state.ts:141:9
       cpuSum += t.cpuPct;
       cpuN++;
     }
-    if (t.errorSamples?.length) {
+    if (t.errorSamples.length) {
       errorSamples = [...t.errorSamples, ...errorSamples].slice(0, 20);
     }
killedBy: coordinator-state — aggregateTicks nhánh sâu (T-11) actionOk/actionFail khi worker KHÔNG có field (undefined) → không crash
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] BlockStatement
loadtest/coordinator-state.ts:141:33
       cpuSum += t.cpuPct;
       cpuN++;
     }
-    if (t.errorSamples?.length) {
-      errorSamples = [...t.errorSamples, ...errorSamples].slice(0, 20);
-    }
+    if (t.errorSamples?.length) {}
   }
 
killedBy: coordinator-state — aggregateTicks nhánh sâu (T-11) errorSamples: tick sau gộp trước tick cũ, cap 20
statusReason: expected [] to have a length of 20 but got +0

[Killed] MethodExpression
loadtest/coordinator-state.ts:142:22
       cpuN++;
     }
     if (t.errorSamples?.length) {
-      errorSamples = [...t.errorSamples, ...errorSamples].slice(0, 20);
+      errorSamples = [...t.errorSamples, ...errorSamples];
     }
   }
killedBy: coordinator-state — aggregateTicks nhánh sâu (T-11) errorSamples: tick sau gộp trước tick cũ, cap 20
statusReason: expected [ …(30) ] to have a length of 20 but got 30

[Killed] ArrayDeclaration
loadtest/coordinator-state.ts:142:22
       cpuN++;
     }
     if (t.errorSamples?.length) {
-      errorSamples = [...t.errorSamples, ...errorSamples].slice(0, 20);
+      errorSamples = [].slice(0, 20);
     }
   }
killedBy: coordinator-state — aggregateTicks nhánh sâu (T-11) errorSamples: tick sau gộp trước tick cũ, cap 20
statusReason: expected [] to have a length of 20 but got +0

[Killed] ArithmeticOperator
loadtest/coordinator-state.ts:151:24
   for (const buckets of Object.values(histograms)) totalHist.merge({ buckets });
   const q = totalHist.quantiles();
 
-  const successTotal = C.successTotal + C.failTotal;
+  const successTotal = C.successTotal - C.failTotal;
   const echoTotal = C.echoSent;
 
killedBy: coordinator-state — aggregateTicks gộp counters + histogram từ nhiều worker
statusReason: expected 103.6 to be close to 96.7, received difference is 6.8999999999999915, but expected 0.05

[Killed] MethodExpression
loadtest/coordinator-state.ts:154:21
   const successTotal = C.successTotal + C.failTotal;
   const echoTotal = C.echoSent;
 
-  const topErrors = Object.entries(errors)
-    .map(([code, count]) => ({ code, count }))
-    .sort((a, b) => b.count - a.count)
+  const topErrors = Object.entries(errors).map(([code, count]) => ({
+  code,
+  count
+}))
     .slice(0, 10);
 
killedBy: coordinator-state — aggregateTicks nhánh sâu (T-11) top errors sort theo count giảm + slice 10
statusReason: expected [ 'A', 'B', 'C' ] to deeply equal [ 'B', 'C', 'A' ]

[Survived] MethodExpression
loadtest/coordinator-state.ts:154:21
   const successTotal = C.successTotal + C.failTotal;
   const echoTotal = C.echoSent;
 
-  const topErrors = Object.entries(errors)
-    .map(([code, count]) => ({ code, count }))
-    .sort((a, b) => b.count - a.count)
-    .slice(0, 10);
+  const topErrors = Object.entries(errors).map(([code, count]) => ({
+  code,
+  count
+})).sort((a, b) => b.count - a.count);
 
   const tick: LoadTestTick = {

[Killed] ArrowFunction
loadtest/coordinator-state.ts:155:10
   const echoTotal = C.echoSent;
 
   const topErrors = Object.entries(errors)
-    .map(([code, count]) => ({ code, count }))
+    .map(() => undefined)
     .sort((a, b) => b.count - a.count)
     .slice(0, 10);
killedBy: coordinator-state — aggregateTicks gộp counters + histogram từ nhiều worker
statusReason: Cannot read properties of undefined (reading 'code')

[Killed] ArrowFunction
loadtest/coordinator-state.ts:156:11
 
   const topErrors = Object.entries(errors)
     .map(([code, count]) => ({ code, count }))
-    .sort((a, b) => b.count - a.count)
+    .sort(() => undefined)
     .slice(0, 10);
 
killedBy: coordinator-state — aggregateTicks nhánh sâu (T-11) top errors sort theo count giảm + slice 10
statusReason: expected [ 'A', 'B', 'C' ] to deeply equal [ 'B', 'C', 'A' ]

[Killed] ArithmeticOperator
loadtest/coordinator-state.ts:156:21
 
   const topErrors = Object.entries(errors)
     .map(([code, count]) => ({ code, count }))
-    .sort((a, b) => b.count - a.count)
+    .sort((a, b) => b.count + a.count)
     .slice(0, 10);
 
killedBy: coordinator-state — aggregateTicks nhánh sâu (T-11) top errors sort theo count giảm + slice 10
statusReason: expected [ 'A', 'B', 'C' ] to deeply equal [ 'B', 'C', 'A' ]

[Killed] ArithmeticOperator
loadtest/coordinator-state.ts:177:29
       echoOk: C.echoOk,
       echoSent: C.echoSent,
       queueCount: 0, // coordinator bổ sung từ Redis (bên ngoài — vì pure)
-      roomCount: Math.round(C.usersInRoom / 6),
+      roomCount: Math.round(C.usersInRoom * 6),
       droppedOutbox: C.droppedOutbox,
       reconnectCount: C.reconnectCount,
killedBy: coordinator-state — aggregateTicks gộp counters + histogram từ nhiều worker
statusReason: expected 720 to be 20 // Object.is equality

[Killed] ConditionalExpression
loadtest/coordinator-state.ts:183:20
       rateLimitedNoEcho: C.rateLimitedNoEcho,
     },
     rates: {
-      successRate: successTotal > 0 ? Math.round((C.successTotal / successTotal) * 1000) / 10 : 100,
+      successRate: true ? Math.round((C.successTotal / successTotal) * 1000) / 10 : 100,
       echoRate: echoTotal > 0 ? Math.round((C.echoOk / echoTotal) * 1000) / 10 : 100,
     },
killedBy: coordinator-state — aggregateTicks empty workers → tick zeros, không crash
statusReason: expected NaN to be 100 // Object.is equality

[Killed] ArithmeticOperator
loadtest/coordinator-state.ts:183:51
       rateLimitedNoEcho: C.rateLimitedNoEcho,
     },
     rates: {
-      successRate: successTotal > 0 ? Math.round((C.successTotal / successTotal) * 1000) / 10 : 100,
+      successRate: successTotal > 0 ? Math.round((C.successTotal * successTotal) * 1000) / 10 : 100,
       echoRate: echoTotal > 0 ? Math.round((C.echoOk / echoTotal) * 1000) / 10 : 100,
     },
killedBy: coordinator-state — aggregateTicks gộp counters + histogram từ nhiều worker
statusReason: expected 870000000 to be close to 96.7, received difference is 869999903.3, but expected 0.05

[Killed] ConditionalExpression
loadtest/coordinator-state.ts:184:17
     },
     rates: {
       successRate: successTotal > 0 ? Math.round((C.successTotal / successTotal) * 1000) / 10 : 100,
-      echoRate: echoTotal > 0 ? Math.round((C.echoOk / echoTotal) * 1000) / 10 : 100,
+      echoRate: true ? Math.round((C.echoOk / echoTotal) * 1000) / 10 : 100,
     },
     actionsPerSec,
killedBy: coordinator-state — aggregateTicks nhánh sâu (T-11) successTotal == 0 → successRate 100; echoSent == 0 → echoRate 100
statusReason: expected NaN to be 100 // Object.is equality

[Killed] EqualityOperator
loadtest/coordinator-state.ts:184:17
     },
     rates: {
       successRate: successTotal > 0 ? Math.round((C.successTotal / successTotal) * 1000) / 10 : 100,
-      echoRate: echoTotal > 0 ? Math.round((C.echoOk / echoTotal) * 1000) / 10 : 100,
+      echoRate: echoTotal <= 0 ? Math.round((C.echoOk / echoTotal) * 1000) / 10 : 100,
     },
     actionsPerSec,
killedBy: coordinator-state — aggregateTicks nhánh sâu (T-11) successTotal == 0 → successRate 100; echoSent == 0 → echoRate 100
statusReason: expected NaN to be 100 // Object.is equality

[Killed] ConditionalExpression
loadtest/coordinator-state.ts:190:66
     latency: { p50: q.p50, p95: q.p95, p99: q.p99 },
     errors: topErrors,
     server: { wsConnections: 0, wsMessagesEmitted: 0, wsMessagesPerSec: 0 },
-    workers: { alive: ticks.length, total: ticks.length, cpuAvg: cpuN > 0 ? Math.round(cpuSum / cpuN) : 0 },
+    workers: { alive: ticks.length, total: ticks.length, cpuAvg: false ? Math.round(cpuSum / cpuN) : 0 },
   };
 
killedBy: coordinator-state — aggregateTicks nhánh sâu (T-11) cpuPct == 0 bị bỏ qua (không làm giảm cpuAvg)
statusReason: expected +0 to be 40 // Object.is equality

[Killed] EqualityOperator
loadtest/coordinator-state.ts:190:66
     latency: { p50: q.p50, p95: q.p95, p99: q.p99 },
     errors: topErrors,
     server: { wsConnections: 0, wsMessagesEmitted: 0, wsMessagesPerSec: 0 },
-    workers: { alive: ticks.length, total: ticks.length, cpuAvg: cpuN > 0 ? Math.round(cpuSum / cpuN) : 0 },
+    workers: { alive: ticks.length, total: ticks.length, cpuAvg: cpuN <= 0 ? Math.round(cpuSum / cpuN) : 0 },
   };
 
killedBy: coordinator-state — aggregateTicks nhánh sâu (T-11) cpuPct == 0 bị bỏ qua (không làm giảm cpuAvg)
statusReason: expected +0 to be 40 // Object.is equality

[Killed] BlockStatement
loadtest/coordinator-state.ts:197:71
 }
 
 /** Tính throughput peak từ chuỗi tick (dùng report). */
-export function peakThroughput(actionsPerSecSeries: number[]): number {
-  return actionsPerSecSeries.reduce((m, v) => Math.max(m, v), 0);
-}
+export function peakThroughput(actionsPerSecSeries: number[]): number {}
 
killedBy: coordinator-state — aggregateTicks nhánh sâu (T-11) peakThroughput: rỗng → 0; chuỗi → max
statusReason: expected undefined to be +0 // Object.is equality

[Killed] MethodExpression
loadtest/coordinator-state.ts:198:47
 
 /** Tính throughput peak từ chuỗi tick (dùng report). */
 export function peakThroughput(actionsPerSecSeries: number[]): number {
-  return actionsPerSecSeries.reduce((m, v) => Math.max(m, v), 0);
+  return actionsPerSecSeries.reduce((m, v) => Math.min(m, v), 0);
 }
 
killedBy: coordinator-state — aggregateTicks nhánh sâu (T-11) peakThroughput: rỗng → 0; chuỗi → max
statusReason: expected +0 to be 9 // Object.is equality

[Killed] ArrowFunction
loadtest/coordinator-state.ts:198:37
 
 /** Tính throughput peak từ chuỗi tick (dùng report). */
 export function peakThroughput(actionsPerSecSeries: number[]): number {
-  return actionsPerSecSeries.reduce((m, v) => Math.max(m, v), 0);
+  return actionsPerSecSeries.reduce(() => undefined, 0);
 }
 
killedBy: coordinator-state — aggregateTicks nhánh sâu (T-11) peakThroughput: rỗng → 0; chuỗi → max
statusReason: expected undefined to be 9 // Object.is equality
