[Killed] ArithmeticOperator
loadtest/report.ts:36:24
 
 export function buildReport(input: ReportInput): RunReport {
   const history = input.tickHistory;
-  const last = history[history.length - 1];
+  const last = history[history.length + 1];
   const c = last?.counters ?? {
     usersCreated: 0, usersConnected: 0, usersActive: 0, actionsTotal: 0,
killedBy: buildReport summary throughput avg/peak + echo rate
statusReason: expected 100 to be 95 // Object.is equality

[Killed] LogicalOperator
loadtest/report.ts:37:13
 export function buildReport(input: ReportInput): RunReport {
   const history = input.tickHistory;
   const last = history[history.length - 1];
-  const c = last?.counters ?? {
-    usersCreated: 0, usersConnected: 0, usersActive: 0, actionsTotal: 0,
-    successTotal: 0, failTotal: 0, echoOk: 0, echoSent: 0, queueCount: 0,
-  };
+  const c = last?.counters && {
+  usersCreated: 0,
+  usersConnected: 0,
+  usersActive: 0,
+  actionsTotal: 0,
+  successTotal: 0,
+  failTotal: 0,
+  echoOk: 0,
+  echoSent: 0,
+  queueCount: 0
+};
   const durationSec = Math.max(1, Math.round((input.endAt - input.startAt) / 1000));
   const successTotal = c.successTotal + c.failTotal;
killedBy: buildReport summary throughput avg/peak + echo rate
statusReason: expected 100 to be 95 // Object.is equality

[Killed] OptionalChaining
loadtest/report.ts:37:13
 export function buildReport(input: ReportInput): RunReport {
   const history = input.tickHistory;
   const last = history[history.length - 1];
-  const c = last?.counters ?? {
+  const c = last.counters ?? {
     usersCreated: 0, usersConnected: 0, usersActive: 0, actionsTotal: 0,
     successTotal: 0, failTotal: 0, echoOk: 0, echoSent: 0, queueCount: 0,
killedBy: buildReport — nhánh sâu (T-11) tickHistory rỗng → counters default, không crash, successRate 100
statusReason: Cannot read properties of undefined (reading 'counters')

[Killed] ArithmeticOperator
loadtest/report.ts:41:47
     usersCreated: 0, usersConnected: 0, usersActive: 0, actionsTotal: 0,
     successTotal: 0, failTotal: 0, echoOk: 0, echoSent: 0, queueCount: 0,
   };
-  const durationSec = Math.max(1, Math.round((input.endAt - input.startAt) / 1000));
+  const durationSec = Math.max(1, Math.round((input.endAt + input.startAt) / 1000));
   const successTotal = c.successTotal + c.failTotal;
 
killedBy: buildReport — nhánh sâu (T-11) tickHistory rỗng → counters default, không crash, successRate 100
statusReason: expected 3400000002 to be 2 // Object.is equality

[Killed] MethodExpression
loadtest/report.ts:41:23
     usersCreated: 0, usersConnected: 0, usersActive: 0, actionsTotal: 0,
     successTotal: 0, failTotal: 0, echoOk: 0, echoSent: 0, queueCount: 0,
   };
-  const durationSec = Math.max(1, Math.round((input.endAt - input.startAt) / 1000));
+  const durationSec = Math.min(1, Math.round((input.endAt - input.startAt) / 1000));
   const successTotal = c.successTotal + c.failTotal;
 
killedBy: buildReport — nhánh sâu (T-11) tickHistory rỗng → counters default, không crash, successRate 100
statusReason: expected 1 to be 2 // Object.is equality

[Killed] ArithmeticOperator
loadtest/report.ts:42:24
     successTotal: 0, failTotal: 0, echoOk: 0, echoSent: 0, queueCount: 0,
   };
   const durationSec = Math.max(1, Math.round((input.endAt - input.startAt) / 1000));
-  const successTotal = c.successTotal + c.failTotal;
+  const successTotal = c.successTotal - c.failTotal;
 
   // Per-action từ histogram cumulative + per-action ok/fail thật
killedBy: buildReport summary throughput avg/peak + echo rate
statusReason: expected 101 to be 99 // Object.is equality

[Killed] BlockStatement
loadtest/report.ts:46:58
 
   // Per-action từ histogram cumulative + per-action ok/fail thật
   const perAction: ActionReport[] = [];
-  for (const action of input.perActionHistograms.keys()) {
-    const h = input.perActionHistograms.get(action)!;
-    const q = h.quantiles();
-    const ok = input.actionOk[action] ?? 0;
-    const fail = input.actionFail[action] ?? 0;
-    const actionTotal = ok + fail;
-    perAction.push({
-      action: action as ActionReport['action'],
-      count: h.getCount(),
-      success: ok,
-      fail,
-      successRate: actionTotal > 0 ? Math.round((ok / actionTotal) * 1000) / 10 : 100,
-      avgMs: q.avg,
-      p50Ms: q.p50,
-      p95Ms: q.p95,
-      p99Ms: q.p99,
-    });
-  }
+  for (const action of input.perActionHistograms.keys()) {}
   perAction.sort((a, b) => b.count - a.count);
 
killedBy: buildReport per-action success rate dùng ok/fail thật theo action (AC6.1)
statusReason: expected undefined to be 90 // Object.is equality

[Killed] LogicalOperator
loadtest/report.ts:49:16
   for (const action of input.perActionHistograms.keys()) {
     const h = input.perActionHistograms.get(action)!;
     const q = h.quantiles();
-    const ok = input.actionOk[action] ?? 0;
+    const ok = input.actionOk[action] && 0;
     const fail = input.actionFail[action] ?? 0;
     const actionTotal = ok + fail;
killedBy: buildReport per-action success rate dùng ok/fail thật theo action (AC6.1)
statusReason: expected +0 to be 90 // Object.is equality

[Killed] LogicalOperator
loadtest/report.ts:50:18
     const h = input.perActionHistograms.get(action)!;
     const q = h.quantiles();
     const ok = input.actionOk[action] ?? 0;
-    const fail = input.actionFail[action] ?? 0;
+    const fail = input.actionFail[action] && 0;
     const actionTotal = ok + fail;
     perAction.push({
killedBy: buildReport per-action success rate dùng ok/fail thật theo action (AC6.1)
statusReason: expected +0 to be 10 // Object.is equality

[Killed] ArithmeticOperator
loadtest/report.ts:51:25
     const q = h.quantiles();
     const ok = input.actionOk[action] ?? 0;
     const fail = input.actionFail[action] ?? 0;
-    const actionTotal = ok + fail;
+    const actionTotal = ok - fail;
     perAction.push({
       action: action as ActionReport['action'],
killedBy: buildReport per-action success rate dùng ok/fail thật theo action (AC6.1)
statusReason: expected 112.5 to be close to 90, received difference is 22.5, but expected 0.05

[Killed] ConditionalExpression
loadtest/report.ts:57:20
       count: h.getCount(),
       success: ok,
       fail,
-      successRate: actionTotal > 0 ? Math.round((ok / actionTotal) * 1000) / 10 : 100,
+      successRate: false ? Math.round((ok / actionTotal) * 1000) / 10 : 100,
       avgMs: q.avg,
       p50Ms: q.p50,
killedBy: buildReport per-action success rate dùng ok/fail thật theo action (AC6.1)
statusReason: expected 100 to be close to 90, received difference is 10, but expected 0.05

[Killed] ArithmeticOperator
loadtest/report.ts:57:50
       count: h.getCount(),
       success: ok,
       fail,
-      successRate: actionTotal > 0 ? Math.round((ok / actionTotal) * 1000) / 10 : 100,
+      successRate: actionTotal > 0 ? Math.round((ok * actionTotal) * 1000) / 10 : 100,
       avgMs: q.avg,
       p50Ms: q.p50,
killedBy: buildReport per-action success rate dùng ok/fail thật theo action (AC6.1)
statusReason: expected 900000 to be close to 90, received difference is 899910, but expected 0.05

[Killed] MethodExpression
loadtest/report.ts:64:3
       p99Ms: q.p99,
     });
   }
-  perAction.sort((a, b) => b.count - a.count);
+  perAction;
 
   const errorsMap = new Map<string, number>();
killedBy: buildReport — nhánh sâu (T-11) perAction sort theo count giảm dần
statusReason: expected 'chat' to be 'read' // Object.is equality

[Killed] ArithmeticOperator
loadtest/report.ts:64:28
       p99Ms: q.p99,
     });
   }
-  perAction.sort((a, b) => b.count - a.count);
+  perAction.sort((a, b) => b.count + a.count);
 
   const errorsMap = new Map<string, number>();
killedBy: buildReport — nhánh sâu (T-11) perAction sort theo count giảm dần
statusReason: expected 'chat' to be 'read' // Object.is equality

[Killed] BlockStatement
loadtest/report.ts:67:28
   perAction.sort((a, b) => b.count - a.count);
 
   const errorsMap = new Map<string, number>();
-  for (const t of history) {
-    for (const e of t.errors) errorsMap.set(e.code, (errorsMap.get(e.code) ?? 0) + e.count);
-  }
+  for (const t of history) {}
   const errors = [...errorsMap.entries()]
     .map(([code, count]) => ({ code, count }))
killedBy: reportToMarkdown — snapshot toàn bộ output (diệt string mutant) markdown đầy đủ ổn định (snapshot)
statusReason: Snapshot `reportToMarkdown — snapshot toàn bộ output (diệt string mutant) > markdown đầy đủ ổn định (snapshot) 1` mismatched

[Killed] LogicalOperator
loadtest/report.ts:68:54
 
   const errorsMap = new Map<string, number>();
   for (const t of history) {
-    for (const e of t.errors) errorsMap.set(e.code, (errorsMap.get(e.code) ?? 0) + e.count);
+    for (const e of t.errors) errorsMap.set(e.code, (errorsMap.get(e.code) && 0) + e.count);
   }
   const errors = [...errorsMap.entries()]
killedBy: reportToMarkdown — snapshot toàn bộ output (diệt string mutant) markdown đầy đủ ổn định (snapshot)
statusReason: Snapshot `reportToMarkdown — snapshot toàn bộ output (diệt string mutant) > markdown đầy đủ ổn định (snapshot) 1` mismatched

[Killed] ArithmeticOperator
loadtest/report.ts:68:53
 
   const errorsMap = new Map<string, number>();
   for (const t of history) {
-    for (const e of t.errors) errorsMap.set(e.code, (errorsMap.get(e.code) ?? 0) + e.count);
+    for (const e of t.errors) errorsMap.set(e.code, (errorsMap.get(e.code) ?? 0) - e.count);
   }
   const errors = [...errorsMap.entries()]
killedBy: reportToMarkdown — snapshot toàn bộ output (diệt string mutant) markdown đầy đủ ổn định (snapshot)
statusReason: Snapshot `reportToMarkdown — snapshot toàn bộ output (diệt string mutant) > markdown đầy đủ ổn định (snapshot) 1` mismatched

[Survived] MethodExpression
loadtest/report.ts:70:18
   for (const t of history) {
     for (const e of t.errors) errorsMap.set(e.code, (errorsMap.get(e.code) ?? 0) + e.count);
   }
-  const errors = [...errorsMap.entries()]
-    .map(([code, count]) => ({ code, count }))
-    .sort((a, b) => b.count - a.count)
-    .slice(0, 20);
+  const errors = [...errorsMap.entries()].map(([code, count]) => ({
+  code,
+  count
+})).sort((a, b) => b.count - a.count);
 
   // T-07/S-12: NO_POST_FIXTURE — feed trống, không phải lỗi hệ thống; báo rõ trong report.

[Survived] MethodExpression
loadtest/report.ts:70:18
   for (const t of history) {
     for (const e of t.errors) errorsMap.set(e.code, (errorsMap.get(e.code) ?? 0) + e.count);
   }
-  const errors = [...errorsMap.entries()]
-    .map(([code, count]) => ({ code, count }))
-    .sort((a, b) => b.count - a.count)
+  const errors = [...errorsMap.entries()].map(([code, count]) => ({
+  code,
+  count
+}))
     .slice(0, 20);
 

[Killed] ArrowFunction
loadtest/report.ts:71:10
     for (const e of t.errors) errorsMap.set(e.code, (errorsMap.get(e.code) ?? 0) + e.count);
   }
   const errors = [...errorsMap.entries()]
-    .map(([code, count]) => ({ code, count }))
+    .map(() => undefined)
     .sort((a, b) => b.count - a.count)
     .slice(0, 20);
killedBy: reportToMarkdown — NO_POST_FIXTURE (T-07/S-12) báo rõ section "Không có post fixture" khi feed trống
statusReason: Cannot read properties of undefined (reading 'code')

[Killed] ObjectLiteral
loadtest/report.ts:71:30
     for (const e of t.errors) errorsMap.set(e.code, (errorsMap.get(e.code) ?? 0) + e.count);
   }
   const errors = [...errorsMap.entries()]
-    .map(([code, count]) => ({ code, count }))
+    .map(([code, count]) => ({}))
     .sort((a, b) => b.count - a.count)
     .slice(0, 20);
killedBy: reportToMarkdown — NO_POST_FIXTURE (T-07/S-12) báo rõ section "Không có post fixture" khi feed trống
statusReason: Cannot read properties of undefined (reading 'toLocaleString')

[Killed] LogicalOperator
loadtest/report.ts:77:5
 
   // T-07/S-12: NO_POST_FIXTURE — feed trống, không phải lỗi hệ thống; báo rõ trong report.
   const noPostFixtureSkipped =
-    input.noPostFixtureSkipped ??
-    history.reduce(
-      (acc, t) => acc + t.errors.filter((e) => e.code === 'NO_POST_FIXTURE').reduce((a, e) => a + e.count, 0),
-      0,
-    );
+    input.noPostFixtureSkipped && history.reduce((acc, t) => acc + t.errors.filter(e => e.code === 'NO_POST_FIXTURE').reduce((a, e) => a + e.count, 0), 0);
 
   const bottleneckInput = {
killedBy: reportToMarkdown — NO_POST_FIXTURE (T-07/S-12) báo rõ section "Không có post fixture" khi feed trống
statusReason: expected undefined to be 123 // Object.is equality

[Killed] ConditionalExpression
loadtest/report.ts:79:48
   const noPostFixtureSkipped =
     input.noPostFixtureSkipped ??
     history.reduce(
-      (acc, t) => acc + t.errors.filter((e) => e.code === 'NO_POST_FIXTURE').reduce((a, e) => a + e.count, 0),
+      (acc, t) => acc + t.errors.filter((e) => false).reduce((a, e) => a + e.count, 0),
       0,
     );
killedBy: reportToMarkdown — NO_POST_FIXTURE (T-07/S-12) báo rõ section "Không có post fixture" khi feed trống
statusReason: expected +0 to be 123 // Object.is equality

[Killed] EqualityOperator
loadtest/report.ts:79:48
   const noPostFixtureSkipped =
     input.noPostFixtureSkipped ??
     history.reduce(
-      (acc, t) => acc + t.errors.filter((e) => e.code === 'NO_POST_FIXTURE').reduce((a, e) => a + e.count, 0),
+      (acc, t) => acc + t.errors.filter((e) => e.code !== 'NO_POST_FIXTURE').reduce((a, e) => a + e.count, 0),
       0,
     );
killedBy: reportToMarkdown — NO_POST_FIXTURE (T-07/S-12) báo rõ section "Không có post fixture" khi feed trống
statusReason: expected +0 to be 123 // Object.is equality

[Survived] UnaryOperator
loadtest/report.ts:88:30
     echoOk: c.echoOk,
     echoSent: c.echoSent,
     config: input.config,
-    workerCpu: history.slice(-60).reduce((a, t) => a + t.workers.cpuAvg, 0) / Math.max(1, history.slice(-60).length),
+    workerCpu: history.slice(+60).reduce((a, t) => a + t.workers.cpuAvg, 0) / Math.max(1, history.slice(-60).length),
   };
   const bottlenecks = detectBottlenecks(bottleneckInput);

[Survived] MethodExpression
loadtest/report.ts:88:91
     echoOk: c.echoOk,
     echoSent: c.echoSent,
     config: input.config,
-    workerCpu: history.slice(-60).reduce((a, t) => a + t.workers.cpuAvg, 0) / Math.max(1, history.slice(-60).length),
+    workerCpu: history.slice(-60).reduce((a, t) => a + t.workers.cpuAvg, 0) / Math.max(1, history.length),
   };
   const bottlenecks = detectBottlenecks(bottleneckInput);

[Killed] ArithmeticOperator
loadtest/report.ts:106:39
       actionsTotal: c.actionsTotal,
       successTotal: c.successTotal,
       failTotal: c.failTotal,
-      successRate: successTotal > 0 ? Math.round((c.successTotal / successTotal) * 1000) / 10 : 100,
+      successRate: successTotal > 0 ? Math.round(c.successTotal / successTotal * 1000) * 10 : 100,
       echoOk: c.echoOk,
       echoSent: c.echoSent,
killedBy: buildReport summary throughput avg/peak + echo rate
statusReason: expected 9900 to be 99 // Object.is equality

[Killed] ArithmeticOperator
loadtest/report.ts:106:51
       actionsTotal: c.actionsTotal,
       successTotal: c.successTotal,
       failTotal: c.failTotal,
-      successRate: successTotal > 0 ? Math.round((c.successTotal / successTotal) * 1000) / 10 : 100,
+      successRate: successTotal > 0 ? Math.round((c.successTotal * successTotal) * 1000) / 10 : 100,
       echoOk: c.echoOk,
       echoSent: c.echoSent,
killedBy: buildReport summary throughput avg/peak + echo rate
statusReason: expected 990000000000 to be 99 // Object.is equality

[Killed] ConditionalExpression
loadtest/report.ts:109:17
       successRate: successTotal > 0 ? Math.round((c.successTotal / successTotal) * 1000) / 10 : 100,
       echoOk: c.echoOk,
       echoSent: c.echoSent,
-      echoRate: c.echoSent > 0 ? Math.round((c.echoOk / c.echoSent) * 1000) / 10 : 100,
+      echoRate: false ? Math.round((c.echoOk / c.echoSent) * 1000) / 10 : 100,
       throughputAvg: Math.round(c.actionsTotal / durationSec),
       throughputPeak: input.peakActionsPerSec,
killedBy: buildReport summary throughput avg/peak + echo rate
statusReason: expected 100 to be 95 // Object.is equality

[Killed] ConditionalExpression
loadtest/report.ts:109:17
       successRate: successTotal > 0 ? Math.round((c.successTotal / successTotal) * 1000) / 10 : 100,
       echoOk: c.echoOk,
       echoSent: c.echoSent,
-      echoRate: c.echoSent > 0 ? Math.round((c.echoOk / c.echoSent) * 1000) / 10 : 100,
+      echoRate: true ? Math.round((c.echoOk / c.echoSent) * 1000) / 10 : 100,
       throughputAvg: Math.round(c.actionsTotal / durationSec),
       throughputPeak: input.peakActionsPerSec,
killedBy: buildReport — nhánh sâu (T-11) tickHistory rỗng → counters default, không crash, successRate 100
statusReason: expected NaN to be 100 // Object.is equality

[Killed] ArithmeticOperator
loadtest/report.ts:110:33
       echoOk: c.echoOk,
       echoSent: c.echoSent,
       echoRate: c.echoSent > 0 ? Math.round((c.echoOk / c.echoSent) * 1000) / 10 : 100,
-      throughputAvg: Math.round(c.actionsTotal / durationSec),
+      throughputAvg: Math.round(c.actionsTotal * durationSec),
       throughputPeak: input.peakActionsPerSec,
       queueCountPeak: input.maxQueue,
killedBy: buildReport — nhánh sâu (T-11) actionsTotal/success/fail truyền thẳng vào summary
statusReason: expected 200000 to be 50000 // Object.is equality

[Killed] EqualityOperator
loadtest/report.ts:135:7
 export function detectBottlenecks(input: BottleneckInput): BottleneckCandidate[] {
   const out: BottleneckCandidate[] = [];
   const h = input.history;
-  if (h.length < 5) return out;
+  if (h.length >= 5) return out;
 
   const seriesOf = (pick: (t: LoadTestTick) => number): { ts: number; value: number }[] =>
killedBy: detectBottlenecks (AC6.2) queue-count tăng liên tục > 5 phút → nghi ngờ matching trần 100/s
statusReason: expected undefined to be defined

[Killed] ConditionalExpression
loadtest/report.ts:135:7
 export function detectBottlenecks(input: BottleneckInput): BottleneckCandidate[] {
   const out: BottleneckCandidate[] = [];
   const h = input.history;
-  if (h.length < 5) return out;
+  if (true) return out;
 
   const seriesOf = (pick: (t: LoadTestTick) => number): { ts: number; value: number }[] =>
killedBy: detectBottlenecks (AC6.2) queue-count tăng liên tục > 5 phút → nghi ngờ matching trần 100/s
statusReason: expected undefined to be defined

[Killed] ArrowFunction
loadtest/report.ts:137:20
   const h = input.history;
   if (h.length < 5) return out;
 
-  const seriesOf = (pick: (t: LoadTestTick) => number): { ts: number; value: number }[] =>
-    h.map((t) => ({ ts: t.ts, value: pick(t) }));
+  const seriesOf = () => undefined;
 
   // 1. Chat echo rate < 95%
killedBy: detectBottlenecks (AC6.2) queue-count tăng liên tục > 5 phút → nghi ngờ matching trần 100/s
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] ArrowFunction
loadtest/report.ts:138:11
   if (h.length < 5) return out;
 
   const seriesOf = (pick: (t: LoadTestTick) => number): { ts: number; value: number }[] =>
-    h.map((t) => ({ ts: t.ts, value: pick(t) }));
+    h.map(() => undefined);
 
   // 1. Chat echo rate < 95%
killedBy: detectBottlenecks (AC6.2) queue-count tăng liên tục > 5 phút → nghi ngờ matching trần 100/s
statusReason: Cannot read properties of undefined (reading 'value')

[Killed] ObjectLiteral
loadtest/report.ts:138:19
   if (h.length < 5) return out;
 
   const seriesOf = (pick: (t: LoadTestTick) => number): { ts: number; value: number }[] =>
-    h.map((t) => ({ ts: t.ts, value: pick(t) }));
+    h.map((t) => ({}));
 
   // 1. Chat echo rate < 95%
killedBy: detectBottlenecks (AC6.2) queue-count tăng liên tục > 5 phút → nghi ngờ matching trần 100/s
statusReason: expected undefined to be defined

[Killed] ConditionalExpression
loadtest/report.ts:141:7
     h.map((t) => ({ ts: t.ts, value: pick(t) }));
 
   // 1. Chat echo rate < 95%
-  if (input.echoSent >= 100) {
+  if (true) {
     const echoRate = (input.echoOk / input.echoSent) * 100;
     if (echoRate < 95) {
killedBy: detectBottlenecks (AC6.2) echoSent < 100 → KHÔNG cảnh báo echo dù echoOk = 0 (ngưỡng sample)
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
loadtest/report.ts:141:7
     h.map((t) => ({ ts: t.ts, value: pick(t) }));
 
   // 1. Chat echo rate < 95%
-  if (input.echoSent >= 100) {
+  if (input.echoSent < 100) {
     const echoRate = (input.echoOk / input.echoSent) * 100;
     if (echoRate < 95) {
killedBy: detectBottlenecks (AC6.2) echo rate < 95% → bottleneck chat
statusReason: expected false to be true // Object.is equality

[Killed] ArithmeticOperator
loadtest/report.ts:142:23
 
   // 1. Chat echo rate < 95%
   if (input.echoSent >= 100) {
-    const echoRate = (input.echoOk / input.echoSent) * 100;
+    const echoRate = (input.echoOk * input.echoSent) * 100;
     if (echoRate < 95) {
       out.push({
killedBy: detectBottlenecks (AC6.2) echo rate < 95% → bottleneck chat
statusReason: expected false to be true // Object.is equality

[Killed] ArithmeticOperator
loadtest/report.ts:142:22
 
   // 1. Chat echo rate < 95%
   if (input.echoSent >= 100) {
-    const echoRate = (input.echoOk / input.echoSent) * 100;
+    const echoRate = input.echoOk / input.echoSent / 100;
     if (echoRate < 95) {
       out.push({
killedBy: detectBottlenecks (AC6.2) hệ thống khỏe → không có bottleneck
statusReason: expected 1 to be +0 // Object.is equality

[Killed] ConditionalExpression
loadtest/report.ts:143:9
   // 1. Chat echo rate < 95%
   if (input.echoSent >= 100) {
     const echoRate = (input.echoOk / input.echoSent) * 100;
-    if (echoRate < 95) {
+    if (false) {
       out.push({
         level: echoRate < 90 ? 'High' : 'Med',
killedBy: detectBottlenecks (AC6.2) echo rate < 95% → bottleneck chat
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
loadtest/report.ts:143:24
   // 1. Chat echo rate < 95%
   if (input.echoSent >= 100) {
     const echoRate = (input.echoOk / input.echoSent) * 100;
-    if (echoRate < 95) {
-      out.push({
-        level: echoRate < 90 ? 'High' : 'Med',
-        title: `Chat echo rate ${echoRate.toFixed(1)}% (< 95% dự kiến)`,
-        detail: 'Nghi ngờ rate-limit chat (1 msg/2s silent drop) hoặc pipeline Kafka chậm — PRD §5.3 tách rate-limited khỏi lỗi thật.',
-        evidence: seriesOf((t) => (t.counters.echoSent > 0 ? (t.counters.echoOk / t.counters.echoSent) * 100 : 100)).slice(-120),
-      });
-    }
+    if (echoRate < 95) {}
   }
 
killedBy: detectBottlenecks (AC6.2) echo rate < 95% → bottleneck chat
statusReason: expected false to be true // Object.is equality

[Killed] ObjectLiteral
loadtest/report.ts:144:16
   if (input.echoSent >= 100) {
     const echoRate = (input.echoOk / input.echoSent) * 100;
     if (echoRate < 95) {
-      out.push({
-        level: echoRate < 90 ? 'High' : 'Med',
-        title: `Chat echo rate ${echoRate.toFixed(1)}% (< 95% dự kiến)`,
-        detail: 'Nghi ngờ rate-limit chat (1 msg/2s silent drop) hoặc pipeline Kafka chậm — PRD §5.3 tách rate-limited khỏi lỗi thật.',
-        evidence: seriesOf((t) => (t.counters.echoSent > 0 ? (t.counters.echoOk / t.counters.echoSent) * 100 : 100)).slice(-120),
-      });
+      out.push({});
     }
   }
killedBy: detectBottlenecks (AC6.2) echo rate < 95% → bottleneck chat
statusReason: Cannot read properties of undefined (reading 'includes')

[Killed] ConditionalExpression
loadtest/report.ts:145:16
     const echoRate = (input.echoOk / input.echoSent) * 100;
     if (echoRate < 95) {
       out.push({
-        level: echoRate < 90 ? 'High' : 'Med',
+        level: true ? 'High' : 'Med',
         title: `Chat echo rate ${echoRate.toFixed(1)}% (< 95% dự kiến)`,
         detail: 'Nghi ngờ rate-limit chat (1 msg/2s silent drop) hoặc pipeline Kafka chậm — PRD §5.3 tách rate-limited khỏi lỗi thật.',
killedBy: detectBottlenecks (AC6.2) echo bottleneck: level High khi < 90%, Med khi 90-95%, evidence rate CHÍNH XÁC
statusReason: expected 'High' to be 'Med' // Object.is equality

[Killed] EqualityOperator
loadtest/report.ts:145:16
     const echoRate = (input.echoOk / input.echoSent) * 100;
     if (echoRate < 95) {
       out.push({
-        level: echoRate < 90 ? 'High' : 'Med',
+        level: echoRate >= 90 ? 'High' : 'Med',
         title: `Chat echo rate ${echoRate.toFixed(1)}% (< 95% dự kiến)`,
         detail: 'Nghi ngờ rate-limit chat (1 msg/2s silent drop) hoặc pipeline Kafka chậm — PRD §5.3 tách rate-limited khỏi lỗi thật.',
killedBy: detectBottlenecks (AC6.2) echo bottleneck: level High khi < 90%, Med khi 90-95%, evidence rate CHÍNH XÁC
statusReason: expected 'Med' to be 'High' // Object.is equality

[Killed] StringLiteral
loadtest/report.ts:146:16
     if (echoRate < 95) {
       out.push({
         level: echoRate < 90 ? 'High' : 'Med',
-        title: `Chat echo rate ${echoRate.toFixed(1)}% (< 95% dự kiến)`,
+        title: ``,
         detail: 'Nghi ngờ rate-limit chat (1 msg/2s silent drop) hoặc pipeline Kafka chậm — PRD §5.3 tách rate-limited khỏi lỗi thật.',
         evidence: seriesOf((t) => (t.counters.echoSent > 0 ? (t.counters.echoOk / t.counters.echoSent) * 100 : 100)).slice(-120),
killedBy: detectBottlenecks (AC6.2) echo rate < 95% → bottleneck chat
statusReason: expected false to be true // Object.is equality

[Killed] ArrowFunction
loadtest/report.ts:148:28
         level: echoRate < 90 ? 'High' : 'Med',
         title: `Chat echo rate ${echoRate.toFixed(1)}% (< 95% dự kiến)`,
         detail: 'Nghi ngờ rate-limit chat (1 msg/2s silent drop) hoặc pipeline Kafka chậm — PRD §5.3 tách rate-limited khỏi lỗi thật.',
-        evidence: seriesOf((t) => (t.counters.echoSent > 0 ? (t.counters.echoOk / t.counters.echoSent) * 100 : 100)).slice(-120),
+        evidence: seriesOf(() => undefined).slice(-120),
       });
     }
killedBy: detectBottlenecks (AC6.2) echo bottleneck: level High khi < 90%, Med khi 90-95%, evidence rate CHÍNH XÁC
statusReason: expected undefined to be 80 // Object.is equality

[Killed] ConditionalExpression
loadtest/report.ts:148:36
         level: echoRate < 90 ? 'High' : 'Med',
         title: `Chat echo rate ${echoRate.toFixed(1)}% (< 95% dự kiến)`,
         detail: 'Nghi ngờ rate-limit chat (1 msg/2s silent drop) hoặc pipeline Kafka chậm — PRD §5.3 tách rate-limited khỏi lỗi thật.',
-        evidence: seriesOf((t) => (t.counters.echoSent > 0 ? (t.counters.echoOk / t.counters.echoSent) * 100 : 100)).slice(-120),
+        evidence: seriesOf((t) => (false ? (t.counters.echoOk / t.counters.echoSent) * 100 : 100)).slice(-120),
       });
     }
killedBy: detectBottlenecks (AC6.2) echo bottleneck: level High khi < 90%, Med khi 90-95%, evidence rate CHÍNH XÁC
statusReason: expected 100 to be 80 // Object.is equality

[Killed] ArrowFunction
loadtest/report.ts:154:32
   }
 
   // 2. Queue-count tăng liên tục > 5 phút → matching trần ~100 user/s
-  const queueSeries = seriesOf((t) => t.counters.queueCount);
+  const queueSeries = seriesOf(() => undefined);
   const longestRun = longestNonDecreasingRun(queueSeries);
   if (longestRun.seconds >= 300 && longestRun.growth > 50) {
killedBy: detectBottlenecks (AC6.2) queue-count tăng liên tục > 5 phút → nghi ngờ matching trần 100/s
statusReason: expected undefined to be defined

[Killed] LogicalOperator
loadtest/report.ts:156:7
   // 2. Queue-count tăng liên tục > 5 phút → matching trần ~100 user/s
   const queueSeries = seriesOf((t) => t.counters.queueCount);
   const longestRun = longestNonDecreasingRun(queueSeries);
-  if (longestRun.seconds >= 300 && longestRun.growth > 50) {
+  if (longestRun.seconds >= 300 || longestRun.growth > 50) {
     out.push({
       level: longestRun.seconds >= 600 ? 'High' : 'Med',
killedBy: detectBottlenecks (AC6.2) queue bottleneck: growth biên 50 → KHÔNG; 51 → Med; 600s → High
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
loadtest/report.ts:156:36
   // 2. Queue-count tăng liên tục > 5 phút → matching trần ~100 user/s
   const queueSeries = seriesOf((t) => t.counters.queueCount);
   const longestRun = longestNonDecreasingRun(queueSeries);
-  if (longestRun.seconds >= 300 && longestRun.growth > 50) {
+  if (longestRun.seconds >= 300 && longestRun.growth <= 50) {
     out.push({
       level: longestRun.seconds >= 600 ? 'High' : 'Med',
killedBy: detectBottlenecks (AC6.2) queue-count tăng liên tục > 5 phút → nghi ngờ matching trần 100/s
statusReason: expected undefined to be defined

[Killed] ObjectLiteral
loadtest/report.ts:157:14
   const queueSeries = seriesOf((t) => t.counters.queueCount);
   const longestRun = longestNonDecreasingRun(queueSeries);
   if (longestRun.seconds >= 300 && longestRun.growth > 50) {
-    out.push({
-      level: longestRun.seconds >= 600 ? 'High' : 'Med',
-      title: `Queue-count tăng liên tục ${Math.round(longestRun.seconds / 60)} phút (${Math.round(longestRun.growth)} user)`,
-      detail: 'Matching engine trần ~100 user/s (MAX_POP=200/tick 2s) — user vào phòng chậm hơn ramp.',
-      evidence: queueSeries.slice(-600),
-    });
+    out.push({});
   }
 
killedBy: detectBottlenecks (AC6.2) queue-count tăng liên tục > 5 phút → nghi ngờ matching trần 100/s
statusReason: Cannot read properties of undefined (reading 'includes')

[Killed] ConditionalExpression
loadtest/report.ts:158:14
   const longestRun = longestNonDecreasingRun(queueSeries);
   if (longestRun.seconds >= 300 && longestRun.growth > 50) {
     out.push({
-      level: longestRun.seconds >= 600 ? 'High' : 'Med',
+      level: false ? 'High' : 'Med',
       title: `Queue-count tăng liên tục ${Math.round(longestRun.seconds / 60)} phút (${Math.round(longestRun.growth)} user)`,
       detail: 'Matching engine trần ~100 user/s (MAX_POP=200/tick 2s) — user vào phòng chậm hơn ramp.',
killedBy: detectBottlenecks (AC6.2) queue bottleneck: growth biên 50 → KHÔNG; 51 → Med; 600s → High
statusReason: expected 'Med' to be 'High' // Object.is equality
