[Killed] ConditionalExpression
loadtest/report.ts:158:14
   const longestRun = longestNonDecreasingRun(queueSeries);
   if (longestRun.seconds >= 300 && longestRun.growth > 50) {
     out.push({
-      level: longestRun.seconds >= 600 ? 'High' : 'Med',
+      level: true ? 'High' : 'Med',
       title: `Queue-count tăng liên tục ${Math.round(longestRun.seconds / 60)} phút (${Math.round(longestRun.growth)} user)`,
       detail: 'Matching engine trần ~100 user/s (MAX_POP=200/tick 2s) — user vào phòng chậm hơn ramp.',
killedBy: detectBottlenecks (AC6.2) queue bottleneck: growth biên 50 → KHÔNG; 51 → Med; 600s → High
statusReason: expected 'High' to be 'Med' // Object.is equality

[Survived] ArithmeticOperator
loadtest/report.ts:159:54
   if (longestRun.seconds >= 300 && longestRun.growth > 50) {
     out.push({
       level: longestRun.seconds >= 600 ? 'High' : 'Med',
-      title: `Queue-count tăng liên tục ${Math.round(longestRun.seconds / 60)} phút (${Math.round(longestRun.growth)} user)`,
+      title: `Queue-count tăng liên tục ${Math.round(longestRun.seconds * 60)} phút (${Math.round(longestRun.growth)} user)`,
       detail: 'Matching engine trần ~100 user/s (MAX_POP=200/tick 2s) — user vào phòng chậm hơn ramp.',
       evidence: queueSeries.slice(-600),

[Killed] StringLiteral
loadtest/report.ts:159:14
   if (longestRun.seconds >= 300 && longestRun.growth > 50) {
     out.push({
       level: longestRun.seconds >= 600 ? 'High' : 'Med',
-      title: `Queue-count tăng liên tục ${Math.round(longestRun.seconds / 60)} phút (${Math.round(longestRun.growth)} user)`,
+      title: ``,
       detail: 'Matching engine trần ~100 user/s (MAX_POP=200/tick 2s) — user vào phòng chậm hơn ramp.',
       evidence: queueSeries.slice(-600),
killedBy: detectBottlenecks (AC6.2) queue-count tăng liên tục > 5 phút → nghi ngờ matching trần 100/s
statusReason: expected undefined to be defined

[Killed] UnaryOperator
loadtest/report.ts:161:35
       level: longestRun.seconds >= 600 ? 'High' : 'Med',
       title: `Queue-count tăng liên tục ${Math.round(longestRun.seconds / 60)} phút (${Math.round(longestRun.growth)} user)`,
       detail: 'Matching engine trần ~100 user/s (MAX_POP=200/tick 2s) — user vào phòng chậm hơn ramp.',
-      evidence: queueSeries.slice(-600),
+      evidence: queueSeries.slice(+600),
     });
   }
killedBy: detectBottlenecks (AC6.2) queue-count tăng liên tục > 5 phút → nghi ngờ matching trần 100/s
statusReason: expected 0 to be greater than 0

[Survived] MethodExpression
loadtest/report.ts:161:17
       level: longestRun.seconds >= 600 ? 'High' : 'Med',
       title: `Queue-count tăng liên tục ${Math.round(longestRun.seconds / 60)} phút (${Math.round(longestRun.growth)} user)`,
       detail: 'Matching engine trần ~100 user/s (MAX_POP=200/tick 2s) — user vào phòng chậm hơn ramp.',
-      evidence: queueSeries.slice(-600),
+      evidence: queueSeries,
     });
   }

[Killed] ArrowFunction
loadtest/report.ts:166:30
   }
 
   // 3. P95 tăng > 2× so với 5 phút đầu (nghi DB/Kafka)
-  const p95Series = seriesOf((t) => t.latency.p95);
+  const p95Series = seriesOf(() => undefined);
   const first5 = p95Series.filter((p) => p.ts - h[0].ts <= 300_000);
   const last5 = p95Series.slice(-300);
killedBy: detectBottlenecks (AC6.2) P95 tăng > 2× so với 5 phút đầu → bottleneck latency
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
loadtest/report.ts:167:42
 
   // 3. P95 tăng > 2× so với 5 phút đầu (nghi DB/Kafka)
   const p95Series = seriesOf((t) => t.latency.p95);
-  const first5 = p95Series.filter((p) => p.ts - h[0].ts <= 300_000);
+  const first5 = p95Series.filter((p) => false);
   const last5 = p95Series.slice(-300);
   if (first5.length >= 30 && last5.length >= 30) {
killedBy: detectBottlenecks (AC6.2) P95 tăng > 2× so với 5 phút đầu → bottleneck latency
statusReason: expected false to be true // Object.is equality

[Killed] MethodExpression
loadtest/report.ts:167:18
 
   // 3. P95 tăng > 2× so với 5 phút đầu (nghi DB/Kafka)
   const p95Series = seriesOf((t) => t.latency.p95);
-  const first5 = p95Series.filter((p) => p.ts - h[0].ts <= 300_000);
+  const first5 = p95Series;
   const last5 = p95Series.slice(-300);
   if (first5.length >= 30 && last5.length >= 30) {
killedBy: detectBottlenecks (AC6.2) P95 tăng > 2× so với 5 phút đầu → bottleneck latency
statusReason: expected false to be true // Object.is equality

[Killed] UnaryOperator
loadtest/report.ts:168:33
   // 3. P95 tăng > 2× so với 5 phút đầu (nghi DB/Kafka)
   const p95Series = seriesOf((t) => t.latency.p95);
   const first5 = p95Series.filter((p) => p.ts - h[0].ts <= 300_000);
-  const last5 = p95Series.slice(-300);
+  const last5 = p95Series.slice(+300);
   if (first5.length >= 30 && last5.length >= 30) {
     const avg = (arr: { value: number }[]) => arr.reduce((a, p) => a + p.value, 0) / arr.length;
killedBy: detectBottlenecks (AC6.2) P95: first5 đúng biên 30 tick → vẫn chạy detector (diệt > 30)
statusReason: expected false to be true // Object.is equality

[Survived] MethodExpression
loadtest/report.ts:168:17
   // 3. P95 tăng > 2× so với 5 phút đầu (nghi DB/Kafka)
   const p95Series = seriesOf((t) => t.latency.p95);
   const first5 = p95Series.filter((p) => p.ts - h[0].ts <= 300_000);
-  const last5 = p95Series.slice(-300);
+  const last5 = p95Series;
   if (first5.length >= 30 && last5.length >= 30) {
     const avg = (arr: { value: number }[]) => arr.reduce((a, p) => a + p.value, 0) / arr.length;

[Killed] EqualityOperator
loadtest/report.ts:169:30
   const p95Series = seriesOf((t) => t.latency.p95);
   const first5 = p95Series.filter((p) => p.ts - h[0].ts <= 300_000);
   const last5 = p95Series.slice(-300);
-  if (first5.length >= 30 && last5.length >= 30) {
+  if (first5.length >= 30 && last5.length < 30) {
     const avg = (arr: { value: number }[]) => arr.reduce((a, p) => a + p.value, 0) / arr.length;
     const f = avg(first5);
killedBy: detectBottlenecks (AC6.2) P95 tăng > 2× so với 5 phút đầu → bottleneck latency
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
loadtest/report.ts:169:50
   const p95Series = seriesOf((t) => t.latency.p95);
   const first5 = p95Series.filter((p) => p.ts - h[0].ts <= 300_000);
   const last5 = p95Series.slice(-300);
-  if (first5.length >= 30 && last5.length >= 30) {
-    const avg = (arr: { value: number }[]) => arr.reduce((a, p) => a + p.value, 0) / arr.length;
-    const f = avg(first5);
-    const l = avg(last5);
-    if (f > 50 && l > f * 2) {
-      out.push({
-        level: 'Med',
-        title: `Latency P95 tăng ${(l / Math.max(1, f)).toFixed(1)}× so với 5 phút đầu (${Math.round(f)}ms → ${Math.round(l)}ms)`,
-        detail: 'Nghi ngờ DB/Kafka tích tụ dưới tải — xem chart latency để xác định vùng.',
-        evidence: p95Series.slice(-600),
-      });
-    }
-  }
+  if (first5.length >= 30 && last5.length >= 30) {}
 
   // 4. Worker CPU > 85% (tool-side bottleneck)
killedBy: detectBottlenecks (AC6.2) P95 tăng > 2× so với 5 phút đầu → bottleneck latency
statusReason: expected false to be true // Object.is equality

[Killed] ArrowFunction
loadtest/report.ts:170:58
   const first5 = p95Series.filter((p) => p.ts - h[0].ts <= 300_000);
   const last5 = p95Series.slice(-300);
   if (first5.length >= 30 && last5.length >= 30) {
-    const avg = (arr: { value: number }[]) => arr.reduce((a, p) => a + p.value, 0) / arr.length;
+    const avg = (arr: { value: number }[]) => arr.reduce(() => undefined, 0) / arr.length;
     const f = avg(first5);
     const l = avg(last5);
killedBy: detectBottlenecks (AC6.2) P95 tăng > 2× so với 5 phút đầu → bottleneck latency
statusReason: expected false to be true // Object.is equality

[Killed] ArithmeticOperator
loadtest/report.ts:170:68
   const first5 = p95Series.filter((p) => p.ts - h[0].ts <= 300_000);
   const last5 = p95Series.slice(-300);
   if (first5.length >= 30 && last5.length >= 30) {
-    const avg = (arr: { value: number }[]) => arr.reduce((a, p) => a + p.value, 0) / arr.length;
+    const avg = (arr: { value: number }[]) => arr.reduce((a, p) => a - p.value, 0) / arr.length;
     const f = avg(first5);
     const l = avg(last5);
killedBy: detectBottlenecks (AC6.2) P95 tăng > 2× so với 5 phút đầu → bottleneck latency
statusReason: expected false to be true // Object.is equality

[Killed] LogicalOperator
loadtest/report.ts:173:9
     const avg = (arr: { value: number }[]) => arr.reduce((a, p) => a + p.value, 0) / arr.length;
     const f = avg(first5);
     const l = avg(last5);
-    if (f > 50 && l > f * 2) {
+    if (f > 50 || l > f * 2) {
       out.push({
         level: 'Med',
killedBy: detectBottlenecks (AC6.2) hệ thống khỏe → không có bottleneck
statusReason: expected 1 to be +0 // Object.is equality

[Killed] EqualityOperator
loadtest/report.ts:173:19
     const avg = (arr: { value: number }[]) => arr.reduce((a, p) => a + p.value, 0) / arr.length;
     const f = avg(first5);
     const l = avg(last5);
-    if (f > 50 && l > f * 2) {
+    if (f > 50 && l <= f * 2) {
       out.push({
         level: 'Med',
killedBy: detectBottlenecks (AC6.2) P95 tăng > 2× so với 5 phút đầu → bottleneck latency
statusReason: expected false to be true // Object.is equality

[Killed] ObjectLiteral
loadtest/report.ts:174:16
     const f = avg(first5);
     const l = avg(last5);
     if (f > 50 && l > f * 2) {
-      out.push({
-        level: 'Med',
-        title: `Latency P95 tăng ${(l / Math.max(1, f)).toFixed(1)}× so với 5 phút đầu (${Math.round(f)}ms → ${Math.round(l)}ms)`,
-        detail: 'Nghi ngờ DB/Kafka tích tụ dưới tải — xem chart latency để xác định vùng.',
-        evidence: p95Series.slice(-600),
-      });
+      out.push({});
     }
   }
killedBy: detectBottlenecks (AC6.2) P95 tăng > 2× so với 5 phút đầu → bottleneck latency
statusReason: Cannot read properties of undefined (reading 'includes')

[Survived] StringLiteral
loadtest/report.ts:175:16
     const l = avg(last5);
     if (f > 50 && l > f * 2) {
       out.push({
-        level: 'Med',
+        level: "",
         title: `Latency P95 tăng ${(l / Math.max(1, f)).toFixed(1)}× so với 5 phút đầu (${Math.round(f)}ms → ${Math.round(l)}ms)`,
         detail: 'Nghi ngờ DB/Kafka tích tụ dưới tải — xem chart latency để xác định vùng.',

[Survived] ArithmeticOperator
loadtest/report.ts:176:37
     if (f > 50 && l > f * 2) {
       out.push({
         level: 'Med',
-        title: `Latency P95 tăng ${(l / Math.max(1, f)).toFixed(1)}× so với 5 phút đầu (${Math.round(f)}ms → ${Math.round(l)}ms)`,
+        title: `Latency P95 tăng ${(l * Math.max(1, f)).toFixed(1)}× so với 5 phút đầu (${Math.round(f)}ms → ${Math.round(l)}ms)`,
         detail: 'Nghi ngờ DB/Kafka tích tụ dưới tải — xem chart latency để xác định vùng.',
         evidence: p95Series.slice(-600),

[Survived] MethodExpression
loadtest/report.ts:176:41
     if (f > 50 && l > f * 2) {
       out.push({
         level: 'Med',
-        title: `Latency P95 tăng ${(l / Math.max(1, f)).toFixed(1)}× so với 5 phút đầu (${Math.round(f)}ms → ${Math.round(l)}ms)`,
+        title: `Latency P95 tăng ${(l / Math.min(1, f)).toFixed(1)}× so với 5 phút đầu (${Math.round(f)}ms → ${Math.round(l)}ms)`,
         detail: 'Nghi ngờ DB/Kafka tích tụ dưới tải — xem chart latency để xác định vùng.',
         evidence: p95Series.slice(-600),

[Survived] StringLiteral
loadtest/report.ts:177:17
       out.push({
         level: 'Med',
         title: `Latency P95 tăng ${(l / Math.max(1, f)).toFixed(1)}× so với 5 phút đầu (${Math.round(f)}ms → ${Math.round(l)}ms)`,
-        detail: 'Nghi ngờ DB/Kafka tích tụ dưới tải — xem chart latency để xác định vùng.',
+        detail: "",
         evidence: p95Series.slice(-600),
       });

[Survived] UnaryOperator
loadtest/report.ts:178:35
         level: 'Med',
         title: `Latency P95 tăng ${(l / Math.max(1, f)).toFixed(1)}× so với 5 phút đầu (${Math.round(f)}ms → ${Math.round(l)}ms)`,
         detail: 'Nghi ngờ DB/Kafka tích tụ dưới tải — xem chart latency để xác định vùng.',
-        evidence: p95Series.slice(-600),
+        evidence: p95Series.slice(+600),
       });
     }

[Survived] MethodExpression
loadtest/report.ts:178:19
         level: 'Med',
         title: `Latency P95 tăng ${(l / Math.max(1, f)).toFixed(1)}× so với 5 phút đầu (${Math.round(f)}ms → ${Math.round(l)}ms)`,
         detail: 'Nghi ngờ DB/Kafka tích tụ dưới tải — xem chart latency để xác định vùng.',
-        evidence: p95Series.slice(-600),
+        evidence: p95Series,
       });
     }

[Killed] EqualityOperator
loadtest/report.ts:184:7
   }
 
   // 4. Worker CPU > 85% (tool-side bottleneck)
-  if (input.workerCpu > 85 && input.history.length >= 30) {
+  if (input.workerCpu >= 85 && input.history.length >= 30) {
     out.push({
       level: 'Med',
killedBy: detectBottlenecks (AC6.2) worker CPU biên: 85 → KHÔNG; 85.1 → Med; history < 30 tick → KHÔNG
statusReason: expected true to be false // Object.is equality

[Killed] LogicalOperator
loadtest/report.ts:184:7
   }
 
   // 4. Worker CPU > 85% (tool-side bottleneck)
-  if (input.workerCpu > 85 && input.history.length >= 30) {
+  if (input.workerCpu > 85 || input.history.length >= 30) {
     out.push({
       level: 'Med',
killedBy: detectBottlenecks (AC6.2) hệ thống khỏe → không có bottleneck
statusReason: expected 1 to be +0 // Object.is equality

[Survived] StringLiteral
loadtest/report.ts:188:15
     out.push({
       level: 'Med',
       title: `Worker CPU trung bình ${Math.round(input.workerCpu)}% (> 85%)`,
-      detail: 'Tool-side quá tải — giảm socket/worker hoặc tăng worker count. Số liệu có thể thiếu chính xác.',
+      detail: "",
       evidence: seriesOf((t) => t.workers.cpuAvg).slice(-120),
     });

[Survived] UnaryOperator
loadtest/report.ts:189:57
       level: 'Med',
       title: `Worker CPU trung bình ${Math.round(input.workerCpu)}% (> 85%)`,
       detail: 'Tool-side quá tải — giảm socket/worker hoặc tăng worker count. Số liệu có thể thiếu chính xác.',
-      evidence: seriesOf((t) => t.workers.cpuAvg).slice(-120),
+      evidence: seriesOf((t) => t.workers.cpuAvg).slice(+120),
     });
   }

[Survived] ArrowFunction
loadtest/report.ts:189:26
       level: 'Med',
       title: `Worker CPU trung bình ${Math.round(input.workerCpu)}% (> 85%)`,
       detail: 'Tool-side quá tải — giảm socket/worker hoặc tăng worker count. Số liệu có thể thiếu chính xác.',
-      evidence: seriesOf((t) => t.workers.cpuAvg).slice(-120),
+      evidence: seriesOf(() => undefined).slice(-120),
     });
   }

[Killed] BlockStatement
loadtest/report.ts:197:100
 }
 
 /** Tìm đoạn dài nhất không giảm (cho phép nhiễu ±1) — queue tăng liên tục. */
-function longestNonDecreasingRun(series: { value: number }[]): { seconds: number; growth: number } {
-  let bestLen = 0, bestGrowth = 0;
-  let start = 0;
-  for (let i = 1; i < series.length; i++) {
-    if (series[i].value < series[i - 1].value - 1) {
-      const len = i - start;
-      if (len > bestLen) {
-        bestLen = len;
-        bestGrowth = series[i - 1].value - series[start].value;
-      }
-      start = i;
-    }
-  }
-  const len = series.length - start;
-  if (len > bestLen) {
-    bestLen = len;
-    bestGrowth = series[series.length - 1].value - series[start].value;
-  }
-  return { seconds: bestLen, growth: bestGrowth };
-}
+function longestNonDecreasingRun(series: { value: number }[]): { seconds: number; growth: number } {}
 
 // ─── Export (RE-3) ─────────────────────────────────────────────────────────
killedBy: detectBottlenecks (AC6.2) queue-count tăng liên tục > 5 phút → nghi ngờ matching trần 100/s
statusReason: Cannot read properties of undefined (reading 'seconds')

[Killed] UpdateOperator
loadtest/report.ts:200:38
 function longestNonDecreasingRun(series: { value: number }[]): { seconds: number; growth: number } {
   let bestLen = 0, bestGrowth = 0;
   let start = 0;
-  for (let i = 1; i < series.length; i++) {
+  for (let i = 1; i < series.length; i--) {
     if (series[i].value < series[i - 1].value - 1) {
       const len = i - start;
killedBy: detectBottlenecks (AC6.2) queue-count tăng liên tục > 5 phút → nghi ngờ matching trần 100/s
statusReason: Cannot read properties of undefined (reading 'value')

[Killed] EqualityOperator
loadtest/report.ts:200:19
 function longestNonDecreasingRun(series: { value: number }[]): { seconds: number; growth: number } {
   let bestLen = 0, bestGrowth = 0;
   let start = 0;
-  for (let i = 1; i < series.length; i++) {
+  for (let i = 1; i <= series.length; i++) {
     if (series[i].value < series[i - 1].value - 1) {
       const len = i - start;
killedBy: detectBottlenecks (AC6.2) queue-count tăng liên tục > 5 phút → nghi ngờ matching trần 100/s
statusReason: Cannot read properties of undefined (reading 'value')

[Killed] EqualityOperator
loadtest/report.ts:201:9
   let bestLen = 0, bestGrowth = 0;
   let start = 0;
   for (let i = 1; i < series.length; i++) {
-    if (series[i].value < series[i - 1].value - 1) {
+    if (series[i].value >= series[i - 1].value - 1) {
       const len = i - start;
       if (len > bestLen) {
killedBy: detectBottlenecks (AC6.2) queue-count tăng liên tục > 5 phút → nghi ngờ matching trần 100/s
statusReason: expected undefined to be defined

[Killed] ConditionalExpression
loadtest/report.ts:201:9
   let bestLen = 0, bestGrowth = 0;
   let start = 0;
   for (let i = 1; i < series.length; i++) {
-    if (series[i].value < series[i - 1].value - 1) {
+    if (true) {
       const len = i - start;
       if (len > bestLen) {
killedBy: detectBottlenecks (AC6.2) queue-count tăng liên tục > 5 phút → nghi ngờ matching trần 100/s
statusReason: expected undefined to be defined

[NoCoverage] ArithmeticOperator
loadtest/report.ts:202:19
   let start = 0;
   for (let i = 1; i < series.length; i++) {
     if (series[i].value < series[i - 1].value - 1) {
-      const len = i - start;
+      const len = i + start;
       if (len > bestLen) {
         bestLen = len;

[NoCoverage] ConditionalExpression
loadtest/report.ts:203:11
   for (let i = 1; i < series.length; i++) {
     if (series[i].value < series[i - 1].value - 1) {
       const len = i - start;
-      if (len > bestLen) {
+      if (true) {
         bestLen = len;
         bestGrowth = series[i - 1].value - series[start].value;

[NoCoverage] EqualityOperator
loadtest/report.ts:203:11
   for (let i = 1; i < series.length; i++) {
     if (series[i].value < series[i - 1].value - 1) {
       const len = i - start;
-      if (len > bestLen) {
+      if (len >= bestLen) {
         bestLen = len;
         bestGrowth = series[i - 1].value - series[start].value;

[NoCoverage] ArithmeticOperator
loadtest/report.ts:205:29
       const len = i - start;
       if (len > bestLen) {
         bestLen = len;
-        bestGrowth = series[i - 1].value - series[start].value;
+        bestGrowth = series[i + 1].value - series[start].value;
       }
       start = i;

[NoCoverage] ArithmeticOperator
loadtest/report.ts:205:22
       const len = i - start;
       if (len > bestLen) {
         bestLen = len;
-        bestGrowth = series[i - 1].value - series[start].value;
+        bestGrowth = series[i - 1].value + series[start].value;
       }
       start = i;

[Survived] ArithmeticOperator
loadtest/report.ts:210:15
       start = i;
     }
   }
-  const len = series.length - start;
+  const len = series.length + start;
   if (len > bestLen) {
     bestLen = len;

[Killed] BlockStatement
loadtest/report.ts:211:22
     }
   }
   const len = series.length - start;
-  if (len > bestLen) {
-    bestLen = len;
-    bestGrowth = series[series.length - 1].value - series[start].value;
-  }
+  if (len > bestLen) {}
   return { seconds: bestLen, growth: bestGrowth };
 }
killedBy: detectBottlenecks (AC6.2) queue-count tăng liên tục > 5 phút → nghi ngờ matching trần 100/s
statusReason: expected undefined to be defined

[Killed] EqualityOperator
loadtest/report.ts:211:7
     }
   }
   const len = series.length - start;
-  if (len > bestLen) {
+  if (len <= bestLen) {
     bestLen = len;
     bestGrowth = series[series.length - 1].value - series[start].value;
killedBy: detectBottlenecks (AC6.2) queue-count tăng liên tục > 5 phút → nghi ngờ matching trần 100/s
statusReason: expected undefined to be defined

[Killed] ArithmeticOperator
loadtest/report.ts:213:18
   const len = series.length - start;
   if (len > bestLen) {
     bestLen = len;
-    bestGrowth = series[series.length - 1].value - series[start].value;
+    bestGrowth = series[series.length - 1].value + series[start].value;
   }
   return { seconds: bestLen, growth: bestGrowth };
killedBy: detectBottlenecks (AC6.2) queue bottleneck: growth biên 50 → KHÔNG; 51 → Med; 600s → High
statusReason: expected true to be false // Object.is equality

[Killed] ArithmeticOperator
loadtest/report.ts:213:25
   const len = series.length - start;
   if (len > bestLen) {
     bestLen = len;
-    bestGrowth = series[series.length - 1].value - series[start].value;
+    bestGrowth = series[series.length + 1].value - series[start].value;
   }
   return { seconds: bestLen, growth: bestGrowth };
killedBy: detectBottlenecks (AC6.2) queue-count tăng liên tục > 5 phút → nghi ngờ matching trần 100/s
statusReason: Cannot read properties of undefined (reading 'value')

[Killed] BlockStatement
loadtest/report.ts:220:39
 
 // ─── Export (RE-3) ─────────────────────────────────────────────────────────
 
-function formatMs(ms: number): string {
-  if (ms >= 1000) return (ms / 1000).toFixed(2) + 's';
-  return Math.round(ms) + 'ms';
-}
+function formatMs(ms: number): string {}
 
 export function reportToMarkdown(r: RunReport): string {
killedBy: reportToMarkdown — snapshot toàn bộ output (diệt string mutant) markdown đầy đủ ổn định (snapshot)
statusReason: Snapshot `reportToMarkdown — snapshot toàn bộ output (diệt string mutant) > markdown đầy đủ ổn định (snapshot) 1` mismatched

[Killed] EqualityOperator
loadtest/report.ts:221:7
 // ─── Export (RE-3) ─────────────────────────────────────────────────────────
 
 function formatMs(ms: number): string {
-  if (ms >= 1000) return (ms / 1000).toFixed(2) + 's';
+  if (ms < 1000) return (ms / 1000).toFixed(2) + 's';
   return Math.round(ms) + 'ms';
 }
killedBy: reportToMarkdown — snapshot toàn bộ output (diệt string mutant) markdown đầy đủ ổn định (snapshot)
statusReason: Snapshot `reportToMarkdown — snapshot toàn bộ output (diệt string mutant) > markdown đầy đủ ổn định (snapshot) 1` mismatched

[Killed] ConditionalExpression
loadtest/report.ts:221:7
 // ─── Export (RE-3) ─────────────────────────────────────────────────────────
 
 function formatMs(ms: number): string {
-  if (ms >= 1000) return (ms / 1000).toFixed(2) + 's';
+  if (true) return (ms / 1000).toFixed(2) + 's';
   return Math.round(ms) + 'ms';
 }
killedBy: reportToMarkdown — snapshot toàn bộ output (diệt string mutant) markdown đầy đủ ổn định (snapshot)
statusReason: Snapshot `reportToMarkdown — snapshot toàn bộ output (diệt string mutant) > markdown đầy đủ ổn định (snapshot) 1` mismatched

[Killed] StringLiteral
loadtest/report.ts:230:69
   const lines: string[] = [
     `# MAYogu LoadTest Report — ${r.runId}`,
     '',
-    `**Status**: ${r.status}${r.stopReason ? ` — ${r.stopReason}` : ''}`,
+    `**Status**: ${r.status}${r.stopReason ? ` — ${r.stopReason}` : "Stryker was here!"}`,
     `**Thời gian**: ${new Date(r.startAt).toISOString()} → ${new Date(r.endAt).toISOString()} (thực tế ${Math.round(r.durationSec / 60)}m ${r.durationSec % 60}s)`,
     '',
killedBy: reportToMarkdown — snapshot toàn bộ output (diệt string mutant) markdown đầy đủ ổn định (snapshot)
statusReason: Snapshot `reportToMarkdown — snapshot toàn bộ output (diệt string mutant) > markdown đầy đủ ổn định (snapshot) 1` mismatched

[Killed] StringLiteral
loadtest/report.ts:230:46
   const lines: string[] = [
     `# MAYogu LoadTest Report — ${r.runId}`,
     '',
-    `**Status**: ${r.status}${r.stopReason ? ` — ${r.stopReason}` : ''}`,
+    `**Status**: ${r.status}${r.stopReason ? `` : ''}`,
     `**Thời gian**: ${new Date(r.startAt).toISOString()} → ${new Date(r.endAt).toISOString()} (thực tế ${Math.round(r.durationSec / 60)}m ${r.durationSec % 60}s)`,
     '',
killedBy: reportToMarkdown — snapshot toàn bộ output (diệt string mutant) markdown với status error + stopReason + bottleneck + NO_POST_FIXTURE (snapshot)
statusReason: Snapshot `reportToMarkdown — snapshot toàn bộ output (diệt string mutant) > markdown với status error + stopReason + bottleneck + NO_POST_FIXTURE (snapshot) 1` mismatched

[Killed] ArithmeticOperator
loadtest/report.ts:231:117
     `# MAYogu LoadTest Report — ${r.runId}`,
     '',
     `**Status**: ${r.status}${r.stopReason ? ` — ${r.stopReason}` : ''}`,
-    `**Thời gian**: ${new Date(r.startAt).toISOString()} → ${new Date(r.endAt).toISOString()} (thực tế ${Math.round(r.durationSec / 60)}m ${r.durationSec % 60}s)`,
+    `**Thời gian**: ${new Date(r.startAt).toISOString()} → ${new Date(r.endAt).toISOString()} (thực tế ${Math.round(r.durationSec * 60)}m ${r.durationSec % 60}s)`,
     '',
     '## Summary',
killedBy: reportToMarkdown — snapshot toàn bộ output (diệt string mutant) markdown đầy đủ ổn định (snapshot)
statusReason: Snapshot `reportToMarkdown — snapshot toàn bộ output (diệt string mutant) > markdown đầy đủ ổn định (snapshot) 1` mismatched

[Killed] ArithmeticOperator
loadtest/report.ts:231:141
     `# MAYogu LoadTest Report — ${r.runId}`,
     '',
     `**Status**: ${r.status}${r.stopReason ? ` — ${r.stopReason}` : ''}`,
-    `**Thời gian**: ${new Date(r.startAt).toISOString()} → ${new Date(r.endAt).toISOString()} (thực tế ${Math.round(r.durationSec / 60)}m ${r.durationSec % 60}s)`,
+    `**Thời gian**: ${new Date(r.startAt).toISOString()} → ${new Date(r.endAt).toISOString()} (thực tế ${Math.round(r.durationSec / 60)}m ${r.durationSec * 60}s)`,
     '',
     '## Summary',
killedBy: reportToMarkdown — snapshot toàn bộ output (diệt string mutant) markdown đầy đủ ổn định (snapshot)
statusReason: Snapshot `reportToMarkdown — snapshot toàn bộ output (diệt string mutant) > markdown đầy đủ ổn định (snapshot) 1` mismatched

[Killed] StringLiteral
loadtest/report.ts:232:5
     '',
     `**Status**: ${r.status}${r.stopReason ? ` — ${r.stopReason}` : ''}`,
     `**Thời gian**: ${new Date(r.startAt).toISOString()} → ${new Date(r.endAt).toISOString()} (thực tế ${Math.round(r.durationSec / 60)}m ${r.durationSec % 60}s)`,
-    '',
+    "Stryker was here!",
     '## Summary',
     '',
killedBy: reportToMarkdown — snapshot toàn bộ output (diệt string mutant) markdown đầy đủ ổn định (snapshot)
statusReason: Snapshot `reportToMarkdown — snapshot toàn bộ output (diệt string mutant) > markdown đầy đủ ổn định (snapshot) 1` mismatched

[Killed] StringLiteral
loadtest/report.ts:234:5
     `**Thời gian**: ${new Date(r.startAt).toISOString()} → ${new Date(r.endAt).toISOString()} (thực tế ${Math.round(r.durationSec / 60)}m ${r.durationSec % 60}s)`,
     '',
     '## Summary',
-    '',
+    "Stryker was here!",
     `| Metric | Giá trị |`,
     `|---|---|`,
killedBy: reportToMarkdown — snapshot toàn bộ output (diệt string mutant) markdown đầy đủ ổn định (snapshot)
statusReason: Snapshot `reportToMarkdown — snapshot toàn bộ output (diệt string mutant) > markdown đầy đủ ổn định (snapshot) 1` mismatched

[Killed] StringLiteral
loadtest/report.ts:236:5
     '## Summary',
     '',
     `| Metric | Giá trị |`,
-    `|---|---|`,
+    ``,
     `| User đã tạo | ${s.usersCreated.toLocaleString()} |`,
     `| Connect max | ${s.usersConnectedMax.toLocaleString()} |`,
killedBy: reportToMarkdown — snapshot toàn bộ output (diệt string mutant) markdown đầy đủ ổn định (snapshot)
statusReason: Snapshot `reportToMarkdown — snapshot toàn bộ output (diệt string mutant) > markdown đầy đủ ổn định (snapshot) 1` mismatched

[Killed] StringLiteral
loadtest/report.ts:245:5
     `| Throughput avg / peak | ${s.throughputAvg}/s · ${s.throughputPeak}/s |`,
     `| Chat echo rate | ${s.echoRate}% (${s.echoOk}/${s.echoSent}) |`,
     `| Queue peak | ${s.queueCountPeak} |`,
-    '',
+    "Stryker was here!",
     ...(r.noPostFixtureSkipped && r.noPostFixtureSkipped > 0
       ? [
killedBy: reportToMarkdown — snapshot toàn bộ output (diệt string mutant) markdown đầy đủ ổn định (snapshot)
statusReason: Snapshot `reportToMarkdown — snapshot toàn bộ output (diệt string mutant) > markdown đầy đủ ổn định (snapshot) 1` mismatched

[Killed] ConditionalExpression
loadtest/report.ts:246:9
     `| Chat echo rate | ${s.echoRate}% (${s.echoOk}/${s.echoSent}) |`,
     `| Queue peak | ${s.queueCountPeak} |`,
     '',
-    ...(r.noPostFixtureSkipped && r.noPostFixtureSkipped > 0
+    ...(false
       ? [
           '## Không có post fixture — bỏ qua bước đọc feed',
killedBy: reportToMarkdown — NO_POST_FIXTURE (T-07/S-12) báo rõ section "Không có post fixture" khi feed trống
statusReason: expected '# MAYogu LoadTest Report — lt-test1\n…' to contain 'Không có post fixture — bỏ qua bước đ…'

[Killed] ConditionalExpression
loadtest/report.ts:246:9
     `| Chat echo rate | ${s.echoRate}% (${s.echoOk}/${s.echoSent}) |`,
     `| Queue peak | ${s.queueCountPeak} |`,
     '',
-    ...(r.noPostFixtureSkipped && r.noPostFixtureSkipped > 0
+    ...(true
       ? [
           '## Không có post fixture — bỏ qua bước đọc feed',
killedBy: reportToMarkdown — NO_POST_FIXTURE (T-07/S-12) không có NO_POST_FIXTURE → không thêm section
statusReason: expected '# MAYogu LoadTest Report — lt-test1\n…' not to contain 'Không có post fixture'

[Killed] StringLiteral
loadtest/report.ts:254:5
           '',
         ]
       : []),
-    '## Latency theo action',
+    "",
     '',
     '| action | p50 | p95 | p99 | count |',
killedBy: reportToMarkdown — snapshot toàn bộ output (diệt string mutant) markdown đầy đủ ổn định (snapshot)
statusReason: Snapshot `reportToMarkdown — snapshot toàn bộ output (diệt string mutant) > markdown đầy đủ ổn định (snapshot) 1` mismatched
