[Killed] StringLiteral
loadtest/report.ts:256:5
       : []),
     '## Latency theo action',
     '',
-    '| action | p50 | p95 | p99 | count |',
+    "",
     '|---|---|---|---|---|',
     ...r.perAction.map(
killedBy: reportToMarkdown — snapshot toàn bộ output (diệt string mutant) markdown đầy đủ ổn định (snapshot)
statusReason: Snapshot `reportToMarkdown — snapshot toàn bộ output (diệt string mutant) > markdown đầy đủ ổn định (snapshot) 1` mismatched

[Killed] ArrowFunction
loadtest/report.ts:259:7
     '| action | p50 | p95 | p99 | count |',
     '|---|---|---|---|---|',
     ...r.perAction.map(
-      (a) => `| ${a.action} | ${formatMs(a.p50Ms)} | ${formatMs(a.p95Ms)} | ${formatMs(a.p99Ms)} | ${a.count.toLocaleString()} |`,
+      () => undefined,
     ),
     '',
killedBy: reportToMarkdown — snapshot toàn bộ output (diệt string mutant) markdown đầy đủ ổn định (snapshot)
statusReason: Snapshot `reportToMarkdown — snapshot toàn bộ output (diệt string mutant) > markdown đầy đủ ổn định (snapshot) 1` mismatched

[Killed] StringLiteral
loadtest/report.ts:262:5
       (a) => `| ${a.action} | ${formatMs(a.p50Ms)} | ${formatMs(a.p95Ms)} | ${formatMs(a.p99Ms)} | ${a.count.toLocaleString()} |`,
     ),
     '',
-    '## Bottleneck candidates',
+    "",
     '',
     ...(r.bottlenecks.length
killedBy: reportToMarkdown — snapshot toàn bộ output (diệt string mutant) markdown đầy đủ ổn định (snapshot)
statusReason: Snapshot `reportToMarkdown — snapshot toàn bộ output (diệt string mutant) > markdown đầy đủ ổn định (snapshot) 1` mismatched

[NoCoverage] ArithmeticOperator
loadtest/report.ts:265:40
     '## Bottleneck candidates',
     '',
     ...(r.bottlenecks.length
-      ? r.bottlenecks.map((b, i) => `${i + 1}. **[${b.level}]** ${b.title}\n   ${b.detail}`)
+      ? r.bottlenecks.map((b, i) => `${i - 1}. **[${b.level}]** ${b.title}\n   ${b.detail}`)
       : ['Không phát hiện bottleneck vượt ngưỡng.']),
     '',

[NoCoverage] ArrowFunction
loadtest/report.ts:265:27
     '## Bottleneck candidates',
     '',
     ...(r.bottlenecks.length
-      ? r.bottlenecks.map((b, i) => `${i + 1}. **[${b.level}]** ${b.title}\n   ${b.detail}`)
+      ? r.bottlenecks.map(() => undefined)
       : ['Không phát hiện bottleneck vượt ngưỡng.']),
     '',

[Killed] StringLiteral
loadtest/report.ts:268:5
       ? r.bottlenecks.map((b, i) => `${i + 1}. **[${b.level}]** ${b.title}\n   ${b.detail}`)
       : ['Không phát hiện bottleneck vượt ngưỡng.']),
     '',
-    '## Top errors',
+    "",
     '',
     ...(r.errors.length ? r.errors.map((e) => `- \`${e.code}\`: ${e.count.toLocaleString()}`) : ['Không có lỗi.']),
killedBy: reportToMarkdown — snapshot toàn bộ output (diệt string mutant) markdown đầy đủ ổn định (snapshot)
statusReason: Snapshot `reportToMarkdown — snapshot toàn bộ output (diệt string mutant) > markdown đầy đủ ổn định (snapshot) 1` mismatched

[Killed] StringLiteral
loadtest/report.ts:269:5
       : ['Không phát hiện bottleneck vượt ngưỡng.']),
     '',
     '## Top errors',
-    '',
+    "Stryker was here!",
     ...(r.errors.length ? r.errors.map((e) => `- \`${e.code}\`: ${e.count.toLocaleString()}`) : ['Không có lỗi.']),
     '',
killedBy: reportToMarkdown — snapshot toàn bộ output (diệt string mutant) markdown đầy đủ ổn định (snapshot)
statusReason: Snapshot `reportToMarkdown — snapshot toàn bộ output (diệt string mutant) > markdown đầy đủ ổn định (snapshot) 1` mismatched

[Killed] ArrowFunction
loadtest/report.ts:270:40
     '',
     '## Top errors',
     '',
-    ...(r.errors.length ? r.errors.map((e) => `- \`${e.code}\`: ${e.count.toLocaleString()}`) : ['Không có lỗi.']),
+    ...(r.errors.length ? r.errors.map(() => undefined) : ['Không có lỗi.']),
     '',
     '## Cấu hình run',
killedBy: reportToMarkdown — snapshot toàn bộ output (diệt string mutant) markdown đầy đủ ổn định (snapshot)
statusReason: Snapshot `reportToMarkdown — snapshot toàn bộ output (diệt string mutant) > markdown đầy đủ ổn định (snapshot) 1` mismatched

[Killed] ArrowFunction
loadtest/report.ts:285:26
 /** CSV raw metrics 1s — cần history, build riêng. */
 export function ticksToCsv(runId: string, ticks: LoadTestTick[]): string {
-  const rows = ticks.map((t) =>
-    [
-      t.ts, t.phase, t.elapsedSec,
-      t.counters.usersCreated, t.counters.usersConnected, t.counters.usersActive,
-      t.counters.usersQueued, t.counters.usersInRoom,
-      t.counters.actionsTotal, t.counters.successTotal, t.counters.failTotal,
-      t.counters.echoOk, t.counters.echoSent,
-      t.counters.queueCount, t.counters.roomCount,
-      t.rates.successRate, t.rates.echoRate,
-      t.latency.p50, t.latency.p95, t.latency.p99,
-      t.workers.alive, t.workers.cpuAvg,
-      t.server.wsConnections,
-    ].join(','),
+  const rows = ticks.map(() => undefined,
   );
   return header + rows.join('\n');
killedBy: ticksToCsv — snapshot (T-11) CSV đầy đủ header + row ổn định (snapshot)
statusReason: Snapshot `ticksToCsv — snapshot (T-11) > CSV đầy đủ header + row ổn định (snapshot) 1` mismatched

[Killed] ArrayDeclaration
loadtest/report.ts:286:5
 export function ticksToCsv(runId: string, ticks: LoadTestTick[]): string {
   const rows = ticks.map((t) =>
-    [
-      t.ts, t.phase, t.elapsedSec,
-      t.counters.usersCreated, t.counters.usersConnected, t.counters.usersActive,
-      t.counters.usersQueued, t.counters.usersInRoom,
-      t.counters.actionsTotal, t.counters.successTotal, t.counters.failTotal,
-      t.counters.echoOk, t.counters.echoSent,
-      t.counters.queueCount, t.counters.roomCount,
-      t.rates.successRate, t.rates.echoRate,
-      t.latency.p50, t.latency.p95, t.latency.p99,
-      t.workers.alive, t.workers.cpuAvg,
-      t.server.wsConnections,
-    ].join(','),
+    [].join(','),
   );
   return header + rows.join('\n');
killedBy: ticksToCsv — snapshot (T-11) CSV đầy đủ header + row ổn định (snapshot)
statusReason: Snapshot `ticksToCsv — snapshot (T-11) > CSV đầy đủ header + row ổn định (snapshot) 1` mismatched

[Killed] ArithmeticOperator
loadtest/report.ts:299:10
       t.server.wsConnections,
     ].join(','),
   );
-  return header + rows.join('\n');
+  return header - rows.join('\n');
 }
 
killedBy: ticksToCsv — snapshot (T-11) CSV đầy đủ header + row ổn định (snapshot)
statusReason: Snapshot `ticksToCsv — snapshot (T-11) > CSV đầy đủ header + row ổn định (snapshot) 1` mismatched

[Survived] StringLiteral
loadtest/report.ts:299:29
       t.server.wsConnections,
     ].join(','),
   );
-  return header + rows.join('\n');
+  return header + rows.join("");
 }
 

[Killed] BlockStatement
loadtest/report.ts:303:91
 }
 
 /** Lưu report ra docs/loadtest-reports/{runId}/ — JSON auto, MD/CSV khi export. */
-export function saveReportFiles(r: RunReport, ticks: LoadTestTick[], dir: string): string {
-  try {
-    const d = path.join(dir, r.runId);
-    fs.mkdirSync(d, { recursive: true });
-    fs.writeFileSync(path.join(d, `report-${r.runId}.json`), JSON.stringify(r, null, 2), 'utf8');
-    fs.writeFileSync(path.join(d, `report-${r.runId}.md`), reportToMarkdown(r), 'utf8');
-    fs.writeFileSync(path.join(d, `metrics-${r.runId}.csv`), ticksToCsv(r.runId, ticks), 'utf8');
-    ltLog.info(`report saved: ${d}`);
-    return d;
-  } catch (e) {
-    ltLog.warn(`Không lưu được report: ${String(e)}`);
-    return '';
-  }
-}
+export function saveReportFiles(r: RunReport, ticks: LoadTestTick[], dir: string): string {}
 
 export type { RunPhase };
killedBy: saveReportFiles (RE-3, T-11) ghi JSON + MD + CSV vào dir/{runId}/, trả về dir
statusReason: expected undefined to be 'C:\Users\Admin\AppData\Local\Temp\lt-…' // Object.is equality

[Killed] BlockStatement
loadtest/report.ts:304:7
 
 /** Lưu report ra docs/loadtest-reports/{runId}/ — JSON auto, MD/CSV khi export. */
 export function saveReportFiles(r: RunReport, ticks: LoadTestTick[], dir: string): string {
-  try {
-    const d = path.join(dir, r.runId);
-    fs.mkdirSync(d, { recursive: true });
-    fs.writeFileSync(path.join(d, `report-${r.runId}.json`), JSON.stringify(r, null, 2), 'utf8');
-    fs.writeFileSync(path.join(d, `report-${r.runId}.md`), reportToMarkdown(r), 'utf8');
-    fs.writeFileSync(path.join(d, `metrics-${r.runId}.csv`), ticksToCsv(r.runId, ticks), 'utf8');
-    ltLog.info(`report saved: ${d}`);
-    return d;
-  } catch (e) {
+  try {} catch (e) {
     ltLog.warn(`Không lưu được report: ${String(e)}`);
     return '';
killedBy: saveReportFiles (RE-3, T-11) ghi JSON + MD + CSV vào dir/{runId}/, trả về dir
statusReason: expected undefined to be 'C:\Users\Admin\AppData\Local\Temp\lt-…' // Object.is equality

[Survived] BooleanLiteral
loadtest/report.ts:306:34
 export function saveReportFiles(r: RunReport, ticks: LoadTestTick[], dir: string): string {
   try {
     const d = path.join(dir, r.runId);
-    fs.mkdirSync(d, { recursive: true });
+    fs.mkdirSync(d, { recursive: false });
     fs.writeFileSync(path.join(d, `report-${r.runId}.json`), JSON.stringify(r, null, 2), 'utf8');
     fs.writeFileSync(path.join(d, `report-${r.runId}.md`), reportToMarkdown(r), 'utf8');

[Survived] ObjectLiteral
loadtest/report.ts:306:21
 export function saveReportFiles(r: RunReport, ticks: LoadTestTick[], dir: string): string {
   try {
     const d = path.join(dir, r.runId);
-    fs.mkdirSync(d, { recursive: true });
+    fs.mkdirSync(d, {});
     fs.writeFileSync(path.join(d, `report-${r.runId}.json`), JSON.stringify(r, null, 2), 'utf8');
     fs.writeFileSync(path.join(d, `report-${r.runId}.md`), reportToMarkdown(r), 'utf8');

[Survived] StringLiteral
loadtest/report.ts:307:90
   try {
     const d = path.join(dir, r.runId);
     fs.mkdirSync(d, { recursive: true });
-    fs.writeFileSync(path.join(d, `report-${r.runId}.json`), JSON.stringify(r, null, 2), 'utf8');
+    fs.writeFileSync(path.join(d, `report-${r.runId}.json`), JSON.stringify(r, null, 2), "");
     fs.writeFileSync(path.join(d, `report-${r.runId}.md`), reportToMarkdown(r), 'utf8');
     fs.writeFileSync(path.join(d, `metrics-${r.runId}.csv`), ticksToCsv(r.runId, ticks), 'utf8');

[Survived] StringLiteral
loadtest/report.ts:309:90
     fs.mkdirSync(d, { recursive: true });
     fs.writeFileSync(path.join(d, `report-${r.runId}.json`), JSON.stringify(r, null, 2), 'utf8');
     fs.writeFileSync(path.join(d, `report-${r.runId}.md`), reportToMarkdown(r), 'utf8');
-    fs.writeFileSync(path.join(d, `metrics-${r.runId}.csv`), ticksToCsv(r.runId, ticks), 'utf8');
+    fs.writeFileSync(path.join(d, `metrics-${r.runId}.csv`), ticksToCsv(r.runId, ticks), "");
     ltLog.info(`report saved: ${d}`);
     return d;

[Killed] BlockStatement
loadtest/report.ts:312:15
     fs.writeFileSync(path.join(d, `metrics-${r.runId}.csv`), ticksToCsv(r.runId, ticks), 'utf8');
     ltLog.info(`report saved: ${d}`);
     return d;
-  } catch (e) {
-    ltLog.warn(`Không lưu được report: ${String(e)}`);
-    return '';
-  }
+  } catch (e) {}
 }
 
killedBy: saveReportFiles (RE-3, T-11) thư mục không ghi được (path là FILE) → trả về "" (không throw)
statusReason: expected undefined to be '' // Object.is equality

[Survived] StringLiteral
loadtest/report.ts:313:16
     ltLog.info(`report saved: ${d}`);
     return d;
   } catch (e) {
-    ltLog.warn(`Không lưu được report: ${String(e)}`);
+    ltLog.warn(``);
     return '';
   }
