[Killed] BlockStatement
loadtest/metrics.ts:26:48
   private count = 0;
   private sumMs = 0;
 
-  constructor(bucketCount = HISTOGRAM_BUCKETS) {
-    this.buckets = new Array(bucketCount).fill(0);
-  }
+  constructor(bucketCount = HISTOGRAM_BUCKETS) {}
 
   private static bucketIndex(valueMs: number): number {
killedBy: coordinator-state — aggregateTicks gộp counters + histogram từ nhiều worker
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] BlockStatement
loadtest/metrics.ts:30:55
     this.buckets = new Array(bucketCount).fill(0);
   }
 
-  private static bucketIndex(valueMs: number): number {
-    const logMin = Math.log(HISTOGRAM_MIN_MS);
-    const logMax = Math.log(HISTOGRAM_MAX_MS);
-    const span = logMax - logMin;
-    const idx = Math.floor(((Math.log(Math.max(valueMs, HISTOGRAM_MIN_MS)) - logMin) / span) * HISTOGRAM_BUCKETS);
-    return Math.min(HISTOGRAM_BUCKETS - 1, Math.max(0, idx));
-  }
+  private static bucketIndex(valueMs: number): number {}
 
   add(valueMs: number) {
killedBy: buildReport per-action success rate dùng ok/fail thật theo action (AC6.1)
statusReason: expected +0 to be 100 // Object.is equality

[Survived] ArithmeticOperator
loadtest/metrics.ts:33:18
   private static bucketIndex(valueMs: number): number {
     const logMin = Math.log(HISTOGRAM_MIN_MS);
     const logMax = Math.log(HISTOGRAM_MAX_MS);
-    const span = logMax - logMin;
+    const span = logMax + logMin;
     const idx = Math.floor(((Math.log(Math.max(valueMs, HISTOGRAM_MIN_MS)) - logMin) / span) * HISTOGRAM_BUCKETS);
     return Math.min(HISTOGRAM_BUCKETS - 1, Math.max(0, idx));

[Killed] ArithmeticOperator
loadtest/metrics.ts:34:28
     const logMin = Math.log(HISTOGRAM_MIN_MS);
     const logMax = Math.log(HISTOGRAM_MAX_MS);
     const span = logMax - logMin;
-    const idx = Math.floor(((Math.log(Math.max(valueMs, HISTOGRAM_MIN_MS)) - logMin) / span) * HISTOGRAM_BUCKETS);
+    const idx = Math.floor((Math.log(Math.max(valueMs, HISTOGRAM_MIN_MS)) - logMin) / span / HISTOGRAM_BUCKETS);
     return Math.min(HISTOGRAM_BUCKETS - 1, Math.max(0, idx));
   }
killedBy: reportToMarkdown — snapshot toàn bộ output (diệt string mutant) markdown đầy đủ ổn định (snapshot)
statusReason: Snapshot `reportToMarkdown — snapshot toàn bộ output (diệt string mutant) > markdown đầy đủ ổn định (snapshot) 1` mismatched

[Killed] MethodExpression
loadtest/metrics.ts:34:39
     const logMin = Math.log(HISTOGRAM_MIN_MS);
     const logMax = Math.log(HISTOGRAM_MAX_MS);
     const span = logMax - logMin;
-    const idx = Math.floor(((Math.log(Math.max(valueMs, HISTOGRAM_MIN_MS)) - logMin) / span) * HISTOGRAM_BUCKETS);
+    const idx = Math.floor(((Math.log(Math.min(valueMs, HISTOGRAM_MIN_MS)) - logMin) / span) * HISTOGRAM_BUCKETS);
     return Math.min(HISTOGRAM_BUCKETS - 1, Math.max(0, idx));
   }
killedBy: reportToMarkdown — snapshot toàn bộ output (diệt string mutant) markdown đầy đủ ổn định (snapshot)
statusReason: Snapshot `reportToMarkdown — snapshot toàn bộ output (diệt string mutant) > markdown đầy đủ ổn định (snapshot) 1` mismatched

[Killed] MethodExpression
loadtest/metrics.ts:35:44
     const logMax = Math.log(HISTOGRAM_MAX_MS);
     const span = logMax - logMin;
     const idx = Math.floor(((Math.log(Math.max(valueMs, HISTOGRAM_MIN_MS)) - logMin) / span) * HISTOGRAM_BUCKETS);
-    return Math.min(HISTOGRAM_BUCKETS - 1, Math.max(0, idx));
+    return Math.min(HISTOGRAM_BUCKETS - 1, Math.min(0, idx));
   }
 
killedBy: reportToMarkdown — snapshot toàn bộ output (diệt string mutant) markdown đầy đủ ổn định (snapshot)
statusReason: Snapshot `reportToMarkdown — snapshot toàn bộ output (diệt string mutant) > markdown đầy đủ ổn định (snapshot) 1` mismatched

[Killed] ArithmeticOperator
loadtest/metrics.ts:35:21
     const logMax = Math.log(HISTOGRAM_MAX_MS);
     const span = logMax - logMin;
     const idx = Math.floor(((Math.log(Math.max(valueMs, HISTOGRAM_MIN_MS)) - logMin) / span) * HISTOGRAM_BUCKETS);
-    return Math.min(HISTOGRAM_BUCKETS - 1, Math.max(0, idx));
+    return Math.min(HISTOGRAM_BUCKETS + 1, Math.max(0, idx));
   }
 
killedBy: BucketedHistogram add(0) / giá trị dưới min → bucket 0; trên max → bucket cuối (clamp chính xác)
statusReason: expected +0 to be 1 // Object.is equality

[Killed] BlockStatement
loadtest/metrics.ts:38:24
     return Math.min(HISTOGRAM_BUCKETS - 1, Math.max(0, idx));
   }
 
-  add(valueMs: number) {
-    const idx = BucketedHistogram.bucketIndex(valueMs);
-    this.buckets[idx] += 1;
-    this.count += 1;
-    this.sumMs += valueMs;
-  }
+  add(valueMs: number) {}
 
   /** Giá trị đại diện giữa bucket (log-mid) — dùng ước lượng sum khi merge nguồn thô. */
killedBy: buildReport per-action success rate dùng ok/fail thật theo action (AC6.1)
statusReason: expected +0 to be 100 // Object.is equality

[Killed] AssignmentOperator
loadtest/metrics.ts:40:5
 
   add(valueMs: number) {
     const idx = BucketedHistogram.bucketIndex(valueMs);
-    this.buckets[idx] += 1;
+    this.buckets[idx] -= 1;
     this.count += 1;
     this.sumMs += valueMs;
killedBy: BucketedHistogram P50/P95/P99 đúng với dữ liệu cố định
statusReason: expected 60000 to be less than or equal to 160

[Killed] AssignmentOperator
loadtest/metrics.ts:41:5
   add(valueMs: number) {
     const idx = BucketedHistogram.bucketIndex(valueMs);
     this.buckets[idx] += 1;
-    this.count += 1;
+    this.count -= 1;
     this.sumMs += valueMs;
   }
killedBy: BucketedHistogram P50/P95/P99 đúng với dữ liệu cố định
statusReason: expected 1 to be greater than or equal to 50

[Killed] AssignmentOperator
loadtest/metrics.ts:42:5
     const idx = BucketedHistogram.bucketIndex(valueMs);
     this.buckets[idx] += 1;
     this.count += 1;
-    this.sumMs += valueMs;
+    this.sumMs -= valueMs;
   }
 
killedBy: BucketedHistogram P50/P95/P99 đúng với dữ liệu cố định
statusReason: expected -150 to be 150 // Object.is equality

[Killed] BlockStatement
loadtest/metrics.ts:46:51
   }
 
   /** Giá trị đại diện giữa bucket (log-mid) — dùng ước lượng sum khi merge nguồn thô. */
-  private static bucketMidMs(idx: number): number {
-    const frac = (idx + 0.5) / HISTOGRAM_BUCKETS;
-    const logMin = Math.log(HISTOGRAM_MIN_MS);
-    const logMax = Math.log(HISTOGRAM_MAX_MS);
-    return Math.exp(logMin + frac * (logMax - logMin));
-  }
+  private static bucketMidMs(idx: number): number {}
 
   merge(other: { buckets: number[] } | BucketedHistogram) {
killedBy: BucketedHistogram merge từ plain object { buckets } — count/sum ước lượng qua mid-bucket
statusReason: expected NaN to be greater than 10

[Killed] ArithmeticOperator
loadtest/metrics.ts:47:18
 
   /** Giá trị đại diện giữa bucket (log-mid) — dùng ước lượng sum khi merge nguồn thô. */
   private static bucketMidMs(idx: number): number {
-    const frac = (idx + 0.5) / HISTOGRAM_BUCKETS;
+    const frac = (idx + 0.5) * HISTOGRAM_BUCKETS;
     const logMin = Math.log(HISTOGRAM_MIN_MS);
     const logMax = Math.log(HISTOGRAM_MAX_MS);
killedBy: BucketedHistogram merge từ plain object { buckets } — count/sum ước lượng qua mid-bucket
statusReason: expected 4.738381338321525e+115 to be less than 100000

[Survived] ArithmeticOperator
loadtest/metrics.ts:47:19
 
   /** Giá trị đại diện giữa bucket (log-mid) — dùng ước lượng sum khi merge nguồn thô. */
   private static bucketMidMs(idx: number): number {
-    const frac = (idx + 0.5) / HISTOGRAM_BUCKETS;
+    const frac = (idx - 0.5) / HISTOGRAM_BUCKETS;
     const logMin = Math.log(HISTOGRAM_MIN_MS);
     const logMax = Math.log(HISTOGRAM_MAX_MS);

[Survived] ArithmeticOperator
loadtest/metrics.ts:50:30
     const frac = (idx + 0.5) / HISTOGRAM_BUCKETS;
     const logMin = Math.log(HISTOGRAM_MIN_MS);
     const logMax = Math.log(HISTOGRAM_MAX_MS);
-    return Math.exp(logMin + frac * (logMax - logMin));
+    return Math.exp(logMin + frac / (logMax - logMin));
   }
 

[Survived] ArithmeticOperator
loadtest/metrics.ts:50:38
     const frac = (idx + 0.5) / HISTOGRAM_BUCKETS;
     const logMin = Math.log(HISTOGRAM_MIN_MS);
     const logMax = Math.log(HISTOGRAM_MAX_MS);
-    return Math.exp(logMin + frac * (logMax - logMin));
+    return Math.exp(logMin + frac * (logMax + logMin));
   }
 

[Killed] BlockStatement
loadtest/metrics.ts:53:59
     return Math.exp(logMin + frac * (logMax - logMin));
   }
 
-  merge(other: { buckets: number[] } | BucketedHistogram) {
-    const isHist = other instanceof BucketedHistogram;
-    const ob = other.buckets;
-    for (let i = 0; i < Math.min(ob.length, this.buckets.length); i++) this.buckets[i] += ob[i];
-    if (isHist) {
-      this.count += (other as BucketedHistogram).getCount();
-      this.sumMs += (other as BucketedHistogram).getSum();
-    } else {
-      for (let i = 0; i < ob.length; i++) {
-        if (ob[i]) {
-          this.sumMs += BucketedHistogram.bucketMidMs(i) * ob[i];
-          this.count += ob[i];
-        }
-      }
-    }
-  }
+  merge(other: { buckets: number[] } | BucketedHistogram) {}
 
   getCount(): number {
killedBy: buildReport per-action success rate dùng ok/fail thật theo action (AC6.1)
statusReason: expected +0 to be 100 // Object.is equality

[Killed] EqualityOperator
loadtest/metrics.ts:56:21
   merge(other: { buckets: number[] } | BucketedHistogram) {
     const isHist = other instanceof BucketedHistogram;
     const ob = other.buckets;
-    for (let i = 0; i < Math.min(ob.length, this.buckets.length); i++) this.buckets[i] += ob[i];
+    for (let i = 0; i <= Math.min(ob.length, this.buckets.length); i++) this.buckets[i] += ob[i];
     if (isHist) {
       this.count += (other as BucketedHistogram).getCount();
killedBy: reportToMarkdown — snapshot toàn bộ output (diệt string mutant) markdown đầy đủ ổn định (snapshot)
statusReason: Snapshot `reportToMarkdown — snapshot toàn bộ output (diệt string mutant) > markdown đầy đủ ổn định (snapshot) 1` mismatched

[Killed] ConditionalExpression
loadtest/metrics.ts:56:21
   merge(other: { buckets: number[] } | BucketedHistogram) {
     const isHist = other instanceof BucketedHistogram;
     const ob = other.buckets;
-    for (let i = 0; i < Math.min(ob.length, this.buckets.length); i++) this.buckets[i] += ob[i];
+    for (let i = 0; false; i++) this.buckets[i] += ob[i];
     if (isHist) {
       this.count += (other as BucketedHistogram).getCount();
killedBy: reportToMarkdown — snapshot toàn bộ output (diệt string mutant) markdown đầy đủ ổn định (snapshot)
statusReason: Snapshot `reportToMarkdown — snapshot toàn bộ output (diệt string mutant) > markdown đầy đủ ổn định (snapshot) 1` mismatched

[Killed] BlockStatement
loadtest/metrics.ts:57:17
     const isHist = other instanceof BucketedHistogram;
     const ob = other.buckets;
     for (let i = 0; i < Math.min(ob.length, this.buckets.length); i++) this.buckets[i] += ob[i];
-    if (isHist) {
-      this.count += (other as BucketedHistogram).getCount();
-      this.sumMs += (other as BucketedHistogram).getSum();
-    } else {
+    if (isHist) {} else {
       for (let i = 0; i < ob.length; i++) {
         if (ob[i]) {
killedBy: BucketedHistogram merge histogram
statusReason: expected 1 to be 3 // Object.is equality

[Killed] ConditionalExpression
loadtest/metrics.ts:57:9
     const isHist = other instanceof BucketedHistogram;
     const ob = other.buckets;
     for (let i = 0; i < Math.min(ob.length, this.buckets.length); i++) this.buckets[i] += ob[i];
-    if (isHist) {
+    if (true) {
       this.count += (other as BucketedHistogram).getCount();
       this.sumMs += (other as BucketedHistogram).getSum();
killedBy: buildReport per-action success rate dùng ok/fail thật theo action (AC6.1)
statusReason: other.getCount is not a function

[Killed] AssignmentOperator
loadtest/metrics.ts:58:7
     const ob = other.buckets;
     for (let i = 0; i < Math.min(ob.length, this.buckets.length); i++) this.buckets[i] += ob[i];
     if (isHist) {
-      this.count += (other as BucketedHistogram).getCount();
+      this.count -= (other as BucketedHistogram).getCount();
       this.sumMs += (other as BucketedHistogram).getSum();
     } else {
killedBy: BucketedHistogram merge histogram
statusReason: expected -1 to be 3 // Object.is equality

[Killed] AssignmentOperator
loadtest/metrics.ts:59:7
     for (let i = 0; i < Math.min(ob.length, this.buckets.length); i++) this.buckets[i] += ob[i];
     if (isHist) {
       this.count += (other as BucketedHistogram).getCount();
-      this.sumMs += (other as BucketedHistogram).getSum();
+      this.sumMs -= (other as BucketedHistogram).getSum();
     } else {
       for (let i = 0; i < ob.length; i++) {
killedBy: ActionHistograms mergedTotal gộp toàn bộ action (latency tổng P50/P95/P99)
statusReason: expected -150 to be 150 // Object.is equality

[Killed] BlockStatement
loadtest/metrics.ts:60:12
     if (isHist) {
       this.count += (other as BucketedHistogram).getCount();
       this.sumMs += (other as BucketedHistogram).getSum();
-    } else {
-      for (let i = 0; i < ob.length; i++) {
-        if (ob[i]) {
-          this.sumMs += BucketedHistogram.bucketMidMs(i) * ob[i];
-          this.count += ob[i];
-        }
-      }
-    }
+    } else {}
   }
 
killedBy: BucketedHistogram merge từ plain object { buckets } — count/sum ước lượng qua mid-bucket
statusReason: expected 1 to be 11 // Object.is equality

[Killed] ConditionalExpression
loadtest/metrics.ts:61:23
       this.count += (other as BucketedHistogram).getCount();
       this.sumMs += (other as BucketedHistogram).getSum();
     } else {
-      for (let i = 0; i < ob.length; i++) {
+      for (let i = 0; false; i++) {
         if (ob[i]) {
           this.sumMs += BucketedHistogram.bucketMidMs(i) * ob[i];
killedBy: buildReport per-action success rate dùng ok/fail thật theo action (AC6.1)
statusReason: expected +0 to be 100 // Object.is equality

[Killed] BlockStatement
loadtest/metrics.ts:61:43
       this.count += (other as BucketedHistogram).getCount();
       this.sumMs += (other as BucketedHistogram).getSum();
     } else {
-      for (let i = 0; i < ob.length; i++) {
-        if (ob[i]) {
-          this.sumMs += BucketedHistogram.bucketMidMs(i) * ob[i];
-          this.count += ob[i];
-        }
-      }
+      for (let i = 0; i < ob.length; i++) {}
     }
   }
killedBy: buildReport per-action success rate dùng ok/fail thật theo action (AC6.1)
statusReason: expected +0 to be 100 // Object.is equality

[Killed] ConditionalExpression
loadtest/metrics.ts:62:13
       this.sumMs += (other as BucketedHistogram).getSum();
     } else {
       for (let i = 0; i < ob.length; i++) {
-        if (ob[i]) {
+        if (false) {
           this.sumMs += BucketedHistogram.bucketMidMs(i) * ob[i];
           this.count += ob[i];
killedBy: buildReport per-action success rate dùng ok/fail thật theo action (AC6.1)
statusReason: expected +0 to be 100 // Object.is equality

[Killed] BlockStatement
loadtest/metrics.ts:62:20
       this.sumMs += (other as BucketedHistogram).getSum();
     } else {
       for (let i = 0; i < ob.length; i++) {
-        if (ob[i]) {
-          this.sumMs += BucketedHistogram.bucketMidMs(i) * ob[i];
-          this.count += ob[i];
-        }
+        if (ob[i]) {}
       }
     }
killedBy: buildReport per-action success rate dùng ok/fail thật theo action (AC6.1)
statusReason: expected +0 to be 100 // Object.is equality

[Survived] AssignmentOperator
loadtest/metrics.ts:63:11
     } else {
       for (let i = 0; i < ob.length; i++) {
         if (ob[i]) {
-          this.sumMs += BucketedHistogram.bucketMidMs(i) * ob[i];
+          this.sumMs -= BucketedHistogram.bucketMidMs(i) * ob[i];
           this.count += ob[i];
         }

[Survived] ArithmeticOperator
loadtest/metrics.ts:63:25
     } else {
       for (let i = 0; i < ob.length; i++) {
         if (ob[i]) {
-          this.sumMs += BucketedHistogram.bucketMidMs(i) * ob[i];
+          this.sumMs += BucketedHistogram.bucketMidMs(i) / ob[i];
           this.count += ob[i];
         }

[Killed] AssignmentOperator
loadtest/metrics.ts:64:11
       for (let i = 0; i < ob.length; i++) {
         if (ob[i]) {
           this.sumMs += BucketedHistogram.bucketMidMs(i) * ob[i];
-          this.count += ob[i];
+          this.count -= ob[i];
         }
       }
killedBy: buildReport per-action success rate dùng ok/fail thật theo action (AC6.1)
statusReason: expected -100 to be 100 // Object.is equality

[Killed] BlockStatement
loadtest/metrics.ts:70:22
     }
   }
 
-  getCount(): number {
-    return this.count;
-  }
+  getCount(): number {}
 
   getSum(): number {
killedBy: buildReport per-action success rate dùng ok/fail thật theo action (AC6.1)
statusReason: expected undefined to be 100 // Object.is equality

[Killed] BlockStatement
loadtest/metrics.ts:74:20
     return this.count;
   }
 
-  getSum(): number {
-    return this.sumMs;
-  }
+  getSum(): number {}
 
   quantile(q: number): number {
killedBy: BucketedHistogram merge từ plain object { buckets } — count/sum ước lượng qua mid-bucket
statusReason: actual value must be number or bigint, received "undefined"

[Killed] BlockStatement
loadtest/metrics.ts:78:31
     return this.sumMs;
   }
 
-  quantile(q: number): number {
-    if (this.count === 0) return 0;
-    const target = q * this.count;
-    let cum = 0;
-    for (let i = 0; i < this.buckets.length; i++) {
-      cum += this.buckets[i];
-      if (cum >= target) {
-        // trả về giá trị đại diện đầu bucket (log-mid) — đủ chính xác cho P50/P95/P99
-        const frac = i / this.buckets.length;
-        const logMin = Math.log(HISTOGRAM_MIN_MS);
-        const logMax = Math.log(HISTOGRAM_MAX_MS);
-        return Math.round(Math.exp(logMin + frac * (logMax - logMin)));
-      }
-    }
-    return HISTOGRAM_MAX_MS;
-  }
+  quantile(q: number): number {}
 
   quantiles(): Quantiles {
killedBy: reportToMarkdown — snapshot toàn bộ output (diệt string mutant) markdown đầy đủ ổn định (snapshot)
statusReason: Snapshot `reportToMarkdown — snapshot toàn bộ output (diệt string mutant) > markdown đầy đủ ổn định (snapshot) 1` mismatched

[Killed] EqualityOperator
loadtest/metrics.ts:79:9
   }
 
   quantile(q: number): number {
-    if (this.count === 0) return 0;
+    if (this.count !== 0) return 0;
     const target = q * this.count;
     let cum = 0;
killedBy: reportToMarkdown — snapshot toàn bộ output (diệt string mutant) markdown đầy đủ ổn định (snapshot)
statusReason: Snapshot `reportToMarkdown — snapshot toàn bộ output (diệt string mutant) > markdown đầy đủ ổn định (snapshot) 1` mismatched

[Killed] ConditionalExpression
loadtest/metrics.ts:79:9
   }
 
   quantile(q: number): number {
-    if (this.count === 0) return 0;
+    if (true) return 0;
     const target = q * this.count;
     let cum = 0;
killedBy: reportToMarkdown — snapshot toàn bộ output (diệt string mutant) markdown đầy đủ ổn định (snapshot)
statusReason: Snapshot `reportToMarkdown — snapshot toàn bộ output (diệt string mutant) > markdown đầy đủ ổn định (snapshot) 1` mismatched

[Killed] ArithmeticOperator
loadtest/metrics.ts:80:20
 
   quantile(q: number): number {
     if (this.count === 0) return 0;
-    const target = q * this.count;
+    const target = q / this.count;
     let cum = 0;
     for (let i = 0; i < this.buckets.length; i++) {
killedBy: BucketedHistogram P50/P95/P99 đúng với dữ liệu cố định
statusReason: expected 98 to be greater than or equal to 150

[Killed] EqualityOperator
loadtest/metrics.ts:82:21
     if (this.count === 0) return 0;
     const target = q * this.count;
     let cum = 0;
-    for (let i = 0; i < this.buckets.length; i++) {
+    for (let i = 0; i >= this.buckets.length; i++) {
       cum += this.buckets[i];
       if (cum >= target) {
killedBy: reportToMarkdown — snapshot toàn bộ output (diệt string mutant) markdown đầy đủ ổn định (snapshot)
statusReason: Snapshot `reportToMarkdown — snapshot toàn bộ output (diệt string mutant) > markdown đầy đủ ổn định (snapshot) 1` mismatched

[Killed] ConditionalExpression
loadtest/metrics.ts:82:21
     if (this.count === 0) return 0;
     const target = q * this.count;
     let cum = 0;
-    for (let i = 0; i < this.buckets.length; i++) {
+    for (let i = 0; false; i++) {
       cum += this.buckets[i];
       if (cum >= target) {
killedBy: reportToMarkdown — snapshot toàn bộ output (diệt string mutant) markdown đầy đủ ổn định (snapshot)
statusReason: Snapshot `reportToMarkdown — snapshot toàn bộ output (diệt string mutant) > markdown đầy đủ ổn định (snapshot) 1` mismatched

[Killed] AssignmentOperator
loadtest/metrics.ts:83:7
     const target = q * this.count;
     let cum = 0;
     for (let i = 0; i < this.buckets.length; i++) {
-      cum += this.buckets[i];
+      cum -= this.buckets[i];
       if (cum >= target) {
         // trả về giá trị đại diện đầu bucket (log-mid) — đủ chính xác cho P50/P95/P99
killedBy: reportToMarkdown — snapshot toàn bộ output (diệt string mutant) markdown đầy đủ ổn định (snapshot)
statusReason: Snapshot `reportToMarkdown — snapshot toàn bộ output (diệt string mutant) > markdown đầy đủ ổn định (snapshot) 1` mismatched

[Killed] ConditionalExpression
loadtest/metrics.ts:84:11
     let cum = 0;
     for (let i = 0; i < this.buckets.length; i++) {
       cum += this.buckets[i];
-      if (cum >= target) {
+      if (false) {
         // trả về giá trị đại diện đầu bucket (log-mid) — đủ chính xác cho P50/P95/P99
         const frac = i / this.buckets.length;
killedBy: reportToMarkdown — snapshot toàn bộ output (diệt string mutant) markdown đầy đủ ổn định (snapshot)
statusReason: Snapshot `reportToMarkdown — snapshot toàn bộ output (diệt string mutant) > markdown đầy đủ ổn định (snapshot) 1` mismatched

[Killed] ConditionalExpression
loadtest/metrics.ts:84:11
     let cum = 0;
     for (let i = 0; i < this.buckets.length; i++) {
       cum += this.buckets[i];
-      if (cum >= target) {
+      if (true) {
         // trả về giá trị đại diện đầu bucket (log-mid) — đủ chính xác cho P50/P95/P99
         const frac = i / this.buckets.length;
killedBy: reportToMarkdown — snapshot toàn bộ output (diệt string mutant) markdown đầy đủ ổn định (snapshot)
statusReason: Snapshot `reportToMarkdown — snapshot toàn bộ output (diệt string mutant) > markdown đầy đủ ổn định (snapshot) 1` mismatched

[Killed] ArithmeticOperator
loadtest/metrics.ts:86:22
       cum += this.buckets[i];
       if (cum >= target) {
         // trả về giá trị đại diện đầu bucket (log-mid) — đủ chính xác cho P50/P95/P99
-        const frac = i / this.buckets.length;
+        const frac = i * this.buckets.length;
         const logMin = Math.log(HISTOGRAM_MIN_MS);
         const logMax = Math.log(HISTOGRAM_MAX_MS);
killedBy: reportToMarkdown — snapshot toàn bộ output (diệt string mutant) markdown đầy đủ ổn định (snapshot)
statusReason: Snapshot `reportToMarkdown — snapshot toàn bộ output (diệt string mutant) > markdown đầy đủ ổn định (snapshot) 1` mismatched

[Killed] ArithmeticOperator
loadtest/metrics.ts:89:45
         const frac = i / this.buckets.length;
         const logMin = Math.log(HISTOGRAM_MIN_MS);
         const logMax = Math.log(HISTOGRAM_MAX_MS);
-        return Math.round(Math.exp(logMin + frac * (logMax - logMin)));
+        return Math.round(Math.exp(logMin + frac / (logMax - logMin)));
       }
     }
killedBy: reportToMarkdown — snapshot toàn bộ output (diệt string mutant) markdown đầy đủ ổn định (snapshot)
statusReason: Snapshot `reportToMarkdown — snapshot toàn bộ output (diệt string mutant) > markdown đầy đủ ổn định (snapshot) 1` mismatched

[Killed] ArithmeticOperator
loadtest/metrics.ts:89:36
         const frac = i / this.buckets.length;
         const logMin = Math.log(HISTOGRAM_MIN_MS);
         const logMax = Math.log(HISTOGRAM_MAX_MS);
-        return Math.round(Math.exp(logMin + frac * (logMax - logMin)));
+        return Math.round(Math.exp(logMin - frac * (logMax - logMin)));
       }
     }
killedBy: BucketedHistogram P50/P95/P99 đúng với dữ liệu cố định
statusReason: expected 0 to be greater than or equal to 50

[Killed] BlockStatement
loadtest/metrics.ts:95:26
     return HISTOGRAM_MAX_MS;
   }
 
-  quantiles(): Quantiles {
-    return {
-      p50: this.quantile(0.5),
-      p95: this.quantile(0.95),
-      p99: this.quantile(0.99),
-      avg: this.count > 0 ? Math.round(this.sumMs / this.count) : 0,
-      count: this.count,
-    };
-  }
+  quantiles(): Quantiles {}
 
   toJSON(): number[] {
killedBy: buildReport per-action success rate dùng ok/fail thật theo action (AC6.1)
statusReason: Cannot read properties of undefined (reading 'avg')

[Killed] ConditionalExpression
loadtest/metrics.ts:100:12
       p50: this.quantile(0.5),
       p95: this.quantile(0.95),
       p99: this.quantile(0.99),
-      avg: this.count > 0 ? Math.round(this.sumMs / this.count) : 0,
+      avg: false ? Math.round(this.sumMs / this.count) : 0,
       count: this.count,
     };
killedBy: BucketedHistogram P50/P95/P99 đúng với dữ liệu cố định
statusReason: expected +0 to be 150 // Object.is equality

[Killed] ArithmeticOperator
loadtest/metrics.ts:100:40
       p50: this.quantile(0.5),
       p95: this.quantile(0.95),
       p99: this.quantile(0.99),
-      avg: this.count > 0 ? Math.round(this.sumMs / this.count) : 0,
+      avg: this.count > 0 ? Math.round(this.sumMs * this.count) : 0,
       count: this.count,
     };
killedBy: BucketedHistogram P50/P95/P99 đúng với dữ liệu cố định
statusReason: expected 1500000 to be 150 // Object.is equality

[Killed] BlockStatement
loadtest/metrics.ts:105:22
     };
   }
 
-  toJSON(): number[] {
-    return this.buckets;
-  }
+  toJSON(): number[] {}
 }
 
killedBy: BucketedHistogram toJSON trả về chính buckets array
statusReason: Target cannot be null or undefined.

[Killed] BlockStatement
loadtest/metrics.ts:114:40
 export class ActionHistograms {
   private map = new Map<string, BucketedHistogram>();
 
-  add(action: string, valueMs: number) {
-    let h = this.map.get(action);
-    if (!h) {
-      h = new BucketedHistogram();
-      this.map.set(action, h);
-    }
-    h.add(valueMs);
-  }
+  add(action: string, valueMs: number) {}
 
   mergeFrom(action: string, buckets: number[]) {
killedBy: ActionHistograms add/mergeFrom tạo histogram mới + get theo action
statusReason: expected undefined to be 2 // Object.is equality

[Killed] ConditionalExpression
loadtest/metrics.ts:116:9
 
   add(action: string, valueMs: number) {
     let h = this.map.get(action);
-    if (!h) {
+    if (false) {
       h = new BucketedHistogram();
       this.map.set(action, h);
killedBy: ActionHistograms add/mergeFrom tạo histogram mới + get theo action
statusReason: Cannot read properties of undefined (reading 'add')

[Killed] BlockStatement
loadtest/metrics.ts:116:13
 
   add(action: string, valueMs: number) {
     let h = this.map.get(action);
-    if (!h) {
-      h = new BucketedHistogram();
-      this.map.set(action, h);
-    }
+    if (!h) {}
     h.add(valueMs);
   }
killedBy: ActionHistograms add/mergeFrom tạo histogram mới + get theo action
statusReason: Cannot read properties of undefined (reading 'add')

[Killed] BlockStatement
loadtest/metrics.ts:123:48
     h.add(valueMs);
   }
 
-  mergeFrom(action: string, buckets: number[]) {
-    let h = this.map.get(action);
-    if (!h) {
-      h = new BucketedHistogram(buckets.length);
-      this.map.set(action, h);
-    }
-    h.merge({ buckets });
-  }
+  mergeFrom(action: string, buckets: number[]) {}
 
   get(action: string): BucketedHistogram | undefined {
killedBy: ActionHistograms add/mergeFrom tạo histogram mới + get theo action
statusReason: expected undefined to be 3 // Object.is equality

[Killed] BooleanLiteral
loadtest/metrics.ts:125:9
 
   mergeFrom(action: string, buckets: number[]) {
     let h = this.map.get(action);
-    if (!h) {
+    if (h) {
       h = new BucketedHistogram(buckets.length);
       this.map.set(action, h);
killedBy: ActionHistograms add/mergeFrom tạo histogram mới + get theo action
statusReason: Cannot read properties of undefined (reading 'merge')

[Killed] BlockStatement
loadtest/metrics.ts:125:13
 
   mergeFrom(action: string, buckets: number[]) {
     let h = this.map.get(action);
-    if (!h) {
-      h = new BucketedHistogram(buckets.length);
-      this.map.set(action, h);
-    }
+    if (!h) {}
     h.merge({ buckets });
   }
killedBy: ActionHistograms add/mergeFrom tạo histogram mới + get theo action
statusReason: Cannot read properties of undefined (reading 'merge')

[Killed] BlockStatement
loadtest/metrics.ts:132:54
     h.merge({ buckets });
   }
 
-  get(action: string): BucketedHistogram | undefined {
-    return this.map.get(action);
-  }
+  get(action: string): BucketedHistogram | undefined {}
 
   /** Gộp toàn bộ (cho latency tổng P50/P95/P99 toàn run — UI-SPEC tick.latency). */
killedBy: ActionHistograms add/mergeFrom tạo histogram mới + get theo action
statusReason: expected undefined to be 2 // Object.is equality

[Killed] BlockStatement
loadtest/metrics.ts:137:36
   }
 
   /** Gộp toàn bộ (cho latency tổng P50/P95/P99 toàn run — UI-SPEC tick.latency). */
-  mergedTotal(): BucketedHistogram {
-    const out = new BucketedHistogram();
-    for (const h of this.map.values()) out.merge(h);
-    return out;
-  }
+  mergedTotal(): BucketedHistogram {}
 
   keys(): string[] {
killedBy: ActionHistograms mergedTotal gộp toàn bộ action (latency tổng P50/P95/P99)
statusReason: Cannot read properties of undefined (reading 'getCount')

[Killed] BlockStatement
loadtest/metrics.ts:143:20
     return out;
   }
 
-  keys(): string[] {
-    return [...this.map.keys()];
-  }
+  keys(): string[] {}
 
   toJSON(): Record<string, number[]> {
killedBy: ActionHistograms add/mergeFrom tạo histogram mới + get theo action
statusReason: Cannot read properties of undefined (reading 'sort')
