[Killed] BlockStatement
loadtest/metrics.ts:147:38
     return [...this.map.keys()];
   }
 
-  toJSON(): Record<string, number[]> {
-    const out: Record<string, number[]> = {};
-    for (const [k, h] of this.map) out[k] = h.buckets;
-    return out;
-  }
+  toJSON(): Record<string, number[]> {}
 }
 
killedBy: ActionHistograms toJSON: record action → buckets array
statusReason: Cannot convert undefined or null to object

[Killed] BlockStatement
loadtest/metrics.ts:157:14
 /** Counter tăng nhanh — đảm bảo không âm sau delta. */
 export class Counter {
   private v = 0;
-  inc(n = 1) {
-    this.v += n;
-  }
+  inc(n = 1) {}
   get(): number {
     return this.v;
killedBy: Counter inc/get/reset
statusReason: expected +0 to be 4 // Object.is equality

[Killed] AssignmentOperator
loadtest/metrics.ts:158:5
 export class Counter {
   private v = 0;
   inc(n = 1) {
-    this.v += n;
+    this.v -= n;
   }
   get(): number {
killedBy: Counter inc/get/reset
statusReason: expected -4 to be 4 // Object.is equality

[Killed] BlockStatement
loadtest/metrics.ts:160:17
   inc(n = 1) {
     this.v += n;
   }
-  get(): number {
-    return this.v;
-  }
+  get(): number {}
   reset() {
     this.v = 0;
killedBy: Counter inc/get/reset
statusReason: expected undefined to be +0 // Object.is equality

[Killed] BlockStatement
loadtest/metrics.ts:163:11
   get(): number {
     return this.v;
   }
-  reset() {
-    this.v = 0;
-  }
+  reset() {}
 }
 
killedBy: Counter inc/get/reset
statusReason: expected 4 to be +0 // Object.is equality

[Killed] ArrayDeclaration
loadtest/metrics.ts:170:52
 
 /** Sliding window 60s cho auto-stop thresholds (register fail > 50% etc.). */
 export class SlidingWindow {
-  private entries: { ts: number; ok: boolean }[] = [];
+  private entries: { ts: number; ok: boolean }[] = ["Stryker was here"];
   constructor(private windowMs = 60_000) {}
 
killedBy: SlidingWindow failRatePct tính đúng trong cửa sổ
statusReason: expected 75 to be close to 66.7, received difference is 8.299999999999997, but expected 0.05

[Killed] BlockStatement
loadtest/metrics.ts:173:20
   private entries: { ts: number; ok: boolean }[] = [];
   constructor(private windowMs = 60_000) {}
 
-  add(ok: boolean) {
-    this.entries.push({ ts: Date.now(), ok });
-    const cutoff = Date.now() - this.windowMs;
-    while (this.entries.length && this.entries[0].ts < cutoff) this.entries.shift();
-  }
+  add(ok: boolean) {}
 
   /** Tỷ lệ fail trong cửa sổ (0-100). 0 nếu chưa có dữ liệu. */
killedBy: SlidingWindow failRatePct tính đúng trong cửa sổ
statusReason: expected +0 to be close to 66.7, received difference is 66.7, but expected 0.05

[Killed] ArithmeticOperator
loadtest/metrics.ts:175:20
 
   add(ok: boolean) {
     this.entries.push({ ts: Date.now(), ok });
-    const cutoff = Date.now() - this.windowMs;
+    const cutoff = Date.now() + this.windowMs;
     while (this.entries.length && this.entries[0].ts < cutoff) this.entries.shift();
   }
killedBy: SlidingWindow failRatePct tính đúng trong cửa sổ
statusReason: expected +0 to be close to 66.7, received difference is 66.7, but expected 0.05

[Killed] ConditionalExpression
loadtest/metrics.ts:176:35
   add(ok: boolean) {
     this.entries.push({ ts: Date.now(), ok });
     const cutoff = Date.now() - this.windowMs;
-    while (this.entries.length && this.entries[0].ts < cutoff) this.entries.shift();
+    while (this.entries.length && true) this.entries.shift();
   }
 
killedBy: SlidingWindow failRatePct tính đúng trong cửa sổ
statusReason: expected +0 to be close to 66.7, received difference is 66.7, but expected 0.05

[Killed] EqualityOperator
loadtest/metrics.ts:176:35
   add(ok: boolean) {
     this.entries.push({ ts: Date.now(), ok });
     const cutoff = Date.now() - this.windowMs;
-    while (this.entries.length && this.entries[0].ts < cutoff) this.entries.shift();
+    while (this.entries.length && this.entries[0].ts >= cutoff) this.entries.shift();
   }
 
killedBy: SlidingWindow failRatePct tính đúng trong cửa sổ
statusReason: expected +0 to be close to 66.7, received difference is 66.7, but expected 0.05

[Killed] BlockStatement
loadtest/metrics.ts:180:25
   }
 
   /** Tỷ lệ fail trong cửa sổ (0-100). 0 nếu chưa có dữ liệu. */
-  failRatePct(): number {
-    if (this.entries.length === 0) return 0;
-    let fails = 0;
-    for (const e of this.entries) if (!e.ok) fails++;
-    return (fails / this.entries.length) * 100;
-  }
+  failRatePct(): number {}
 
   get size(): number {
killedBy: SlidingWindow failRatePct tính đúng trong cửa sổ
statusReason: expected undefined to be close to 66.7, received difference is NaN, but expected 0.05

[Killed] EqualityOperator
loadtest/metrics.ts:181:9
 
   /** Tỷ lệ fail trong cửa sổ (0-100). 0 nếu chưa có dữ liệu. */
   failRatePct(): number {
-    if (this.entries.length === 0) return 0;
+    if (this.entries.length !== 0) return 0;
     let fails = 0;
     for (const e of this.entries) if (!e.ok) fails++;
killedBy: SlidingWindow failRatePct tính đúng trong cửa sổ
statusReason: expected +0 to be close to 66.7, received difference is 66.7, but expected 0.05

[Killed] ConditionalExpression
loadtest/metrics.ts:181:9
 
   /** Tỷ lệ fail trong cửa sổ (0-100). 0 nếu chưa có dữ liệu. */
   failRatePct(): number {
-    if (this.entries.length === 0) return 0;
+    if (true) return 0;
     let fails = 0;
     for (const e of this.entries) if (!e.ok) fails++;
killedBy: SlidingWindow failRatePct tính đúng trong cửa sổ
statusReason: expected +0 to be close to 66.7, received difference is 66.7, but expected 0.05

[Killed] BooleanLiteral
loadtest/metrics.ts:183:39
   failRatePct(): number {
     if (this.entries.length === 0) return 0;
     let fails = 0;
-    for (const e of this.entries) if (!e.ok) fails++;
+    for (const e of this.entries) if (e.ok) fails++;
     return (fails / this.entries.length) * 100;
   }
killedBy: SlidingWindow failRatePct tính đúng trong cửa sổ
statusReason: expected 33.33333333333333 to be close to 66.7, received difference is 33.366666666666674, but expected 0.05

[Killed] ConditionalExpression
loadtest/metrics.ts:183:39
   failRatePct(): number {
     if (this.entries.length === 0) return 0;
     let fails = 0;
-    for (const e of this.entries) if (!e.ok) fails++;
+    for (const e of this.entries) if (true) fails++;
     return (fails / this.entries.length) * 100;
   }
killedBy: SlidingWindow failRatePct tính đúng trong cửa sổ
statusReason: expected 100 to be close to 66.7, received difference is 33.3, but expected 0.05

[Killed] ArithmeticOperator
loadtest/metrics.ts:184:12
     if (this.entries.length === 0) return 0;
     let fails = 0;
     for (const e of this.entries) if (!e.ok) fails++;
-    return (fails / this.entries.length) * 100;
+    return fails / this.entries.length / 100;
   }
 
killedBy: SlidingWindow failRatePct tính đúng trong cửa sổ
statusReason: expected 0.006666666666666666 to be close to 66.7, received difference is 66.69333333333334, but expected 0.05

[Killed] ArithmeticOperator
loadtest/metrics.ts:184:13
     if (this.entries.length === 0) return 0;
     let fails = 0;
     for (const e of this.entries) if (!e.ok) fails++;
-    return (fails / this.entries.length) * 100;
+    return (fails * this.entries.length) * 100;
   }
 
killedBy: SlidingWindow failRatePct tính đúng trong cửa sổ
statusReason: expected 600 to be close to 66.7, received difference is 533.3, but expected 0.05

[Killed] BlockStatement
loadtest/metrics.ts:187:22
     return (fails / this.entries.length) * 100;
   }
 
-  get size(): number {
-    return this.entries.length;
-  }
+  get size(): number {}
 }
 
killedBy: SlidingWindow loại bỏ entry cũ ngoài cửa sổ
statusReason: actual value must be number or bigint, received "undefined"
